Repository: bobmcwhirter/jboss-messaging
Catalog: docs/EAP_4_3/JBoss_Messaging_User_Guide/*/Bridge.po
Languages: de_de, es_es, fr_fr, ja_jp, pt_br, zh_cn

source: If your target destination is on a different server or even correspond to a different, non JBoss JMS provider, then you can deploy another JMSProviderLoader MBean instance which references the remote JMS provider, and reference that from this attribute. The bridge would then use that remote JMS provider to contact the target destination
de_de: Falls Ihre Ziel-Destination sich auf einem anderen Server befindet oder sogar mit einem anderen, nicht-JBoss JMS Provider korrespondiert, so können Sie eine weitere JMSProviderLoader MBean Instanz deployen, die den Remote JMS Provider referenziert und dies von diesem Attribut aus referenzieren. Die Bridge würde dann den Remote JMS Provider verwenden, um die Zel-Destination zu kontaktieren
es_es: Si su destino objetivo se encuentra en un servidor diferente o si corresponde a un proveedor diferente que no es JBoss JMS entonces puede desplegar otra instancia MBean JMSProviderLoader, la cual referencia el proveedor remoto JMS y referencia eso desde este atributo. Entonces el puente utilizaría ese proveedor remoto JMS para contactar el destino objetivo.
fr_fr: Si votre destination-cible est sur un serveur différent ou bien qu'il corresponde à un prestataire différent non JBoss, alors vous pouvez déployer une autre instance du MBean JMSPRoviderLoader, qui référence le prestataire distant JMS, et qui le référence à partir de cet attribut. Le pont utiliserait alors ce prestataire distant JMS pour contacter la destination-cible.
ja_jp: ターゲット送り先 が別のサーバー上か、又は異なる非 JBoss JMS プロバイダーに対応する場合、 リモートの JMS プロバイダーを参照する JMSProviderLoader MBean インスタンスを デプロイして、この属性からそれを参照することができます。ブリッジはその後、その リモート JMS プロバイダーを使用してターゲット送り先 に連絡します。
pt_br: Caso seu ponto de destinação estiver em um servidor diferente ou mesmo correspondente, um provedor que não seja o JMS JBoss, então você poderá implementar outra instância da qual referencia o provedor remoto e o referencia a partir do atributo. A interligação poderia então usar aquele provedor JMS remoto para contatar o ponto de destinação.
zh_cn: 如果你的目标目的地位于不同的服务器上或者甚至对应非 JBoss JMS 提供者，那你可以部署引用远程 JMS 提供者的其他 JMSProviderLoader MBean 实例并用属性引用它。然后消息桥将使用那个远程 JMS 提供者来联系目标目的地。

source: This is the full JNDI lookup for the source destination using the SourceProviderLoader
de_de: Dies ist der vollständige JNDI-Lookup für die Quell-Destination unter Verwendung des SourceProviderLoader
es_es: Esta es la búsqueda JNDI completa para el destino fuente utilizando el SourceProviderLoader
fr_fr: C'est le lookup JNDI complet pour la destination source en utilisant le SourceProviderLoader
ja_jp: SourceProviderLoader を使用したソース 地点 用の完全な JNDI ルックアップです。
pt_br: Esta é a busca JNDI completa para o ponto de destinação usando o SourceProviderLoader.
zh_cn: 这是用于使用 SourceProviderLoader 的源目的地的完整的 JNDI 查找

source: An example would be /queue/mySourceQueue
de_de: Ein Beispiel wäre /queue/mySourceQueue
es_es: Un ejemplo sería /queue/mySourceQueue
fr_fr: Un exemple serait /queue/mySourceQueue
ja_jp: /queue/mySourceQueue はその一例です。
pt_br: Um exemplo pode ser a /queue/mySourceQueue.
zh_cn: 例如 /queue/mySourceQueue

source: This is the full JNDI lookup for the target destination using the TargetProviderLoader
de_de: Dies ist der vollständige JNDI-Lookup für die Zieldestination unter Verwendung des TargetProviderLoader
es_es: Esta es la búsqueda JNDI completa para el destino objetivo utilizando el TargetProviderLoader
fr_fr: C'est le lookup JNDI complet pour la destination-cible en utilisant le TargetProviderLoader.
ja_jp: TargetProviderLoader を使用したターゲット送り先 用の完全な JNDI ルックアップです。
pt_br: Esta é a busca JNDI completa para o ponto de destinação usando o TargetProviderLoader.
zh_cn: 这是用于使用 TargetProviderLoader 的目标目的地的完整的 JNDI 查找

source: An example would be /topic/myTargetTopic
de_de: Ein Beispiel wäre /topic/myTargetTopic
es_es: Un ejemplo sería /topic/myTargetTopic
fr_fr: Un exemple serait /topic/myTargetTopic
ja_jp: /topic/myTargetTopic はその一例です。
pt_br: Um exemplo pode ser o /topic/myTargetTopic.
zh_cn: 例如 /topic/myTargetTopic

source: This optional attribute is for when you need to specify the username for creating the source connection
de_de: Dieses optionale Attribut ist für wenn Sie beim Erstellen der Quell-Verbindung den Benutzernamen festlegen müssen
es_es: Este atributo opcional es para cuando necesita especificar el nombre de usuario para crear la conexión fuente
fr_fr: Cet attribut optionnel est utilisé quand vous avez besoin de spécifier le nom d'utilisateur pour créer la connexion source
ja_jp: ソース接続の作成用にユーザー名を指定する時の為のオプションの属性です。
pt_br: Este atributo opcional é para quando você precisar especificar o nome do usuário para criação da conexão de recurso.
zh_cn: 这个可选属性是创建源连接时所使用的用户名

source: This optional attribute is for when you need to specify the password for creating the source connection
de_de: Dieses optionale Attribut ist für wenn Sie beim Erstellen der Quell-Verbindung das Passwort festlegen müssen
es_es: Este atributo opcional es para cuando necesita especificar la contraseña para crear la conexión fuente
fr_fr: Cet attribut optionnel est utilisé quand vous avez besoin de préciser un mot de passe en vue de créer une connexion-source
ja_jp: ソース接続の作成用のパスワードを指定する必要がある時のオプションの属性です。
pt_br: Este atributo opcional é para quando você precisar especificar a senha para criação da conexão do recurso.
zh_cn: 这个可选属性是创建源连接时所使用的密码

source: This optional attribute is for when you need to specify the username for creating the target connection
de_de: Dieses optionale Attribut ist für wenn Sie beim Erstellen der Ziel-Verbindung den Benutzernamen festlegen müssen
es_es: Este atributo opcional es para cuando necesita especificar el nombre de usuario para crear la conexión objetivo
fr_fr: Cet attribut est utilisé quand on a besoin de préciser le nom d'utilisateur pour créer une connexion cible
ja_jp: ターゲット接続の作成用にユーザー名を指定する必要がある時のオプションの属性です。
pt_br: Este atributo opcional é para quando você precisar especificar o nome do usuário para a criação da conexão de destino.
zh_cn: 这个可选属性是创建目标连接时所使用的用户名

source: This optional attribute is for when you need to specify the password for creating the target connection
de_de: Dieses optionale Attribut ist für wenn Sie beim Erstellen der Ziel-Verbindung das Passwort festlegen müssen
es_es: Este atributo opcional es para cuando necesita especificar la contraseña para crear la conexión objetivo
fr_fr: Cet attribut optionnel est utilisé quand vous avez besoin de spécifier un mot de passe pour créer une connexion-cible
ja_jp: ターゲット接続の作成用のパスワードを指定する必要がある時のオプションの属性です。
pt_br: Este atributo opcional é para quando você precisar especificar a senha para criação da conexão de destino.
zh_cn: 这个可选属性是创建源连接时所使用的密码

source: This integer represents the desired quality of service mode
de_de: Dieser ganzzahlige Wert repräsentiert die gewünschte Qualität des Service-Modus
es_es: Este número entero representa la calidad deseada del modo de servicio
fr_fr: Cet entier relatif représente la qualité désirée du service mode
ja_jp: この整数はサービスモードの希望の品質を示します
pt_br: Este número representa a qualidade desejada do modo de serviço.
zh_cn: 这个整型值代表服务模式的级别

source: Possible values are:
de_de: Mögliche Werte sind:
es_es: Los valores posibles son:
fr_fr: Les valeurs possibles sont les suivantes:
ja_jp: 可能な値は次のようになります:
pt_br: Os possíveis valores são:
zh_cn: 其可能的取值为：

source: Please see <xref linkend="bridge.overview"/> for an explanation of what these mean.
de_de: Unter <xref linkend="bridge.overview"/> finden Sie eine Erklärung dazu, was diese bedeuten.
es_es: Consulte la <xref linkend="bridge.overview"/> para obtener una explicación sobre lo que significan.
fr_fr: Veuillez voir <xref linkend="bridge.overview"/> pour une explication.
ja_jp: これらの意味についての説明には、<xref linkend="bridge.overview"/> をご覧 下さい。
pt_br: Por favor, consulte <xref linkend="bridge.overview"/> para um melhor entendimento deste significado.
zh_cn: 具体解释请参考 <xref linkend="bridge.overview"/>。

source: Selector
de_de: Selektor
fr_fr: Sélecteur
pt_br: Seletor

source: This optional attribute can contain a JMS selector expression used for consuming messages from the source destination. Only messages that match the selector expression will be bridged from the source to the target destination
de_de: Dieses optionale Attribut kann einen JMS Selektor-Ausdruck enthalten, der zur Verbrauch von Nachrichten von der Quell-Destination verwendet werden kann. Nur Nachrichten, die mit dem Selektor-Ausdruck übereinstimmen werden von der Quelle zur Ziel-Destination überbrückt.
es_es: Este atributo opcional puede contener una expresión selector JMS utilizada para consumir mensajes desde el destino fuente. Sólo los mensajes que coincidan con la expresión del selector serán transportadas a través de un puente desde la fuente hasta el destino.
fr_fr: Cet attribut optionnel peut contenir une expression du sélecteur JMS, utilisée pour consommer des messages de la destination source. Seuls les messages qui correspondent à l'expression du sélecteur seront pontées de la source vers la destination-cible.
ja_jp: このオプション属性はソースからのメッセージを消費 するのに使用される JMS セレクター 表現を含むことができます。このセレクター表現に一致するメッセージのみがソースから ターゲット送り先 までブリッジされます。
pt_br: Este atributo opcional pode conter uma expressão de seletor JMS, usada para consumir mensagens do ponto de destinação. Apenas mensagens que podem coincidir com a expressão de seletor serão interligadas, a partir do recurso ao ponto de destinação.
zh_cn: 这个可选属性可以包含一个用于从源目的地提取消息的 JMS selector 表达式。只有匹配这个表达式的消息才会从源服务器转移到目标目的地。

source: Please note it is always more performant to apply selectors on source topic subscriptions to source queue consumers.
de_de: Bitte beachten Sie, dass es stets performanter ist Selektoren an Quell-Topic-Abonnements zu Quell-Warteschlangen-Verbrauchern anzuwenden.
es_es: Observe que siempre tiene más rendimiento el aplicar selectores en subscripciones de temas fuente a consumidores de colas fuente.
fr_fr: Veuillez noter qu'il est toujours plus performant d'appliquer des sélecteurs sur les abonnements du sujet-source vers les consommateurs de file d'attente-source.
ja_jp: ソース トピック サブスクリプション上のセレクターをソースキュー コンシューマ に 適用することでいつもパフォーマンスが向上することに注意して下さい。
pt_br: Perceba que é sempre mais eficiente aplicar-se seletores em subscrições de tópico de recurso a consumidores da fila de recurso.
zh_cn: 请注意，在源主题订阅上应用 Selector 比在源队列消费者总是具有更好的性能。

source: The selector expression must follow the JMS selector syntax specified here: <ulink url="http://java.sun.com/j2ee/1.4/docs/api/javax/jms/Message.html"></ulink>
de_de: Der Selektor-Ausdruck muss der JMS Selektor-Syntax folgen, wie sie hier festgelegt ist: <ulink url="http://java.sun.com/j2ee/1.4/docs/api/javax/jms/Message.html"></ulink>
es_es: La expresión del selector debe seguir la sintaxis del selector JMS especificada aquí: <ulink url="http://java.sun.com/j2ee/1.4/docs/api/javax/jms/Message.html"></ulink>
fr_fr: L'expression du sélecteur doit suivre la syntaxe du sélecteur JMS spécifiée ici: <ulink url="http://java.sun.com/j2ee/1.4/docs/api/javax/jms/Message.html"></ulink>
ja_jp: セレクターの表現はこのサイトに指定された JMS セレクター構文に従う必要があります。 <ulink url="http://java.sun.com/j2ee/1.4/docs/api/javax/jms/Message.html"></ulink>
pt_br: A expressão de seletor deve seguir a sintaxe do seletor JMS, especificada em <ulink url="http://java.sun.com/j2ee/1.4/docs/api/javax/jms/Message.html"></ulink>.
zh_cn: Selector 表达式必须遵循 JMS selector 语法：<ulink url="http://java.sun.com/j2ee/1.4/docs/api/javax/jms/Message.html"></ulink>

source: This attribute specifies the maximum number of messages to consume from the source destination before sending them in a batch to the target destination. It's value must &gt;= 1
de_de: Dieses Attribut legt die maximale Anzahl von Nachrichten fest, die von der Quell-Destination verwendet werden soll, ehe diese als Batch an die Ziel-Destination gesendet werden. Dieser Wert muss &gt;= 1 sein
es_es: Este atributo especifica el número máximo de mensajes a consumir desde el destino fuente antes de enviarlos en grupo al destino objetivo. Su valor debe ser &gt;= 1
fr_fr: Cet attribut précise le nombre maximum de messages à consommer en provenance de la destination-source avant de les envoyer dans un groupe vers la destination-cible. Sa valeur doit être &gt;= 1
ja_jp: この属性はターゲット送り先 にまとめてメッセージを送信する前にソース から 消費する メッセージの最大数を指定します。その値は &gt;= 1 でなければなりません。
pt_br: Este atributo especifica o número máximo de mensagens a serem consumidas de um ponto de destinação, antes de enviá-las em massa ao ponto de destinação. O valor máximo é &gt;= 1.
zh_cn: 这个属性指定在批量发送至目标目的地前从源目的地提取的消息的最大数量，它的值必须大于 1。

source: This attribute specifies the maximum number of milliseconds to wait before sending a batch to target, even if the number of messages consumed has not reached MaxBatchSize. It's value must can be -1 to represent 'wait forever', or &gt;=1 to specify an actual time.
de_de: Dieses Attribut legt die maximale Anzahl von Millisekunden fest, die gewartet werden soll, ehe ein Batch an ein Ziel gesendet wird, selbst wenn die Anzahl der verwendeten Nachrichten MaxBatchSize noch nicht erreicht hat. Der Wert muss/kann -1 sein, um 'wait forever' ("ewig warten"), oder &gt;=1 sein, um eine tatsächliche Zeit festzulegen.
es_es: Este atributo especifica el número máximo de milisegundos a esperar antes de enviar un grupo al destino incluso si el número de mensajes consumidos no ha alcanzado MaxBatchSize. Su valor puede ser -1 para representar 'espere por siempre' o &gt;=1 para especificar un tiempo real.
fr_fr: Cet attribut précise le nombre maximum de millesecondes qu'il faut attendre avant d'envoyer un groupe vers une cible, même si le nombre de messages consommés n'a pas atteint MaxBatchSize. Sa valeur peut être -1 pour représenter 'wait forever' (durée indéterminée), ou bien &gt;=1 pour préciser une durée.
ja_jp: この属性は、消費されるメッセージの数が MaxBatchSize に到達していなくても ターゲットにまとめて配信する前に待機する最大のミリ秒数を指定します。その値は、 無限待機を示す 「-1」や 実際の数を示す &gt;=1 となります。
pt_br: Este atributo especifica o número máximo em milésimo de segundo de espera, antes do envio em massa ao destino, mesmo se o número de mensagens consumidas não atingir o MaxBatchSize. O valor máximo pode ser -1 para representar espera eterna ou &gt;=1 para especificar o valor atual.
zh_cn: 这个属性指定在批量发送到目标前等待的最大毫秒数，即使消费的消息数量没有达到 MaxBatchSize。它的值为 -1 则表示“永远等待”，而 >=1 则表示实际的时间。

source: If the source destination represents a topic, and you want to consume from the topic using a durable subscription then this attribute represents the durable subscription name
de_de: Falls die Quell-Destination ein Topic repräsentiert und Sie von dem Topic unter Verwendung eines dauerhaften Abonnements verbrauchen wollen, dann repräsentiert dieses Attribut den Namen des dauerhaften Abonnements
es_es: Si el destino fuente representa un tema y quiere consumir desde el tema utilizando una descripción durable entonces este atributo representa el nombre de la subscripción durable
fr_fr: Si la destination source représente un sujet, et que vous souhaitez consommer à partir du sujet en utilisant un abonnement durable, alors cet attribut représente le nom de l'abonnement durable.
ja_jp: ソース送り先 が トピックを表し、そしてユーザーが恒久サブスクリプションを使用してトピックから 消費したい場合には、この属性はその恒久サブスクリプション名を表します。
pt_br: Caso o ponto de destinação representar um tópico e você queira realizar o consumo a partir de um tópico usando uma subscrição durável, então este atributo representará o nome de subscrição durável.
zh_cn: 如果源目的地是一个主题，且你想用持久性订阅（Durable Subscription）从这个主题消费消息，那么这个属性就是这个订阅的名字。

source: If the source destination represents a topic, and you want to consume from the topic using a durable subscription then this attribute represents the the JMS client ID to use when creating/looking up the durable subscription
de_de: Falls die Quell-Destination ein Topic repräsentiert und Sie von dem Topic unter Verwendung eines dauerhaften Abonnements verbrauchen wollen, dann repräsentiert dieses Attribut die zu verwendende JMS Client-ID bei der Erstellung/Suche des dauerhaften Abonnements
es_es: Si el destino fuente representa un tema y quiere consumir del tema utilizando una subscripción durable entonces este atributo representa el ID del cliente JMS a utilizar al crear/buscar la subscripción durable.
fr_fr: Si la destination source représente un sujet, et que vous souhaitez consommer à partir du sujet en utilisant un abonnement durable, alors cet attribut représente l'ID du client JMS à utiliser lorsque vous créez/cherchez un abonnement durable.
ja_jp: ソース送り先が トピックを表し、そしてユーザーが恒久サブスクリプションを使用してトピックから 消費したい場合に、この属性はその恒久サブスクリプションを作成およびルックアップする時に使用する JMS クライアントアイデンティティを示します。
pt_br: Caso a destinação de recurso representar um tópico, e você queira realizar o consumo a partir deste tópico usando a subscrição durável, então este atributo representa a ID do cliente JMS para uso quando criando/buscando a subscrição durável.
zh_cn: 如果源目的地是一个主题，而你想用一个持久性订阅从这个主题消费消息，那么这个属性就是用来创建/查找该订阅的 JMS 客户 ID。

source: This represents the amount of time in ms to wait between trying to recreate connections to the source or target servers when the bridge has detected they have failed
de_de: Dies repräsentiert die Dauer an Zeit in ms, die gewartet werden soll, ehe der Versuch unternommen wird, Verbindungen an die Quell- oder Ziel-Server wieder herzustellen, wenn die Bridge festgestellt hat, dass eine Fehlfunktion vorliegt
es_es: Este representa la cantidad de tiempo en ms a esperar entre el tratar de recrear las conexiones a los servidores destino o fuente cuando el puente ha detectado que han fallado
fr_fr: Cela représente la durée qu'il faut attendre (en ms) entre le moment où l'on essaie de recréer des connexions vers les serveurs-source ou cible, et quand le pont a détecté qu'ils ont échoué.
ja_jp: ブリッジが障害を検出して、ソース又はターゲットサーバーへの接続の再生を試みる時の繰り返し間隔を ミリ秒で示す時間です。
pt_br: Isto representa a quantia de tempo em ms de espera entre tentar e recriar conexões para o recurso ou servidores de destino, uma vez que a interligação detectar que elas falharam.
zh_cn: 它表示当消息桥检测到连接发生了故障时，在试图与源或目标服务器重建连接前等待的毫秒数。

source: This represents the number of times to attempt to recreate connections to the source or target servers when the bridge has detected they have failed. The bridge will give up after trying this number of times. -1 represents 'try forever'
de_de: Dies repräsentiert die Anzahl von Malen, die ein Versuch unternommen werden soll, Verbindungen an die Quell- oder Ziel-Server wieder herzustellen, wenn die Bridge festgestellt hat, dass eine Fehlfunktion vorliegt. Die Bridge stellt nach der festgelegten Anzahl von Malen weitere Versuche ein. -1 represäntiert 'try forever' (d.h. für immer versuchen).
es_es: Esto representa el número de veces a intentar recrear las conexiones a los servidores fuente o destino cuando el puente ha detectado que han fallado. El puente se rendirá después de intentar este número de veces. -1 representa 'intente indefinidamente'
fr_fr: Cela représente le nombre de tentatives de connexions vers les serveurs source ou cible quand le pont a détecté qu'ils ont échoué. Le pont abandonnera après ce nombre de tentatives. -1 représente 'try forever' (essayer indéfiniement)
ja_jp: これは、ブリッジが障害を検出した時にソース又はターゲットサーバーへの接続を再作成する回数を表します。ブリッジはこの回数を試行した後に諦めます。「-1」は「無限に 試行する」を意味します。
pt_br: Isto representa o número de vezes da tentativa de se recriar conexões para o recurso ou servidores de destino, quando a interligação tiver detectado que eles falharam. A interligação desistirá após a tentativa deste número de vezes. O -1 representa 'tentativa eterna'.
zh_cn: 它表示当消息桥检测到连接发生了故障时，与源或目标服务器重建连接的最多尝试次数。消息桥在尝试这个次数后将放弃。-1 表示“永远地尝试”。

source: If true, then the original message's message id will appended in the message sent to the destination in the header JBossMessage.JBOSS_MESSAGING_BRIDGE_MESSAGE_ID_LIST. If the message is bridged more than once each message-id will be appended. This enables a distributed request-response pattern to be used
de_de: Falls "true", so wird die Message-ID der original Nachricht der an die Destination gesendeten Nachricht im Header JBossMessage.JBOSS_MESSAGING_BRIDGE_MESSAGE_ID_LIST angehängt. Wird die Nachricht mehr als einmal "gebridged", so wird die Message-ID angehängt. Dies aktiviert die Verwendung eines distribuierten Anfragen-Antwort Musters
es_es: Si es verdadero entonces el id del mensage original se añadirá en el mensaje enviado al destino en el encabezado de JBossMessage.JBOSS_MESSAGING_BRIDGE_MESSAGE_ID_LIST. Si se realiza un puente para el mensaje más de una vez entonces se añadirá cada mensaje-id. Esto activa un patrón de petición-respuesta a utilizar.
fr_fr: Dans ce cas, l'id du message original sera annexé au message envoyé à la destination dans le titre du JBossMessage. JBOSS_MESSAGING_BRIDGE_MESSAGE_ID_LIST. Si le message est apponté plus d'une fois, chaque message-id sera annexé. Cela permet d'utiliser un modèle de demande-réponse distribué.
ja_jp: これが「true」の場合、オリジナルメッセージのメッセージ ID は送り先に送られた メッセージのヘッダー JBossMessage.JBOSS_MESSAGING_BRIDGE_MESSAGE_ID_LIST に追記されます。メッセージが１回以上ブリッジされる場合は、別々のメッセージ ID が追記されます。これにより、 分散型要求/応答パターンが使用できるようになります。
pt_br: Caso verdadeira, a id de mensagem da mensagem original irá anexar na mensagem enviada à destinação no cabeçalho do JBossMessage.JBOSS_MESSAGING_BRIDGE_MESSAGE_ID_LIST. Caso a mensagem for interligada mais de uma vez, cada message-id será anexada. Isto ativa a distribuída solicitação padrão de resposta a ser usada.
zh_cn: 它如果为 true，那么原始消息的 ID 将附加在发送到目的地的消息的消息头部 JBossMessage.JBOSS_MESSAGING_BRIDGE_MESSAGE_ID_LIST。如果这个消息被多次转发，那么每个 message-id 都将被附加。这使分布式的请求-应答（request-response）模式被使用。
