Repository: bobmcwhirter/jboss-messaging
Catalog: docs/EAP_4_3/JBoss_Messaging_User_Guide/*/Bridge.po
Languages: de_de, es_es, fr_fr, ja_jp, pt_br, zh_cn

source: This QoS mode ensures messages will reach the destination from the source once and only once. (Sometimes this mode is known as "exactly once"). If both the source and the destination are on the same JBoss Messaging server instance then this can be achieved by sending and acknowledging the messages in the same local transaction. If the source and destination are on different servers this is achieved by enlisting the sending and consuming sessions in a JTA transaction. The JTA transaction is controlled by JBoss Transactions JTA implementation which is a fully recovering transaction manager, thus providing a very high degree of durability. If JTA is required then both supplied connection factories need to be XAConnectionFactory implementations. This mode is only available for persistent messages. This is likely to be the slowest mode since it requires logging on both the transaction manager and resource side for recovery. If you require this level of QoS, please be sure to enable XA recovery with JBoss Transactions.
de_de: Dieser QoS-Modus stellt sicher, dass Nachrichten die Destination von der Quelle ein Mal und auch nur ein Mal erreichen. (Manchmal wird dieser Modus daher auch "exactly once" - d.h. "genau ein Mal" genannt). Befinden sich Quelle und Destination auf derselben JBoss Messaging Server-Instanz, so kann dies erfolgen, indem Nachrichten in derselben lokalen Transaktion gesendet und bestätigt werden. Befinden sich Quelle und Destination auf unterschiedlichen Servern, so erfolgt dies durch Eintragen der beendenden und verbrauchenden Sessions in eine JTA-Transaktion. Die JTA-Transaktion wird durch die JBoss Transactions JTA Implementierung gesteuert, bei der es sich um einen vollständig wiederherstellenden Transaction Manager handelt, so dass ein hohes Maß an Dauerhaftigkeit gewährleistet wird. Wird JTA benötigt, so müssen beide der bereitgestellten Connection Factories XAConnectionFactory Implementierungen sein. Dieser Modus ist nur für persistente Nachrichten verfügbar. Es handelt sich hierbei um den wahrscheinlich langsamsten Modus, da sowohl der Transaction Manager als auch die Ressourcen-Seite Protokollierung für die "Recovery" erfordern. Falls Sie diese Ebene von QoS benötigen, aktivieren Sie bitte XA Recovery bei JBoss Transactions.
es_es: Este modo QoS se asegura de que los mensajes lleguen al destino desde la fuente sólamente una vez (algunas veces este modo se conoce como "exactamente una vez"). Si tanto la fuente como el destino se encuentran en la misma instancia del servidor de JBoss Messaging entonces esto se puede lograr enviando y reconociendo los mensajes en la misma transacción local. Si la fuente y el destino se encuentran en servidores diferentes esto se logra listando las sesiones de envío y de consumo en una transacción JTA. La transacción JTA es controlada por la implementación JBoss Transactions JTA, la cual es un administrador de recuperación de transacciones y por lo tanto proporciona un alto grado de durabilidad. Si JTA se requiere entonces las dos fábricas de conexión que se proporcionan necesitan ser implementaciones XAConnectionFactory. Este modo sólo está disponible para mensajes persistentes. Con mucha probabilidad este es el modo mas lento ya que requiere el iniciar sesión en el administrador de transacciones y en el lado del recurso para recuperación. Si requiere este nivel de QoS asegúrese de activar la recuperación XA con JBoss Transactions.
fr_fr: Le mode QoS permet aux messages d'atteindre leur destination à partir de la source une fois et une seule fois pour toutes. (Parfois ce mode est connu comme 'exactement une'). Si la source et la destination sont tous les deux sur la même instance de serveur JBoss Messaging, alors on peut y arriver en envoyant et en confirmant les messages dans la même transaction locale. Si la source et la destination sont sur deux serveurs différents, on peut y arriver en enrôlant les sessions envoi et consommation dans une transaction JTA. La transaction JTA est contrôlée par l'implémentation JTA JBoss Transaction, qui est un gestionnaire de recouvrement de transactions, proposant donc un très haut niveau de fiabilité. Si on a besoin de JTA, alors les usines de connexion offertes devront être des implémentations XAConnectionFactory. Ce mode n'est uniquement disponible que pour les messages persistants. Il s'agit certainement du mode le plus lent car il implique une journalisation (logging) sur le gestionnaire de transactions et côté ressource pour le recouvrement. Si vous souhaitez ce niveau de Qos, veillez à activer le recouvrement XA avec JBoss Transactions.
ja_jp: この QoS モードでは、メッセージがソースから送り先に確実に１回限り届くように します（時として、このモードは「１回限り」 "exactly once"として知られます）。送り先と ソースの両方が同じ JBoss Messaging サーバーインスタンス上にある場合、 これは、同じローカルトランザクション内でメッセージの送信と承認をすることで 達成できます。ソースと送り先が異なるサーバー上にある場合、これは JTA トランザクション 内で送信と 消費のセッションを処理することにより達成できます。JTA トランザクション は JBoss Transactions JTA 実装で制御されており、完全な復元トランザクションである為に 非常に高度な継続力を提供します。JTA が必要な場合は、供給された両方の接続ファクトリーは XAConnectionFactory 実装でなければなりません。このモードは永続化メッセージ用のみに 利用可能です。これは復元の為にトランザクションマネージャとリソース側の両方でログを する必要があるため、最も遅いモードとなります。このレベルの QoS を必要とする場合は、 JBoss Transactions で XA 復元を有効にすることを確認して下さい。
pt_br: Estas mensagens de modo QoS alcançarão a destinação a partir do recurso apenas uma vez. (Às vezes este modo é conhecido como "exatamente uma vez"). Caso ambos recurso e destinação estiverem na mesma instância de servidor do JBoss Messaging, então isto poderá ser atingida enviando e reconhecendo as mensagens no mesmo local de transação. Caso o recurso e a destinação estiverem em servidores diferentes, isto será atingida inscrevendo as sessões de consumo de envio na transação JTA. A transação JTA é controlada pela implementação JTA de Transações JBoss que é um completo gerenciador de transação de recuperação, fornecendo, desta maneira, um alto grau de durabilidade. Caso a JTA seja requerida então ambas fábricas de conexão fornecidas precisam ser implementações XAConnectionFactory. Este modo é apenas disponível para mensagens persistentes. É bem provável que este seja o modo mais lento, uma vez que isto requer log em ambos os lados de recurso e gerenciamento de transação para a recuperação. Caso você solicite este nível de QoS, certifique-se de ativar a recuperação XA com as Transações JBoss.
zh_cn: 这种 QoS 模式确保消息将只到达目的地一次（有时候这种模式被称为"exactly once"）。如果源和目的地都在同一个 JBoss Messaging 服务器实例上，那么这可以通过在同一个本地事务内发送和确认消息来实现。如果源和目的地在不同的服务器上，这可以通过在 JTA 事务里支持发送和消费会话来实现。JTA 事务由 JBoss Transactions JTA 实现所控制，它是一个可完全恢复的事务管理者（Transaction Manager），因此提供了级别非常高的持久性。如果 JTA 时必需的，那么这两个连接工厂都需要是 XAConnectionFactory 的实现。这种模式仅适用于持久性消息。它可能是最慢的模式，因为它要求登录事务管理者和用于恢复的资源。如果你需要这种级别的 QoS，请确保启用 JBoss Transactions 的 XA 恢复功能。

source: For a specific application it may possible to provide once and only once semantics without using the QOS_ONCE_AND_ONLY_ONCE QoS level. This can be done by using the QOS_DUPLICATES_OK mode and then checking for duplicates at the destination and discarding them. This may be possible to implement on the application level by maintaining a cache of received message ids on disk and comparing received messages to them. The cache would only be valid for a certain period of time so this approach is not as watertight as using QOS_ONCE_AND_ONLY_ONCE but may be a good choice depending on your specific application.
de_de: Für eine spezifische Anwendung kann es möglich sein, Semantik einmal (nur einmal) bereitzustellen, ohne die QOS_ONCE_AND_ONLY_ONCE QoS-Ebene zu verwenden. Dies kann durch Verwendung des QOS_DUPLICATES_OK Modus und darauffolgender Prüfung auf Duplikate an der Destination und deren Entsorgung erfolgen. Es kann möglich sein, dies auf Anwendungsebene zu implementiene indem ein Cache empfangener Nachrichten-IDs aufbewahrt wird, mit dem empfangene Nachrichten verglichen werden. Das Cache wäre nur für einen bestimmten Zeitraum gültig, daher ist diese Vorgehensweise vielleicht nicht ganz so wasserfest wie die Verwendung von QOS_ONCE_AND_ONLY_ONCE, kann aber je nach Anwendung, eine im Einzelfall gute Wahl sein.
es_es: Para una aplicación en especifico puede ser posible el brindar semántica sólo una vez sin utilizar el nivel QOS_ONCE_AND_ONLY_ONCE QoS. Esto se puede lograr utilizando el modo QOS_DUPLICATES_OK y luego verificando si hay duplicados en el destino y descartándolos. Esto se puede implementar a nivel de la aplicación manteniendo un caché de ids de mensajes recibidos en el disco y comparando los mensajes recibidos con estos. El caché sólo será válido por un periodo de tiempo así que este enfoque no es tan hermético que el utilizar QOS_ONCE_AND_ONLY_ONCE pero puede ser una buena opción dependiendo de su aplicación especifica.
fr_fr: Pour une application particulière, il est possible de proposer une et une seule sémantique sans utiliser les niveaux QOS_ONCE_AND_ONLY_ONCE QoS. Cela peut être fait sur le mode QOS_DUPLICATES_OK , puis en vérifiant les duplicata au niveau de la destination et en les écartant. C'est possible de l'implémenter au niveau application en entretenant un cache des ids de messages reçus sur disque et en les comparant aux messages reçus. Le cache ne serait valide que pour une certaine période, donc cette approche n'est pas aussi étanche que d'utiliser QOS_ONCE_AND_ONLY_ONCE mais pourrait se présenter comme le bon choix, suivant vos applications particulières.
ja_jp: 特定のアプリケーション用には、QOS_ONCE_AND_ONLY_ONCE QoS レベルを使用しないで 「一度限り」の動作を提供することが可能です。これは、QOS_DUPLICATES_OK モードを 使用して、それから送り先で重複メッセージをチェックしてそれを処分することで達成できます。 これは、受信したメッセージの ID のキャッシュを維持してそれと受信したメッセージを比較する ことによりアプリケーションレベルで実装が可能になります。キャッシュは単に一定期間だけ 有効であるため、このアプローチは QOS_ONCE_AND_ONLY_ONCE の使用ほど完璧ではありません。 しかし、ご使用のアプリケーションによっては良い選択かも知れません。
pt_br: Para um aplicativo específico, poderá ser possível fornecer apenas uma vez semânticas sem usar o nível QOS_ONCE_AND_ONLY_ONCE QoS. Isto pode ser realizado usando o modo QOS_DUPLICATES_OK e então checando por duplicatas na destinação e descartando-as. Pode ser que seja possível implementar um nível de aplicativo apenas mantendo um cache de ids de mensagem recebidas no disco, além de comparar as mensagens recebidas a elas. O cache poderia ser válido apenas por um certo período, de forma que esta abordagem não seria tão sólida como se utilizando o QOS_ONCE_AND_ONLY_ONCE. No entanto, isto pode ser uma boa escolha dependendo do seu aplicativo específico.
zh_cn: 对于特殊的应用程序，我们可能提供 once and only once 模式而无需使用 QOS_ONCE_AND_ONLY_ONCE QoS 级别。这可以通过使用 QOS_DUPLICATES_OK 模式并在目的地检查重复消息来实现。我们也可以在应用程序级别来实现：在磁盘上保留一个接收到的消息的 ID 的缓存并比较收到的消息。因为这个缓存将只在某段时间内有效，所以这个方法并不象 QOS_ONCE_AND_ONLY_ONCE 模式一样无懈可击，但也不失为一个好的选择，这取决于特殊应用程序的需要。

source: Bridge deployment
es_es: Despliegue del puente
fr_fr: Déploiement du pont
ja_jp: ブリッジのデプロイメント
pt_br: Implementação de Interligação
zh_cn: 部署消息桥

source: A message bridge is easily deployed by dropping the MBean descriptor in the deploy directory of your JBoss AS installation which contains JBoss Messaging
de_de: Eine Message Bridge kann durch Ablegen des MBean-Deskriptors im Deploy-Verzeichnis Ihrer JBoss AS Installation, die JBoss Messaging enthält, ganz einfach deployt werden
es_es: Un puente de mensajes se despliega fácilmente poniendo el descriptor MBean en el directorio de despliegue de su instalación JBoss AS, el cual contiene JBoss Messaging
fr_fr: A pont de messages est facilement déployé en déposant le descripteur MBean dans le répertoire de déploiement de votre installation JBoss AS qui contient JBoss Messaging
ja_jp: メッセージブリッジは、JBoss Messaging を含んでいる JBoss AS インストールの デプロイディレクトリ（deploy directory）内に MBean 記述子を入れることにより簡単に デプロイできます。
pt_br: A interligação de mensagem é facilmente implementada apenas abrindo o descritor MBean no diretório de implementação de sua instalação JBoss AS, da qual contém o JBoss Messaging.
zh_cn: 只要把相关的 MBean 描述符放入包含 JBoss Messaging 的 JBoss AS 的 deploy 目录下，你就可以轻易地部署消息桥了。

source: Bridge configuration
de_de: Bridge Konfiguration
es_es: Configuración del puente
fr_fr: Configuration de pont
ja_jp: ブリッジの設定
pt_br: Configuração de Interligação
zh_cn: 消息桥的配置

source: In this section we describe how to configure the message bridge
de_de: In diesem Abschnitt erläutern wir die Konfiguration der Message Bridge
es_es: En esta sección vamos a describir la manera de configurar el puente de mensajes
fr_fr: Dans cette section, nous décrivons comment configurer le pont de messagerie
ja_jp: このセクションでは、メッセージブリッジの設定法を説明しています。
pt_br: Nesta seção descreveremos como configurar a interligação de mensagem.
zh_cn: 本节我们将描述如何配置消息桥

source: Here is an example of a message bridge configuration, with all the attributes shown. Note that some are commented out for this configuration, since it is not appropriate to specify them all at once. Which ones are specified depends on the configuration you want.
de_de: Hier ist ein Beispiel für die Konfiguration einer Message Bridge einschließlich aller Attribute. Bitte beachten Sie, dass einige für diese Konfiguration auskommentiert wurden, da es unpassend ist, diese alle auf einmal festzulegen. Welche festgelegt werden hängt von der Konfiguration ab, die Sie wünschen.
es_es: Este es un ejemplo de la configuración del puente de mensajes con todos los atributos. Observe que a algunos se les quitó el comentario para esta configuración ya que no es propiado especificarlos todos al mismo tiempo. Los que debe especificar depende de la configuración que quiera.
fr_fr: Voici un exemple de configuration de pont de messagerie, avec tous ses attributs. Noter que certains sont commentés dans le cadre de cette configuration, dans la mesure où il n'est pas nécessaire de tous les préciser à la fois. Les attributs spécifiés dépendent de la configuration que vous souhaitez.
ja_jp: ここに全ての属性を付けたメッセージブリッジの設定の例を示します。 全てを一度に指定するのは適切でないため、この設定の一部はコメントアウト してあることに注意して下さい。指定するものはユーザーが希望する設定により 左右されます。
pt_br: Segue abaixo um exemplo de uma configuração de interligação de mensagem com todos atributos apresentados. Perceba que alguns possuem comentários para esta configuração, uma vez que não é apropriado especificá-los tudo de uma vez. Os atributos que serão especificados dependerão apenas da configuração em que você desejar.
zh_cn: 下面是一个消息桥配置的例子，它展示了所有的属性。请注意，由于有些配置不适合全部一次被指定，所以它们被注释掉了。这要根据你的需要来取舍。

source: We will now discuss each attribute
de_de: Wir erläutern nun jedes Attribut
es_es: Vamos a discutir cada atributo
fr_fr: Nous allons maintenant discuter chaque attribut
ja_jp: ここでそれぞれの属性を説明していきます。
pt_br: Iremos descrever agora cada atributo.
zh_cn: 现在我们逐个来讨论这些属性

source: This is the object name of the JMSProviderLoader MBean that the bridge will use to lookup the source connection factory and source destination.
de_de: Dies ist der Objektname des JMSProviderLoader MBean das die Bridge für den Lookup der Quell-Connection-Factory und Quell-Destination verwendet.
es_es: Este es el nombre de objeto del MBean JMSProviderLoader que el puente utilizará para buscar la fábrica de conexiones y el destino fuente.
fr_fr: C'est le nom d'objet du MBean de JMSProviderLoader qui sera utilisé par le pont pour vérifier l'usine de connexion-source et la destination-source.
ja_jp: これは、JMSProviderLoader MBean のオブジェクト名であり、ブリッジが ソース接続ファクトリとソース送り先をルックアップするために使用するものです。
pt_br: Este é o nome do objeto do JMSProviderLoader MBean, que a interligação usará para observar a fábrica de conexão de recurso e destinação de recurso.
zh_cn: 这是 JMSProviderLoader MBean 的对象名，消息桥将用它来查找源连接工厂和源目的地。

source: By default JBoss AS ships with one JMSProviderLoader, deployed in the file <filename>jms-ds.xml</filename> - this is the default local JMSProviderLoader. (This would be in <filename>hajndi-jms-ds.xml</filename> in a clustered configuration)
de_de: Standardmäßig wird JBoss AS mit einem JMSProviderLoader geliefert, der in der <filename>jms-ds.xml</filename>-Datei deployt wird - dies ist der standardmäßige lokale JMSProviderLoader. (In einer geclusterten Konfiguration wäre dies in <filename>hajndi-jms-ds.xml</filename>)
es_es: Por defecto JBoss AS se envía junto con un JMSProviderLoader, desplegado en el archivo <filename>jms-ds.xml</filename> - este es el local predeterminado JMSProviderLoader, (esto sería en <filename>hajndi-jms-ds.xml</filename> en una configuración con clústers).
fr_fr: Par défaut, JBoss AS est présenté avec un JMSProviderLoader, déployé dans le fichier <filename>jms-ds.xml</filename> - le JMSProviderLoader local par défaut. (Il se trouverait dans le <filename>hajndi-jms-ds.xml</filename> dans une configuration groupée)
ja_jp: デフォルトでは、JBoss AS は <filename>jms-ds.xml</filename>ファイル 内で デプロイされている１つの JMSProviderLoader と共に配布されています。これが デフォルトのローカル JMSProviderLoader です。（これはクラスター化した設定では <filename>hajndi-jms-ds.xml</filename> となります。）
pt_br: Por padrão, o JBoss AS efetua o lançamento com um JMSProviderLoader, implementado no arquivo <filename>jms-ds.xml</filename> - este é o padrão local JMSProviderLoader. (Isto estaria num <filename>hajndi-jms-ds.xml</filename> em uma configuração de cluster).
zh_cn: JBoss AS 缺省带有一个 JMSProviderLoader，它部署在 <filename>jms-ds.xml</filename> 文件里 － 这是缺省的本地 JMSProviderLoader（群集配置里的对应文件是 <filename>hajndi-jms-ds.xml</filename>）。

source: If your source destination is on different servers or even correspond to a different, non JBoss JMS provider, then you can deploy another JMSProviderLoader MBean instance which references the remote JMS provider, and reference that from this attribute. The bridge would then use that remote JMS provider to contact the source destination
de_de: Befindet sich Ihre Quell-Destination auf unterschiedlichen Servern oder korrespondiert mit einem anderen, nicht- JBoss JMS Provider, so können Sie eine wetere JMSProviderLoader MBean Instanz deployen, die den Remote JMS Provider referenziert und die von diesem Attribut referenzieren. Die Bridge würde dann den Remote JMS Provider verwenden, um die Quell-Destination zu kontaktieren.
es_es: Si su destino fuente se encuentra en servidores diferentes o incluso corresponde a un proveedor diferente que no es JBoss JMS entonces puede desplegar otra instancia MBean JMSProviderLoader, la cual referencia el proveedor remoto JMS y referencia eso desde este atributo. Entonces el puente utilizaría ese proveedor remoto JMS para contactar el destino fuente.
fr_fr: Si votre destinsation-source est sur différents serveurs ou bien correspond à un prestataire différent non JBoss JMS, alors vous pourrez déployer une autre instance du MBean JMSProviderLoader, qui référence le prestataire distant JMS, et qui le référence à partir de cet attribut. Le pont utiliserait alors ce prestataire JMS distant pour contacter la destination-source.
ja_jp: ソース送り先 が異なるサーバー上にある場合、又は異なる非 JBoss JMS プロバイダーに対応する場合、リモートの JMS プロバイダーを参照する別の JMSProviderLoader MBean インスタンスをデプロイして、 この属性からそれを参照するようにできます。ブリッジはその後、そのリモート JMS プロバイダーを使用して ソース送り先へ連絡します。
pt_br: Caso a destinação de recurso estiver em servidores diferentes ou mesmo corresponder a um diferente, que não seja um provedor JBoss JMS, então você poderá implementar outra instância que referencia o provedor JMS remoto e referencia a partir do atributo. A interligação usaria então aquele provedor JMS remoto para contatar a destinação de recurso.
zh_cn: 如果源目的地位于不同的服务器上或者甚至对应非 JBoss JMS 提供者，那你可以部署引用远程 JMS 提供者的其他 JMSProviderLoader MBean 实例并用属性引用它。然后消息桥将使用那个远程 JMS 提供者来联系源目的地。

source: Note that if you are using a remote non JBoss Messaging source or target and you wish once and only once delivery then that remote JMS provider must provide a fully functional JMS XA resource implementation that works remotely from the server - it is known that some non JBoss JMS providers do not provide such a resource
de_de: Bitte beachten Sie, dass - falls Sie eine Remote nicht-JBoss Messaging Quelle oder Ziel verwenden und ausschließlich einmalige Auslieferung (Delivery) wünschen - der Remote JMS-Provider eine vollständig funktionale JMS XA Ressourcen-Implementierung bereitstellen muss, die Remote vom Server aus funktioniert - es ist bekannt, dass einige nicht-JBoss JMS Provider eine solche Ressource nicht bereitstellen
es_es: Observe que si está utilizando una fuente o un destino remoto que no es JBoss Messaging y quiere enviar sólo una vez entonces ese proveedor JMS remoto debe proporcionar una implementación de recurso JMS XA completamente funcional que funcione remotamente desde el servidor - se sabe que algunos proveedores que no son JBoss JMS no proporcionan tal recurso.
fr_fr: Noter que si vous utilisez une source ou une cible distante non JBoss Messaging et que vous souhaitez une et une seule livraison, alors le prestataire distant JMS devra offrir une implémentation de ressources JMS XA totalement fonctionnelle qui opère à distance du serveur - certains prestataires JBoss JMS n'offrent pas cette ressource
ja_jp: リモートの非 JBoss Messaging ソースあるいはターゲットを使用していて、一度限りの配送 （once and only once delivery ）を使用したい場合、リモートの JMS プロバイダーは サーバーからリモートで動作する完全機能の JMS XA リソース実装を提供しなければ ならないことに注意して下さい。一部の非 JBoss JMS プロバイダーはそのようなリソースを 提供しないことが知られています。
pt_br: Perceba que se você estiver usando um recurso que não seja o JBoss Messaging remoto ou de destino, e você desejar realizar a entrega apenas uma vez, então aquele provedor remoto JMS deverá fornecer uma completa implementação de recurso JMS XA funcional, da qual opera remotamente a partir do servidor - sabe-se que alguns provedores diferentes do JBoss Messaging não fornecem tal recurso.
zh_cn: 请注意，如果你正在使用远程的非 JBoss Messaging 源或目标服务器，且你希望 once and only once 模式的递送，那么该远程的 JMS 提供者必须提供可远程运行的具备完整功能的 JMS XA 资源实现 － 有些非 JBoss JMS 提供者并不提供这样的资源。

source: This is the object name of the JMSProviderLoader MBean that the bridge will use to lookup the target connection factory and target destination.
de_de: Dies ist der Objektname des JMSProviderLoader MBean, das die Bridge für den Lookup der Ziel-Connection-Factory und der Zieldestination verwendet.
es_es: Este es el nombre del objeto del MBean JMSProviderLoader que el puente utilizará para buscar la fábrica de conexiones destino y el destino objetivo.
fr_fr: C'est le nom de l'objet du MBean du JMSPRoviderLoader que le pont va utiliser pour cibler l'usine de connexion et la destination-cible.
ja_jp: ブリッジがターゲット接続ファクトリとターゲット送り先 をルックアップするのに 使用する JMSProviderLoader MBean のオブジェクト名です。
pt_br: Este é o nome do objeto do JMSProviderLoader MBean que a interligação usará para observar a fábrica de conexão de destino e ponto de destinação.
zh_cn: 这是 JMSProviderLoader MBean 的对象名，消息桥将用它来查找目标连接工厂和目标目的地。
