Repository: bobmcwhirter/jboss-messaging
Catalog: docs/EAP_4_3/JBoss_Messaging_User_Guide/*/Bridge.po
Languages: de_de, es_es, fr_fr, ja_jp, pt_br, zh_cn

source: JBoss Messaging Message Bridge Configuration
de_de: JBoss Messaging Message Bridge Konfiguration
es_es: Configuración del puente de mensajes de JBoss Messaging
fr_fr: Configuration de JBoss Messaging Bridge
ja_jp: JBoss Messaging メッセージブリッジの設定
pt_br: Configuração de Interligação de Mensagem do JBoss Messaging
zh_cn: JBoss Messaging 消息桥的配置

source: Message bridge overview
de_de: Message Bridge Übersicht
es_es: Sinopsis del puente de mensajes
fr_fr: Aperçu de Message Bridge
ja_jp: メッセージブリッジの概要
pt_br: Visão Geral de Interligação de Mensagem
zh_cn: 消息桥概述

source: JBoss Messaging includes a fully functional message bridge.
de_de: JBoss Messaging beinhaltet eine vollständig funktionale Message Bridge.
es_es: JBoss Messaging incluye un puente de mensajes completamente funcional
fr_fr: JBoss Messaging comprend un pont de messagerie complètement fonctionnel.
ja_jp: JBoss Messaging には完全に機能するメッセージブリッジが収納されています。
pt_br: O JBoss Messaging inclui uma completa interligação de mensagem funcional.
zh_cn: JBoss Messaging 包含一个功能完整的消息桥。

source: The function of the bridge is to consume messages from a source queue or topic, and send them to a target queue or topic, typically on a different server.
de_de: Die Funktion der Bridge ist es, Nachrichten von einer Quell-Warteschlange oder einem Topic zu entnehmen und diese na eine Ziel-Warteschlange oder ein Topic - in der Regel auf einem anderen Server - zu schicken.
es_es: La función del puente es el consumir mensajes desde un tema o cola fuente y enviarlos al tema o a la cola destinos usualmente en un servidor diferente.
fr_fr: La fonction de ce pont est de consommer des messages d'une file d'attente source ou sujet, et de les envoyer vers une file d'attente cible ou vers un sujet cible, normalement vers un serveur différent.
ja_jp: ブリッジの役割はソースの キュー やトピックからのメッセージを消費 し、通常、異なるサーバー上のターゲットにある キュー や トピック にそれを送信することです。
pt_br: A função da interligação é consumir mensagens a partir de um tópico ou fila de recurso, além de enviá-los para um tópico ou fila de destino, normalmente em um servidor diferente.
zh_cn: 消息桥的功能是从源队列或主题里提取消息，然后发送到通常在另外一个服务器上的目标队列或主题。

source: The source and target servers do not have to be in the same cluster which makes bridging suitable for reliably sending messages from one cluster to another, for instance across a WAN, and where the connection may be unreliable.
de_de: Die Quell- und Ziel-Server müssen sich nicht im selben Cluster befinden, was "Bridging" geeignet für das Senden von Nachrichten von einem Cluster an einen anderen macht, etwa über ein WAN hinweg und auch im Falle einer unzuverlässigen Verbindung.
es_es: Los servidores fuente y de destino no se tienen que encontrar en el mismo clúster, lo cual hace que el realizar el puente sea apropiado para enviar mensajes de manera confiable desde un clúster al otro, por ejemplo a través de un WAN y en donde la conexión sea poco confiable.
fr_fr: Les serveurs source ou cible n'ont pas besoin d'être dans le même groupement, ce qui rend le pontage convenable pour envoyer des messages d'un groupement à un autre en toute sécurité, comme par exemple à travers un WAN, où la connexion n'est pas toujours fiable.
ja_jp: ソースとターゲットのサーバーは、同じクラスター内に存在する必要はありません。 例えば、WAN 経由の接続が不確実な状態では、１つのクラスターから別のクラスターに 確実にメッセージを送信するのにブリッジが適切なものとなります。
pt_br: Os servidores de recurso e destino não precisam estar no mesmo cluster que faz a interligação possível para segurança de envio de mensagens, de um cluster a outro. Por exemplo: através de um WAN e onde a conexão possa ser não confiável.
zh_cn: 源和目标服务器不需要位于同一个群集里，消息桥适合于把消息可靠地从一个群集发送到另外一个群集，例如跨越网络连接可能不稳定的广域网。

source: A bridge is deployed inside a JBoss AS instance. The instance can be the same instance as either the source or target server. Or could be on a third, separate JBoss AS instance.
de_de: Eine Bridge wird innerhalb einer JBoss AS Instanz deployt. Die Instanz kann dieselbe Instanz sein, ob als Quell- oder Ziel-Server. Oder aber sie könnte auf einer dritten, separaten JBoss AS Instanz sein.
es_es: Un puente se despliega dentro de una instancia de JBoss AS. La instancia puede ser la misma instancia que el servidor fuente o el servidor destino; o se puede encontrar en una tercera instancia de JBoss AS.
fr_fr: Un pont est déployé dans une instance JBoss AS. L'instance peut être la même instance que celle du serveur source ou celle du serveur cible, ou encore une troisième instance JBoss AS séparée.
ja_jp: ブリッジは JBoss AS インスタンスの内部でデプロイされます。インスタンスはソースか、 ターゲットのサーバーのいずれかと同じインスタンスであるかもしれません。あるいは、 第三の別の JBoss AS インスタンスであるかもしれません。
pt_br: A interligação é implantada dentro de uma instância JBoss AS. A instância pode ser a mesma instância que ambos servidores de destino e de recurso. Adicionado a isto, pode ser ainda uma terceira, separada da instância JBoss AS.
zh_cn: 消息桥部署在 JBoss AS 实例里。这个实例可以是源或目标服务器里的实例，也可以是第三个独立的 JBoss AS 实例。

source: A bridge is deployed as an MBean inside JBoss AS. Deployment is trivial - just drop the MBean descriptor into the deploy directory of a JBoss configuration which contains JBoss Messaging.
de_de: Eine Bridge wird als ein MBean innnerhalb des JBoss AS deployt. Das Deployment ist trivial - legen Sie einfach den MBean-Deskriptor in das Deploy-Verzeichnis einer JBoss Messaging enthaltenden JBoss Konfiguration ab.
es_es: Un puente se despliega como un MBean dentro de JBoss AS. El despliegue es trivial - simplemente ponga el descriptor MBean en el directorio de despliegue de una configuración de JBoss que contenga JBoss Messaging.
fr_fr: Un pont est déployé en tant que MBean à l'intérieur de JBoss AS. Le déploiement est trivial - déposer un descripteur MBean dans le répertoire de configuration de JBoss, qui contient JBoss Messaging.
ja_jp: ブリッジは JBoss AS の内部で MBean としてデプロイされます。デプロイメントは簡単です。 JBoss Messaging を含んでいる JBoss 設定のデプロイディレクトリに MBean 記述子を 入れるだけです。
pt_br: A interligação é implantada como um MBean dentro do JBoss AS. A implementação é trivial - apenas solta o descritor MBean dentro do diretório de implementação de uma configuração JBoss que contém o JBoss Messaging.
zh_cn: 消息桥作为 MBean 部署在 JBoss AS 实例里。部署很简单 － 只要把 MBean 部署描述符放入包含 JBoss Messaging 的 JBoss 配置的 deploy 目录下就可以了。

source: An example in docs/example/bridge demonstrates a simple bridge being deployed in JBoss AS, and moving messages from the source to the target destination
de_de: Ein Beispiel in docs/example/bridge demonstriert eine einfache Bridge, die im JBoss AS deployt wird und Nachrichten von der Quell- zur Ziel-Destination verschiebt.
es_es: Un ejemplo en docs/example/bridge demuestra el despliegue de un puente simple en JBoss AS y el movimiento de mensajes del destino fuente al destino
fr_fr: Un des exemples de docs/example/bridge montre un simple pont qui a été déployé dans JBoss AS, et qui déplace des messages de la source vers la destination cible.
ja_jp: docs/example/bridge にあるサンプルでは、簡単なブリッジが JBoss AS 内でデプロイされて、 メッセージをソースからターゲット 送り先に移動しているところを示しています。
pt_br: Um exemplo em docs/example/bridge demonstra uma implementação simples sendo implementada como JBoss AS e a movimentação de mensagens, a partir do recurso ao ponto de destinação.
zh_cn: docs/example/bridge 里的例子演示了部署在 JBoss AS 里的一个简单的消息桥，它把消息从源服务器一移动到目标目的地里。

source: The bridge can also be used to bridge messages from other non JBoss Messaging JMS servers, as long as they are JMS 1.1 compliant.
de_de: Die Bridge kann auch zur Überbrückung von Nachrichten von anderen nicht JBoss Messaging JMS Servern verwendet werden, so lange diese JMS 1.1 konform sind.
es_es: El puente también se puede utilizar para realizar puentes de mensajes desde servidores que no son JBoss Messaging JMS en tanto cumplan con los requeriminetos de JMS 1.1.
fr_fr: Le pont peut aussi être utilisé pour ponter des messages d'autres serveurs JBoss Messaging JMS, dans la mesure où ils sont compatibles JMS 1.1.
ja_jp: ブリッジはまた、他の非 JBoss Messaging JMS サーバーからのメッセージも それらが JMS 1.1 準拠である場合は、ブリッジします。
pt_br: A interligação pode também ser usada para mensagens de interligação a partir de não-servidores JMS do JBoss Messaging, contanto que elas sejam compatíveis ao JMS 1.1.
zh_cn: 消息桥也可以用转移非 JBoss Messaging JMS 服务器的消息，只要这个服务器兼容 JMS 1.1。

source: The bridge has built in resilience to failure so if the source or target server connetion is lost, e.g. due to network failure, the bridge will retry connecting to the source and/or target until they come back online. When it comes back online it will resume operation as normal.
de_de: Die Bridge verfügt über eingebaute Ausfallsicherheit, d.h. falls die Verbindung des Quell- oder Ziel-Servers verloren wird, z.B. durch eine Fehlfunktion des Netzwerks, wird die Bridge versuchen eine Verbindung zum Quell- und/oder Ziel wieder herzustellen bis diese wieder online kommen. Ist dies der Fall wird der Betrieb regulär fortgesetzt.
es_es: El puente tiene una capacidad de recuperación de fallos incorporada así que si la conexión al servidor fuente o al de destino se pierde, por ejemplo, debido a fallas en la red, el puente volverá a intentar conectarse a la fuente o al destino hasta que se reestablezca la red. Cuando se vuelve a conectar reiniciará su operación de manera normal.
fr_fr: Le pont a une résistance interne aux situations de mise en échec, donc si la connexion au serveur source ou cible est perdue, suite à une déficience réseau par exemple, le pont tentera de rétablir la connexion vers la source et/ou la cible jusqu'à ce que la ligne soir rétablie. Lorsque les serveurs cible ou source sont rétablis, les opérations reprennent normalement.
ja_jp: ネットワーク障害などで、もし、ソースかターゲットサーバをロストした場合、ブリッジは障害からの 回復力を確立します。 ブリッジはそれらがオンラインに復帰するまでソースやターゲットへの 接続を試みます。オンラインで復帰した時には通常通りに作業を継続します。
pt_br: A interligação é construída ressaltando o failover, de forma que se o recurso ou conexão do servidor de destino forem perdidos, por exemplo: devido o failover da rede, a interligação tentará efetuar a conexão novamente para o recurso e/ou destino, até que eles retornarem online. Quando isto retornar online, isto resumirá a operação normalmente.
zh_cn: 消息桥具有处理故障的能力，如果源或目标服务器连接丢失了（例如网络故障），消息桥将试图恢复连接，直到双方都在线为止。当连接恢复后，消息桥将继续正常的操作。

source: The bridge can be configured with an optional JMS selector, so it will only consume messages matching that JMS selector
de_de: Die Bridge kann mit einem optionalen JMS-Selektor konfiguriert werden und würde in diesem Fall nur Nachrichten verwenden, die mit diesem JMS-Selektor übereinstimmen
es_es: El puente se puede configurar con un selector JMS opcional de manera que sólo consumirá mensajes que coincidan con ese selector JMS
fr_fr: Le pont peut être configuré avec un sélecteur optionnel JMS, donc il ne consomme que des messages qui correspondent au sélecteur JMS.
ja_jp: ブリッジはオプションの JMS セレクターで設定できます。そのため、JMS セレクターに 一致するメッセージのみを consume します。
pt_br: A interligação pode ser configurada com um seletor JMS opcional de forma que ela apenas consumirá mensagens correspondentes ao seletor JMS.
zh_cn: 消息桥可以用可选的 JMS Selector 进行配置，所以它只提取符合该 JMS selector 的消息。

source: It can be configured to consume from a queue or a topic. When it consumes from a topic it can be configured to consume using a non durable or durable subscription
de_de: Dies kann so konfiguriert werden, das aus einer Warteschlange oder einem Topic gespeist wird. Wird aus einem Topic gespeist, so kann derart konfiguriert werden, das ein dauerhaftes oder nicht dauerhaftes Abonnement verwendet wird.
es_es: Se puede configurar para que consuma de una cola o tema. Cuando consume de un tema se puede configurar para que consuma utilizando una subscripción durable o no durable.
fr_fr: Il peut être configuré pour consommer à partir d'une file d'attente ou d'un sujet. Lorsqu'il consomme à partir d'un sujet, il peut être configuré pour consommer en utilisant un abonnement durable ou un abonnement non durable
ja_jp: ブリッジはキュー 又は、トピック から消費するように設定できます。トピック から 消費 する場合は、ブリッジは継続、又は非継続のサブスクリプションを使用して消費するように 設定ができます。
pt_br: Isto pode ser configurado para consumo a partir de uma fila ou tópico. Quando isto consumir a partir de um tópico, ela pode ser configurada para consumir usando subscrição durável ou não-durável.
zh_cn: 它可以配置成从队列或主题里提取消息。当它从主题里提取消息时，你还可以配置它使用非持久的或持久的订阅。

source: The bridge can be configured to bridge messages with one of three levels of quality of service, they are:
de_de: Die Bridge kann so konfiguriert werden, dass Sie Nachrichten mit einer von drei Qualitätsebenen von Service überbrückt. Diese sind:
es_es: El puente se puede configurar para que realice puentes de mensajes con uno de tres niveles de calidad de servicio, estos son:
fr_fr: Le pont peut être configuré pour effectuer le pontage de messages sur un des trois niveaux de service de qualité, notamment:
ja_jp: ブリッジはサービスの品質に於いて３つのレベルの１つでメッセージをブリッジするように 設定できます。それらのレベルは以下のようになります:
pt_br: A interligação pode ser configurada para interligar mensagens com um dos três níveis de qualidade de serviço. Estes níveis podem ser encontrados abaixo:
zh_cn: 消息桥可以使用三个级别的服务品质来转发消息，它们是：

source: With this QoS mode messages will reach the destination from the source at most once. The messages are consumed from the source and acknowledged before sending to the destination. Therefore there is a possibility that if failure occurs between removing them from the source and them arriving at the destination they could be lost. Hence delivery will occur at most once. This mode is avilable for both persistent and non persistent messages.
de_de: Mit diesem QoS-Modus erreichen Nachrichten die Destination von der Quelle höchstens einmal. Die NAchrichten werden an der Quelle entnommen und vor dem Senden an die Destination verwendet. Daher existiert die Möglichkeit, dass es zwischen deren Entnahme von der Quelle und deren Ankunft an der Destination zu einer Fehlfunktion kommt und dese verlorengehen. Daher erfolgt die Lieferung höchstens ein Mal. Dieser Modus ist sowohl für persistente als auch nicht-persistente Nachrichten verfügbar.
es_es: Con este modo QoS los mensajes alcanzarán su destino desde la fuente máximo una vez. Los mensajes se consumen desde la fuente y se reconocen antes de enviarlos al destino. Por lo tanto existe la posibilidad de que se pierdan si ocurre una falla desde cuando se remueven de la fuente hasta cuando llegan al destino. Por lo tanto la entrega ocurrirá máximo una vez. Este modo está disponible para mensajes persistentes y no persistentes.
fr_fr: Sur le mode QoS, les messages atteindront leur destination à partir de la source, une fois au plus. Les messages sont consommés au niveau de la source et sont confirmés avant d'être dirigés vers la destination. Il y a donc possibilité qu'en cas d'échec entre leur retrait de la source et leur arrivée à destination, ils pourraient se perdre. Donc la tansmission a lieu à plusieurs reprises. Ce mode est disponible pour les messages persistants et non persistants à la fois.
ja_jp: この QoS モードではメッセージは最大でも１回だけソースから送り先に届きます。 メッセージはソースから消費されて承認されてから送り先に送られます。そのため、ソースから メッセージを取り出す時点とそれが送り先に到着する時点の間に障害が発生すると、メッセージは 紛失する可能性があります。この理由で、配信は最大でも１回だけとなります。このモードは 永続化と非永続化のメッセージの両方で利用できます。
pt_br: Com estas mensagens de modo QoS você poderá alcançar a destinação, a partir do recurso, pelo menos uma vez. As mensagens são consumidas a partir do recurso e reconhecimento, antes do envio para a destinação. Desta forma, existe a possibilidade que se ocorrer o failover, enquanto removendo-as a partir do recurso e a chegada delas à destinação, as mesmas poderão ser perdidas. Por conseguinte, a entrega ocorrerá pelo menos uma vez. Este modo está disponível para ambas mensagens persistentes e não-persistentes.
zh_cn: 使用这种 QoS 模式，消息最多可以从源服务器到达目的地一次。在发送到目的地之前，消息从源服务器里提取并确认。因此，如果在从源服务器提取和到达目的地之间如果发生故障，消息就有可能会丢失。因此，递送最多只能进行一次。这种模式对持久性和非持久性消息都适用。

source: With this QoS mode, the messages are consumed from the source and then acknowledged after they have been successfully sent to the destination. Therefore there is a possibility that if failure occurs after sending to the destination but before acknowledging them, they could be sent again when the system recovers. I.e. the destination might receive duplicates after a failure. This mode is available for both persistent and non persistent messages.
de_de: Mit diesem QoS-Modus werden werden Nachrichten von der Quelle aus verwendet und nach dem erfolgreichen Senden an die Destination bestätigt. Es besteht daher die Möglichkeit, dass bei einer Fehlfunktion nach dem Senden an die Destination diese erneut gesendet werden, wenn das System wieder funktionsfähig ist. Es ist also möglich, dass die Destination nach einer Fehlfunktion Duplikate erhält. Dieser Modus ist sowohl für persistente als auch nicht-persistente Nachrichten möglich.
es_es: Con este modo QoS, los mensajes se consumen desde la fuente y luego se reconocen después de que se han enviado exitosamente a su destino. Por lo tanto existe la posibilidad de que si ocurre una falla después de enviarlos a su destino pero antes de reconocerlos, puede que sean enviados de nuevo cuando el sistema se recupere. Por ejemplo, puede que el destino reciba duplicados después de una falla. Este modo se encuentra disponible tanto para mensajes persistentes como no persistentes.
fr_fr: En mode QoS, les messages sont consommés à partir de la source, puis sont confirmés avant d'être envoyés vers la destination. Il y a donc une possibilité qu'en cas d'échec entre l'envoi et la confirmation des messages, ils pourraient être renvoyés à nouveau quand le système récupère. Par exemple, la destination peut recevoir des duplicata suite à une mise en échec. Ce mode est disponible pour les messages persistants et non persistants à la fois.
ja_jp: この QoS モードでは、メッセージはソースから消費されてそれから、それが正しく 送り先に配信された後に送信の承認がなされます。その為、メッセージを送り先 に 送った後で、それを承認する前に障害が発生した場合、システムが復帰した時に メッセージが再送される可能性があります。これでは送り先が障害の後に重複の メッセージを受信することになります。このモードは永続化と非永続化のメッセージの 両方で使用できます。
pt_br: Com este modo QoS, as mensagens são consumidas a partir do recurso, e então reconhecimento após elas tendo sido enviadas à destinação. Portanto, existe a possibilidade que se um failover ocorrer após o envio à destinação, porém antes de reconhecê-las, elas poderão ser enviadas novamente quando ocorrer a recuperação do sistema. Por exemplo: a destinação poderá receber duplicatas após a falha. Este modo está disponível para ambas mensagens persistentes e não-persistentes.
zh_cn: 使用这种 QoS 模式，消息从源服务器提取并在成功送达目的地后确认收到。因此，如果故障发生在消息发送到目的地之后、而在确认收到之前，系统恢复后消息可能会被再发送一次。也就是说，在发生故障时，目的地可能收到重复的消息。持久性和非持久性消息都可以使用这种模式。
