Repository: bobmcwhirter/jboss-messaging
Catalog: docs/EAP_4_3/JBoss_Messaging_User_Guide/*/C_Configuration.po
Languages: de_de, es_es, fr_fr, ja_jp, pt_br, zh_cn

source: If you wish to apply strict JMS ordering to messages, such that a particular JMS consumer consumes messages in the same order as they were produced by a particular producer, you can set the DefaultPreserveOrdering attribute in the server peer to true. By default this is false. The sideeffect of setting this to true is that messages cannot be distributed as freely around the cluster
es_es: Si desea aplicar un ordenamiento estricto JMS a los mensajes tal como que un consumidor JMS en particular consuma mensajes en el mismo orden en que fueron producidos por un productor en particular, puede configurar el atributo DefaultPreserveOrdering en el servidor compañero como verdadero. Por defecto esto es falso. El efecto secundario de configurar esto como verdadero es que los mensajes no se pueden distribuir tan libremente alrededor del clúster.
fr_fr: Si vous souhaitez appliquer un ordonnancement strict des messages, de façon à ce qu'un consommateur JMS particulier consomme des messages dans le même ordre qu'ils ont été produits par un émetteur particulier, vous pouvez configurer l'attribut du serveur parent à 'true'. Cet attribut est configuré à 'faux' par défaut. L'effet secondaire de changer la configuration à 'true' est que les messages ne peuvent pas être distribués aussi librement à travers le groupement.
ja_jp: メッセージに対して厳密な JMS 順序を適用して、特定のプロデューサがメッセージを生産する時に 特定の JMS コンシューマ が同じ順序でメッセージを消費するようにしたい場合、 サーバーピア内の DefaultPreserveOrdering 属性を「true」にセットしてください。 デフォルトではこれは、「false」になっています。これを「true」にセットすることの 副作用は、メッセージがクラスター内で「false」場合ほど自由に分散できないことです。
pt_br: Caso você queira aplicar pedidos JMS restritos às mensagens, tal como um consumidor JMS específico consome mensagens na mesma ordem em que elas eram produzidas por um produtor em particular, você poderá configurar o atributo DefaultPreserveOrdering no servidor peer para verdadeiro. Por padrão, isto é falso. O resultado de se configurar isto para verdadeiro é que mensagens não poderão ser distribuídas livremente em volta do cluster.
zh_cn: 如果你想对消息应用严格的 JMS 顺序，亦即特定的 JMS 消费者（consumer）将按照和生产者（producer）产生消息的顺序来消费消息，你可以设置 server peer 里的 DefaultPreserveOrdering 属性为 true。它的缺省值是 false。设置它为 true 的副作用是消息不能自由地在群集里进行分发。

source: Idempotent operations
de_de: Idempotente Operationen
es_es: Operaciones Idempotent
fr_fr: Opérations idempotentes
ja_jp: Idempotent （冪等）オペレーション
pt_br: Operações Idempotentes
zh_cn: Idempotent 操作

source: If the call to send a persistent message to a persistent destination returns successfully with no exception, then you can be sure that the message was persisted. However if the call doesn't return successfully e.g. if an exception is thrown, then you *can't be sure the message wasn't persisted*. Since the failure might have occurred after persisting the message but before writing the response to the caller. This is a common attribute of any RPC type call: You can't tell by the call not returning that the call didn't actually succeed. Whether it's a web services call, an HTTP get request, an ejb invocation the same applies. The trick is to code your application so your operations are *idempotent* i.e. they can be repeated without getting the system into an inconsistent state. With a message system you can do this on the application level, by checking for duplicate messages, and discarding them if they arrive. Duplicate checking is a very powerful technique that can remove the need for XA transactions in many cases.
de_de: Falls der Aufruf für das Senden einer persistenten Nachricht an eine persistente Destination erfolgreich und ohne Ausnahme wiedergegeben wird, so können Sie sicher sein, dass die Nachricht persisitiert wurde. Wird der Aufruf jedoch nicht erfolgreich wiedergegeben, wurde z.B. eine Ausnahme gemeldet, dann *können Sie nicht sicher sein, dass die Nachricht nicht persistiert wurde*. Es ist möglich, dass die Fehlfunktion nach dem Persistieren der Nachricht aber vor dem Schreiben der Antwort an den Aurufer erfolgt ist. Dies ist ein gängiges Attributs jeden Aufrufs des RPC-Typs: Sie können nicht einfach aufgrund nicht reagierenden Aufrufs darauf schließen, dass dieser fehlgeschlagen ist. Ganz gleich, ob es sich um einen Aufruf von Web-Diensten, eine HTTP "get"-Anfrage oder einen ejb-Aufruf handelt - es gilt dasselbe. Der Trick besteht darin, den Code Ihrer Anwendungen so zu schreiben, dass Ihre Operationen *idempotent* sind, d.h. diese wiederholt werden können, ohne dass das System in einen inkonsistenten Status gelangt. Mit einem Nachrichtensystem können Sie dies auf Nachrichtenebene tun, indem Sie auf doppelte Nachrichten prüfen und diese bei deren Ankunft verwerfen. Das Prüfen doppelter Nachrichten (sog. "Duplicate Checking") ist ein wirkungsvolles Mittel, das in vielen Fällen die Notwendigkeit von XA-Transaktionen beseitigt.
es_es: Si la llamada para enviar un mensaje persistente a un destino persistente retorna exitosamente sin excepciones entonces puede estar seguro de que el mensaje fue persistido. Sin embargo, si la llamada no retorna exitosamente, por ejemplo, si se presenta una excepción entonces *no hay seguridad de que el mensaje no fue persistido*. Ya que la falla pudo haber ocurrido después de persistir el mensaje pero antes de escribir la respuesta al que realiza la llamada. Este es un atributo común de cualquier llamada de tipo RPC: ya que la llamada no retornó se infiere que la llamada no tuvo exito. Ya sea una llamada del servicio de red, una petición get HTTP o una invocación ejb lo mismo aplica. El truco es codificar su aplicación de manera que sus operaciones sean *idempotent* por ejemplo, se pueden repetir sin hacer que el sistema caiga en un estado inconsistente. Con un sistema de mensajes puede lograr esto a nivel de aplicación, chequeando mensajes duplicados y descartándolos si llegan. El chequeo de duplicados es una técnica poderosa que en muchos casos puede eliminar la necesidad de transacciones XA.
fr_fr: Si un appel d'envoi d'un message persistant vers une destination persistante retourne sans exception, alors vous pouvez être certain que le message était persistant. Mais si l'appel retourne sans succès, par exemple s'il y a une exception, alors *vous ne pouvez pas être sûr que le message n'était pas persistant* car l'échec a pu avoir lieu après que le message ait été rendu persistant, et avant d'écrire la réponse à l'émetteur du message. Un attribut commun de n'importe quel appel type RPC est le fait que vous ne pouvez pas savoir que l'appel est sans succès juste par le fait que l'appel ne retourne pas. Que ce soit une appel de service Web, une demande HTTP get, une invocation ejb, la même chose s'applique. L'astuce est d'encoder votre application de façon à ce que vos opérations soient *idempotentes*, c'est à dire qu'elles peuvent être répétées sans mettre le système dans un état inconsistant. Avec un système de messagerie, vous pouvez effectuer cela au niveau application, en vérifiant les doubles messages, et en les ignorant quand ils arrivent. La vérification des duplicata est une technique efficace de suppression du besoin de transactions XA dans de nombreux cas.
ja_jp: 固定のメッセージを永続化の送り先 に送るための呼び出しが例外なしに正常に戻る 場合は、メッセージが永続化したことを断定できます。しかし、呼び出しが正常に 戻らない場合（例：例外エラーの出現など）、メッセージが永続化していなかったか どうか確定できません。この失敗はメッセージが永続化した後、そしてコーラーへ対応を 書き込む前に発生したかも知れません。これは良くある RPC 型の呼び出しの性格です。 Web サービスの呼び出しでも、HTTP の get 要求でも、ejb インボケーションでも 同じことが起こります。対策としてはオペレーションが「idempotent」になるように、すなわち システムを不均一な状態にしないでオペレーションを繰り返すことができるようにご使用のアプリケーションに コードを書くことです。メッセージシステムでは、重複メッセージをチェックして 重複メッセージが到着するとそれを破棄することにより、アプリケーションレベルでこれを達成できます。 重複のチェックは非常にパワフルな技術であり、これは多くのケースで XA トランザクションの必要性を 取り除くことができます。
pt_br: Caso a chamada para envio de uma mensagem persistente a uma destinação persistente retornar com êxito sem exceção, você poderá estar certo de que a mensagem era persistente. No entanto, se a chamada não retornar com sucesso, por exemplo: se uma exceção é lançada, então *não há certeza de que a mensagem não era persistente*. Tudo isto, devido ao fato que o failover poderá ter ocorrido após a persistência da mensagem, mas antes de gravar a resposta ao chamador. Este é um atributo comum de qualquer chamada de tipo RPC: você não pode dizer pela chamada não retornada que a chamada não foi bem sucedida,independente de ser uma chamada de serviços da web, uma solicitação de obtenção de HTTP ou uma invocação ejb de mesma aplicação. O segredo é codificar seu aplicativo, de forma que suas operações sejam *idempotentes*. Por exemplo: elas podem ser repetitivas sem levar o sistema a um estado inconsistente. Com um sistema de mensagem você pode realizar isto no nível do aplicativo, checando por mensagens duplicadas e descartando-as caso elas cheguem. A checagem duplicada é uma técnica muito poderosa que pode remover a necessidade das transações XA, em muitos casos.
zh_cn: 如果对发送持久性消息到持久性目的地的调用成功返回，那么你可以确认消息已经被持久化了。然而，如果这个调用没有成功返回，例如有异常被抛出，你并不能确认消息没有被持久化。因为故障可能发生在消息已经被持久化后，而在响应调用者之前。这是任何 RPC 类型的调用的一个共同问题：调用没有返回并不代表它没有成功执行。不管它是一个 web 服务调用、HTTP 的 GET 请求，还是 EJB 调用，都是如此。编程的诀窍是使这些操作成为幂等的（idempotent），也就是它们可以重复而不会使系统的状态不一致。对于消息系统来说，你可以在应用程序级别上来实现这一点，也就是检查重复的消息并在其到达时丢弃它们。对重复的检查是一种非常强大的技术，在许多情况下它可以消除对 XA 事务的需要。

source: In the clustered case, JBM is by default configured to automatically detect duplicate messages.
de_de: Im geclusterten Fall ist JBM standardmäßig so konfiguriert, dass doppelte Nachrichten automatisch aufgespürt werden.
es_es: En el caso con clústers, JBM por defecto está configurado para detectar de manera automática los mensajes duplicados.
fr_fr: Dans le cas de groupements, JBM est configuré par défaut pour détecter automatiquement les messages doubles.
ja_jp: クラスター化のケースでは、 JBM はデフォルトで自動的に重複メッセージを検出するように 設定されています。
pt_br: No caso com cluster, o JBM é configurado por padrão para detectar automaticamente as mensagens duplicadas.
zh_cn: 而在群集环境里，JBM 将缺省自动检测重复的消息。

source: Clustered connection factories
de_de: Geclusterte Connection Factories
es_es: Fábricas de conexiones en clústers
fr_fr: Les usines de connexions groupées
ja_jp: クラスター化した接続ファクトリ
pt_br: Criações de conexão com cluster
zh_cn: 群集的连接工厂

source: If the supportsLoadBalancing attribute of the connection factory is set to true then consecutive create connection attempts will round robin between available servers. The first node to try is chosen randomly
de_de: Falls das supportsLoadBalancing-Attribut der Connection Factory auf "true" eingestellt ist, so erfolgt bei nachfolgenden Versuchen eine Verbindung zu erstellen ("create connection") ein Round Robin zwischen verfügbaren Server. Der erste Node, an dem dies versucht wird, wird zufällig ausgewählt.
es_es: Si el atributo supportsLoadBalancing de la fábrica de conexiones está configurado como verdadero entonces los intentos consecutivos de creación de conexiones se resolverán de manera equitativa entre los servidores disponibles. El primer nodo se escoje al azar
fr_fr: Si l'attribut supportsLoadBalancing de l'usine de connexion est configuré à 'true', alors les tentatives de création de connexions consécutives entraîneront un circuit cyclique entre les serveurs disponibles. Le premier noeud est choisi au hasard.
ja_jp: 接続ファクトリの supportsLoadBalancing 属性は「true」にセットしてあるため、 連続的な接続作成の試行が利用可能なサーバーに総当たりで適用されます。その試行に 適用される最初のノードはランダムに選択されます。
pt_br: Caso o atributo supportsLoadBalancing de criação de conexão estiver configurado para verdadeiro, então a conexão de criação consecutiva tentará a repetição alternada entre os servidores disponíveis. Este primeiro nó para tentativa é escolhido aleatoriamente.
zh_cn: 如果连接工厂的 supportsLoadBalancing 属性为 true，那么它将在可用的服务器间循环地尝试创建连接。第一个尝试的节点将被随机地选择。

source: If the supportsFailover attribute of the connection factory is set to true then automatic failover is enabled. This will automatically failover from one server to another, transparently to the user, in case of failure.
de_de: Ist das supportsFailover-Attribut der Connection Factory auf "true" eingestellt, so ist automatische Failover aktiviert. Ein automatischer Failover von einem Server zum anderen erfolgt im Falle einer Fehlfunktion auf für den Benutzer transparente Weise.
es_es: Si el atributo supportsFailover de la fábrica de conexiones se configura como verdadero entonces se activa la conmutación en caso de fallo. Esto realizará la conmutación en caso de fallo de manera automática desde un servidor a otro, transparentemente al usuario, en caso de falla.
fr_fr: Si l'attribut supportsFailover de l'usine de connexion est configuré à 'true', alors on active une reprise automatique suite à un échec. Cette reprise va être exécutée automatiquement d'un serveur à l'autre, en toute transparence vis à vis de l'utilisateur.
ja_jp: 接続ファクトリの supportsFailover 属性が「true」にセットしてあると、 自動フェイルオーバーが有効になります。障害発生時にはこれがユーザーに透過的に １つのサーバーから別のサーバーへ自動的にフェイルオーバーします。
pt_br: Caso o atributo supportsFailover de criação de conexão seja configurado para verdadeiro, então o failover automático será ativado. Isto irá automatizar o failover a partir de um servidor a outro, claramente ao usuário, no caso de um failover.
zh_cn: 如果连接工厂的 supportsFailover 属性为 true，那么自动失效切换将被启用。在故障发生是，这将自动地从一个服务器切换到另外一个服务器，而对于用户来说是透明的。

source: If automatic failover is not required or you wish to do manual failover (JBoss MQ style) this can be set to false, and you can supply a standard JMS ExceptionListener on the connection which will be called in case of connection failure. You would then need to manually close the connection, lookup a new connection factory from HA JNDI and recreate the connection.
de_de: Wird der automatische Failover nicht benötigt oder aber Sie möchten einen manuellen Failover (JBoss MQ Art) durchführen, so kann dies auf "false" eingestellt werden, und Sie können einen standardmäßigen JMS ExceptionListener an der Verbindung angeben, der im Fall eines Fehlschlagens der Verbindung aufgerufen wird. Sie müssten dann die Verbindung manuell schließen, aus HA JNDI eine neue Connection Factory heraussuchen und die Verbindung neu erstellen.
es_es: Si no se requiere la conmutación automática en caso de fallos o si quiere hacer la conmutación de manera manual (del estilo JBoss MQ) entonces esto se puede configurar como falso y puede proporcionar un ExceptionListener JMS estándar en la conexión, la cual se llamará en caso de falla de una conexión. Entonces necesitaría cerrar manualmente la conexión, buscar una nueva fábrica de conexiones desde HA JNDI y recrear la conexión.
fr_fr: Si la reprise automatique suite à une mise en échec n'est pas requise, ou si vous souhaitez effectuer des reprises manuelles (style JBoss MQ), vous pouvez configurer à 'faux', et vous pouvez fournir un JMS ExceptionListener standard sur la connexion qui pourra être appelé en cas d'échec de connexion. Vous aurez alors besoin de fermer manuellement la connexion, chercher une nouvelle usine de connexion dans HA JNDI et recréer une connexion.
ja_jp: 自動フェイルオーバーが必要でない場合、又は手動のフェイルオーバー（JBoss MQ スタイル）を 使用したい場合は、設定を「false」にセットすることで、接続失敗の状況で呼び出しされる 標準 JMS ExceptionListener を接続上に供給できます。その後は、手動で 接続を閉じてから、 HA JNDI から新規の接続ファクトリを見つけて接続を再度作成します。
pt_br: Caso o failover automático não seja solicitado ou você desejar realizar um failover manualmente (estilo JBoss MQ), ele poderá ser configurado para falso e você poderá suprir o JMS ExceptionListener padrão, na conexão que será chamada em caso de um failover na conexão. Você então precisará encerrar a conexão manualmente, observar uma nova criação de conexão a partir do HA JNDI e recriar a conexão.
zh_cn: 如果不要求自动失效切换或者你想手工来完成（JBoss MQ 风格），你可以将其设置为 false，而且你可以为连接提供一个标准的 JMS ExceptionListener，它在连接发生故障时将被调用。然后你需要手工关闭这个连接，从 HA JNDI 里查找一个新的连接工厂并重新创建连接。

source: Specify the desired port rage (e.g. ports-01, ports-02... etc)
fr_fr: Préciser la gamme des ports souhaités (par ex. ports-01, ports-02... etc)

source: Every node deployed must have a unique id, including those in a particular LAN cluster, and also those only linked by mesage bridges.
fr_fr: Chaque noeud déployé doit posséder une id unique, y compris ceux qui sont dans un groupement LAN particulier, et aussi ceux qui sont liés par des ponts de messagerie uniquement.
