Repository: bobmcwhirter/jboss-messaging
Catalog: docs/EAP_4_3/JBoss_Messaging_User_Guide/*/C_Configuration.po
Languages: de_de, es_es, fr_fr, ja_jp, pt_br, zh_cn

source: JBoss Messaging Clustering Configuration
de_de: JBoss Messaging Clustering-Konfiguration
es_es: Configuración de JBoss Messaging en clústers
fr_fr: Configuration de groupements JBoss Messaging
ja_jp: JBoss Messaging クラスタリング設定
pt_br: Configuração com Cluster do JBoss Messaging
zh_cn: JBoss Messaging 群集配置

source: JBoss Messaging clustering should work out of the box in most cases with no configuration changes. It is however crucial that every node is assigned a unique server id.
de_de: Das Clustering von JBoss Messaging sollte in den meisten Fällen ohne Konfigurationsänderung problemlos funktionieren. Es ist jedoch essentiell, dass jedem Node eine eindeutige Server-ID zugewiesen wird.
es_es: JBoss Messaging clustering debe funcionar tal como viene originalmente sin tener qe realizar cambios en la configuración. Sin embargo, es muy importante que se le asigne un id único de servidor a cada nodo.
fr_fr: Le groupage JBoss Messaging doit normalement fonctionner dans la plupart des cas sans changements de configuration. Il est cependant crucial que chaque noeud soit associé à une id de serveur unique.
ja_jp: JBoss Messaging クラスタリングは、ほとんどのケースで設定変更無しに新品状態の まま機能するはずです。しかし、すべてのノードに独自のサーバー id を割り当てる ことが重要です。
pt_br: O cluster do JBoss Messaging deveria funcionar fora da caixa em muitos casos, sem mudanças na configuração. No entanto, é crucial que cada nó seja determinado a uma id do servidor única.
zh_cn: 在大部分情况下，JBoss Messaging 群集应该可以直接运行而不需要修改任何配置。然而为每个节点都分配一个唯一的服务器 ID 是很重要的。

source: For a clustered installation it is mandatory that a shared database is available to all nodes in the cluster. The default JBoss AS uses HSQLDB for its database which is a local shared database. Therefore in order to use clustering you must replace this with a different shared database. If the database is not replaced then clustering will not work.
de_de: Für eine geclusterte Installation ist es zwingend erforderlich, dass allen Nodes im Cluster eine geteilte Datenbank verfügbar ist. Der standardmäßige JBoss AS verwendet HSQLDB für seine Datenbank, bei der es sich um eine lokale geteilte Datenbank handelt. Um daher Clustering zu verwenden, müssen Sie dies durch eine andere geteilte Datenbank ersetzen. Wird die Datenbank nicht ersetzt, so funktioniert Clustering nicht.
es_es: Para una instalación en clúster es obligatorio que una base de datos compartida esté disponible para todos los nodos en el clúster. El JBoss AS predeterminado utiliza HSQLDB para su base de datos la cual es una base de datos local compartida. Por lo tanto con el fin de utilizar clústers tiene que reemplazar esto con una diferente base de datos compartida. Si la base de datos no se reemplaza entonces el clúster no funcionará.
fr_fr: Pour une installation groupée, il est de rigueur qu'une base de données partagée doive être disponible pour tous les noeuds d'un groupement. JBoss AS par défaut utilise HSQLDB comme base de données, qui est une base de données locale partagée. Ainsi, pour utiliser le groupage, vous devez la remplacer par une base de données locale différente. Si la base de données n'est pas remplacée, alors le groupage ne fonctionnera pas.
ja_jp: クラスター化したインストールには、共有データベースがクラスター内の全ての ノードで使用できることが必須条件です。デフォルトの JBoss AS はそのデータベースとして ローカルの共有データベースである HSQLDB を使用します。そのため、クラスタリングを 使用するには、これを異なる共有データベースに入れ替える必要があります。データベースが 入れ替わらないとクラスタリングは機能しません。
pt_br: É mandatário que um banco de dados compartilhado esteja disponível para todos os nós em um cluster, em uma instalação com cluster. O padrão JBoss AS usa HSQLDB para seu banco de dados, do qual é um banco de dados local compartilhado. Portanto, com a finalidade de se utilizar o cluster, você deverá substituí-lo com um diferente banco de dados compartilhado. Se o banco de dados não for substituído, então o cluster não funcionará.
zh_cn: 对于基于群集的安装来说，群集里的每个节点都有一个共享的数据库是强制的。JBoss AS 缺省使用的 HSQLDB 是一个本地的共享数据库。因此，如果要使用群集，你必须用另外的数据库来替换它。

source: If you want to run multiple JBoss Messaging nodes on the same box using the same IP address, e.g. for development purposes, then you can use the ServiceBindingManager to do this as follows:
de_de: Falls Sie mehrere JBoss Messaging Nodes an derselben Box laufen lassen und dieselbe IP-Adresse verwenden möchten, etwa zu Entwicklungszwecken, so können Sie den ServiceBindingManager verwenden, um dies wie folgt zu tun:
es_es: Si quiere ejecutar múltiples nodos de JBoss Messaging en la misma máquina utilizando la misma dirección IP, por ejemplo, para propósitos de desarrollo entonces puede utilizar el ServiceBindingManager para que haga esto así:
fr_fr: Si vous souhaitez exécuter plusieurs noeuds JBoss Messaging sur la même machine en utilisant la même adresse IP, comme dans des buts de développement, alors vous pouvez utiliser le ServiceBindingManager dans ce but comme suit:
ja_jp: 例えば、開発目的のように同じ IP アドレスを使用して同じボックスで複数の JBoss Messaging ノードを実行したい場合は、その実行に以下のような手法で ServiceBindingManager を使用することができます:
pt_br: Caso você queira rodar múltiplos nós do JBoss Messaging na mesma caixa usando o mesmo endereço IP, por exemplo: para finalidades de desenvolvimento, então você poderá usar o ServiceBindingManager, conforme segue abaixo:
zh_cn: 如果你想在同一台机器上运行多个 JBoss Messaging 实例，如出于开发目的，你可以用 ServiceBindingManager 来实现：

source: Uncomment binding manager service from $JBOSS_CONFIG/conf/jboss-service.xml
de_de: Unkommentieren Sie den Binding Manager Dienst von $JBOSS_CONFIG/conf/jboss-service.xml
es_es: Borre el comentario del servicio administrador de enlaces desde $JBOSS_CONFIG/conf/jboss-service.xml
fr_fr: Retirer vos commentaires du service de gestion des liaisons de $JBOSS_CONFIG/conf/jboss-service.xml
ja_jp: $JBOSS_CONFIG/conf/jboss-service.xml でバインディングマネージャサービスを アンコメントします。
pt_br: Serviço gerenciador binding sem comentário a partir do $JBOSS_CONFIG/conf/jboss-service.xml
zh_cn: 在 $JBOSS_CONFIG/conf/jboss-service.xml 里注释 binding manager 服务

source: Specify the desired port range (e.g. ports-01, ports-02... etc)
de_de: Legen Sie den gewünschten Port-Bereich fest (z.B. ports-01, ports-02... u.s.w.)
es_es: Especifique el rango deseado del puerto (por ejemplo, ports-01, ports-02... etc)
ja_jp: 希望のポート範囲を指定します（例、ports-01, ports-02...など）
pt_br: Especifica a abrangência do porto desejado (por exemplo: ports-01, ports-02... etc).
zh_cn: 指定端口范围（如ports-01、ports-02 等）

source: Look at $JBOSS_HOME/docs/examples/binding-manager/sample-bindings.xml. On each port range, JBoss Remoting configuration should look like:
de_de: Sehen Sie sich $JBOSS_HOME/docs/examples/binding-manager/sample-bindings.xml an. An jedem Port-Bereich sollte die JBoss Remoting-Konfiguration wie folgt aussehen:
es_es: Vea $JBOSS_HOME/docs/examples/binding-manager/sample-bindings.xml. En cada rango de puerto, la configuración de JBoss Remoting se debe ver así:
fr_fr: Observez $JBOSS_HOME/docs/examples/binding-manager/sample-bindings.xml. Sur chaque gamme de pont, la configuration JBoss Remoting devra ressembler à ce qui suit:
ja_jp: $JBOSS_HOME/docs/examples/binding-manager/sample-bindings.xml を確認します。 各ポート範囲で、JBoss Remoting 設定は以下のように見えるはずです:
pt_br: Observe o $JBOSS_HOME/docs/examples/binding-manager/sample-bindings.xml. Em cada abrangência de porto, a configuração do JBoss Remoting deve parecer-se com:
zh_cn: 来看看 $JBOSS_HOME/docs/examples/binding-manager/sample-bindings.xml。针对每个端口范围的 JBoss Remoting 配置都应该类似于：

source: You must ensure that the config (like above) is identical to that in <literal>remoting-bisocket-service.xml</literal> With the exception of the actual serverBindPort which clearly must be different for each ports range. Please note that the default JBoss Messaging service binding manager bindings in <literal>sample-bindings.xml</literal> shipped with JBAS 4.2.0 is out of date and you will need to copy the config from <literal>remoting-bisocket-service.xml</literal>
de_de: Sie müssen sicherstellen, dass die config (wie oben) is identisch mit derjenigen in <literal>remoting-bisocket-service.xml</literal> ist, ausgenommen des tatsächlichen serverBindPorts, der für den Bereich jeden Ports verschieden sein muss. Bitte beachten Sie, dass die Bindings des standardmäßigen JBoss Messaging Service Binding Managers in <literal>sample-bindings.xml</literal>, die mit JBAS 4.2.0 geliefert werden, veraltet sind und Sie die config <literal>remoting-bisocket-service.xml</literal> werden kopieren müssen.
es_es: Debe asegurarse de que la configuración (como la anterior) sea idéntica a la que se encuentra en <literal>remoting-bisocket-service.xml</literal> Con la excepción del serverBindPort el cual claramente debe ser diferente para cada rango de puerto. Observe que los enlaces del administrador de enlaces del servicio de JBoss Messaging predeterminado en <literal>sample-bindings.xml</literal> que se envía con JBAS 4.2.0 se encuentra desactualizado y necesitará copiar la configuración desde <literal>remoting-bisocket-service.xml</literal>
fr_fr: Vous devrez veiller à ce que la configuration (comme ci-dessus) soit semblable à celle présente dans <literal>remoting-bisocket-service.xml</literal> avec le serverBindPort pour exception, qui doit être différent pour chaque spectrum de ports. Veuillez noter que les mises en liaison du gestionnaire du service de mises en liaison JBoss Messaging dans <literal>sample-bindings.xml</literal> associé à JBAS 4.2.0 est maintenant obsolète et que vous aurez besoin de copier la configuration à partir de <literal>remoting-bisocket-service.xml</literal>
ja_jp: (上記のような）config が <literal>remoting-bisocket-service.xml</literal> 内の config と同一になるように確認しなければなりません。各ポート範囲では明らかに異なる 実際の serverBindPort は例外です。JBAS 4.2.0 で配布される <literal>sample-bindings.xml</literal> 内の デフォルトの Boss Messaging サービスバインディングマネージャバインディングは、旧式のものであるため、 <literal>remoting-bisocket-service.xml</literal> から config をコピーする必要があることに注意して 下さい。
pt_br: Você deve garantir que a config (conforme acima) é idêntica àquela em <literal>remoting-bisocket-service.xml</literal>, com a exceção do serverBindPort atual, que claramente deve ser diferente para cada abrangência de portos. Perceba também que o gerenciador binding de serviço JBoss Messaging em <literal>sample-bindings.xml</literal>, lançado com o JBAS 4.2.0, está desatualizado e você precisará copiar a config a partir do <literal>remoting-bisocket-service.xml</literal>
zh_cn: 你必须确保这个配置（如上所示）和 <literal>remoting-bisocket-service.xml</literal> 里的一样，除了每个端口范围的实际 serverBindPort 必须不同。请注意，JBAS 4.2.0 附带的<literal>sample-bindings.xml</literal> 里的缺省 JBoss Messaging 服务 binding manager 绑定是过期的，你需要从 <literal>remoting-bisocket-service.xml</literal> 里把相关配置复制过来。

source: You should ensure that each node is configured to use a different ports range.
de_de: Sie sollten sicherstellen, dass jeder Node so konfiguriert ist, dass er den Bereich eines anderen Ports verwendet.
es_es: Debe asegurarse de que cada nodo se configure para que utilice un rango diferente de puerto.
fr_fr: Vous devrez veiller à ce que chaque noeud soit configuré pour utiliser une gamme de ports différents.
ja_jp: 各ノードが異なるポート範囲を使用するように設定されていることを確認しなければ なりません。
pt_br: Você deverá certificar-se que cada nó é configurado para usar abrangência de portos diferentes.
zh_cn: 你应该确保每个节点使用不同的端口范围。

source: Unique server peer id
de_de: Eindeutige Server Peer id
es_es: Id único del servidor compañero
fr_fr: Id unique pour un serveur parent
ja_jp: 特有のサーバーピア id
pt_br: Id única do servidor peer
zh_cn: 唯一的 server peer id

source: Every node deployed must have a unique id, including those in a particular LAN cluster, and also those only linked by message bridges.
de_de: Jeder deployte Node muss eine eindeutige ID besitzen, einschließlich derer in einem bestimmten LAN Cluster sowie derjenigen, die durch Message Bridges (Nachrichtenbrücken) verbundenen.
es_es: Todo nodo desplegado debe tener un id único incluyendo aquellos en un clúster LAN en particular y también aquellos sólo enlazados por puentes de mensajes.
ja_jp: 特定の LAN クラスター内のものとメッセージブリッジでのみリンクされているものを含む デプロイ済みの全てのノードが特有のアイデンティティを持つ必要があります。
pt_br: Cada nó implementado deve possuir uma id única, incluindo aqueles num específico cluster LAN e aqueles apenas ligados por interligações de mensagem.
zh_cn: 每个部署的节点必须具有唯一的 ID，这包括特殊局域网群集里的节点，以及只通过消息桥链接的节点。

source: Ensure the <literal>ServerPeerID</literal> MBean attribute value in <filename>messaging-service.xml</filename> is unique for each node on the cluster. The <literal>ServerPeerID</literal> value must be a valid integer.
de_de: Vergewissern Sie sich, dass der Wert des <literal>ServerPeerID</literal> MBean Attributs in <filename>messaging-service.xml</filename> eindeutig für jeden Node des Clusters ist. Der <literal>ServerPeerID</literal>-Wert muss ein gültiger ganzzahliger Wert sein.
es_es: Asegúrese de que el valor del atributo MBean <literal>ServerPeerID</literal> en <filename>messaging-service.xml</filename> es único para cada nodo en el clúster. El valor <literal>ServerPeerID</literal> debe ser un número entero válido.
fr_fr: Veillez à ce que la valeur de l'attribut MBean <literal>ServerPeerID</literal> dans <filename>messaging-service.xml</filename> est bien unique pour chaque noeud du groupement. La valeur de <literal>ServerPeerID</literal> doit être un entier relatif valide.
ja_jp: <filename>messaging-service.xml</filename> 内の <literal>ServerPeerID</literal> MBean の属性値は クラスター内の各ノード用に特有であることを確認します。<literal>ServerPeerID</literal> 値は有効な 整数でなければなりません。
pt_br: Garanta que o valor do atributo do <literal>ServerPeerID</literal> MBean em <filename>messaging-service.xml</filename> é único para cada nó no cluster. O valor <literal>ServerPeerID</literal> deve ser um número válido.
zh_cn: 确保 <filename>messaging-service.xml</filename> 里针对群集里的每个节点的 <literal>ServerPeerID</literal> MBean 属性值是唯一的。<literal>ServerPeerID</literal> 必须为整型值。

source: Clustered destinations
de_de: Geclusterte Destinationen
es_es: Destinos con clústers
fr_fr: Destinations groupées
ja_jp: クラスター化した送り先
pt_br: Destinações com cluster
zh_cn: 群集目的地

source: JBoss Messaging clusters JMS queues and topics transparently across the cluster. Messages sent to a distributed queue or topic on one node are consumable on other nodes. To designate that a particular destination is clustered simply set the clustered attribute in the destination deployment descriptor to true.
de_de: JBoss Messaging clustert JMS-Warteschlangen und Topics transparent über das Cluster hinweg. An eine distribuierte Warteschlange oder Topic gesendete Nachrichten an einem Node sind an anderen Nodes verwendbar. Um eine bestimmte Destination als geclustert zu designieren setzen Sie das geclusterte Attribut im Destination-Deployment Descriptor auf "true".
es_es: JBoss Messaging pone en clústers colas y temas JMS de manera transparente a través del clúster. Los mensajes enviados a un tema o a una cola distribuida en un nodo son consumibles en otros nodos. Para designar que un destino en particular está en un clúster simplemente establezca el atributo clustered en el descriptor de despliegue de destino como verdadero.
fr_fr: JBoss Messaging groupe des queues et des sujets JMS de façon transparente à travers le groupement. Les messages envoyés vers un sujet ou une queue distribuée sur l'un des noeuds sont consommables sur d'autres noeuds. Pour indiquer qu'une destination particulière est groupée, configurer tout simplement l'attribut clusterisé à la valeur 'true' (vrai) dans le descripteur de déploiement de destination.
ja_jp: JBoss Messaging はクラスター全域で JMS キューとトピックを透過的にクラスター化 します。１つのノード上にある分散したキュー又はトピックへ送られたメッセージは 他のノード上では消費物となります。特定の送り先がクラスター化されていることを 表示するには、単に送り先デプロイメント記述子内のクラスター化属性を「true」にセットする だけです。
pt_br: As filas dos clusters do JBoss Messaging e tópicos ultrapassam transparentemente o cluster. As mensagens enviadas a uma fila distribuída ou tópico em um nó são consumíveis em outros nós. Para descobrir se uma específica destinação está com cluster, apenas configure o atributo com cluster no descritor de implementação de destinação para verdadeiro.
zh_cn: JBoss Messaging 透明地群集了 JMS 队列和主题。发送到分布式队列或主题的消息也可在其他节点上获取。要指定特定节点为群集的，只要设置目的地部署描述符里的 clustered 属性为 true 就可以了。

source: JBoss Messaging balances messages between nodes, catering for faster or slower consumers to efficiently balance processing load across the cluster.
de_de: JBoss Messaging balanciert Nachrichten zwischen Nodes, und sorgt dafür, dass schnellere und langsamere Verbraucher effizient die Verabeitungslasten über den Cluster abgleichen.
es_es: JBoss Messaging balancea los mensajes entre nodos satisfaciendo consumidores rápidos o despaciosos para balancear de manera eficiente el procesamiento de carga a través del clúster.
fr_fr: JBossMessaging répartit les messages entre les noeuds, afin de répondre aux besoins de consommateurs plus ou moins rapides, en vue d'équilibrer le volume de traitement de manière efficace à travers le groupement.
ja_jp: JBoss Messaging はノード間のメッセージのバランスを配分し、クラスター全域で プロセス負荷の効率的バランスの為に コンシューマ の速度を調節します。
pt_br: O JBoss Messaging efetua o balanço entre mensagens e nós, fornecendo para consumidores lentos ou rápidos o balanço eficiente de carga processada através do cluster.
zh_cn: JBoss Messaging 在节点间平衡消息的负载，这是为了有效地调整群集里较快和较慢消费者的负载。

source: If you do not want message redistribution between nodes, but still want to retain the other charactereristics of clustered destinations. You can do this by not specifying the attribute ClusterPullConnectionFactoryName on the server peer
de_de: Falls Sie keine Redistribution von Nachrichten zwischen Nodes wünschen, aber die anderen Eigenschaften geclusterter Destinationen beibehalten möchten, so können Sie dies einrichten, indem Sie das Attribut ClusterPullConnectionFactoryName am Server Peer nicht festlegen
es_es: Si no quiere la redistribución de mensajes entre nodos pero aún quiere retener las otras características de los destinos en clústers. Puede lograr esto no especificando el atributo ClusterPullConnectionFactoryName en el servidor compañero
fr_fr: Si vous ne souhaitez pas avoir de redistribution de messages entre les noeuds, mais que vous souhaitez toujours garder les autres caractéristiques des destinations groupées, vous pouvez procéder en omettant de préciser l'attribut ClusterPullConnectionFactoryName sur le serveur parent.
ja_jp: ノード間でのメッセージ再分散は必要でないけれども、クラスター化した送り先の他の特性を 維持したい場合、サーバーピアでその属性 ClusterPullConnectionFactoryName を 指定しないことにより、それを達成できます。
pt_br: Caso você não queira a redistribuição de mensagem entre nós, mas ainda queira reter outras características de destinações com cluster, você poderá realizá-las apenas especificado o atributo ClusterPullConnectionFactoryName no servidor peer.
zh_cn: 如果你不想在节点间重新分发消息，但仍然想保留群集目的地的其他特点，你可以通过不指定 server peer 上的 ClusterPullConnectionFactoryName 属性来实现这一点。

source: Clustered durable subs
de_de: Geclusterte dauerhaft Subs
es_es: Subscripciones durables en clústers
fr_fr: Abonnements durables groupés
ja_jp: クラスター化した恒久サブスクリプション
pt_br: Subs duráveis com cluster
zh_cn: 群集的持久性订阅

source: JBoss Messaging durable subscriptions can also be clustered. This means multiple subscribers can consume from the same durable subscription from different nodes of the cluster. A durable subscription will be clustered if it's topic is clustered
de_de: Dauerhafte Abonnements von JBoss Messaging können ebenfalls geclustert werden. Dies bedeutet, dass mehrere Abonnementen dasselbe dauerhafte Abonnement von verschiedenen Nodes des Clusters aus verwenden können. Ein dauerhaftes Abonnement wird geclustert, falls das Topic geclustert ist.
es_es: Las subscripciones durables de JBoss Messaging también se pueden poner en clústers. Esto significa que múltiples subscriptores pueden consumir desde la misma subscripción durable desde diferentes nodos del clúster. Una subscrición durable se pondrá en clúster si su tema se encuentra en un clúster.
fr_fr: Les abonnements durables JBoss Messaging peuvent également être groupés. Cela signifie que plusieurs abonnées peuvent consommer à partir du même abonnement durable, à partir de divers noeuds du groupement. Un abonnement durable sera groupé si son sujet est groupé.
ja_jp: JBoss Messaging 恒久サブスクリプションもクラスター化することができます。 これは、複数のサブスクライバがクラスターの異なるノード群からの同じ恒久サブスクリプション から消費出来ることを意味します。そのトピックがクラスター化された場合に 恒久サブスクリプションはクラスター化されます。
pt_br: As subscrições duráveis do JBoss Messaging podem também estar com cluster. Isto significa que múltiplos subscritores podem consumir a partir da mesma subscrição durável de diferentes nós do cluster. A subscrição durável estará com cluster se este tópico estiver com cluster.
zh_cn: JBoss Messaging 的持久性订阅（durable subscription）也可以进行群集。这意味着多个订阅者可以在不同节点里访问相同的持久性订阅。如果持久性订阅的主题是群集的，那么它也将是群集的。

source: Clustered temporary destinations
de_de: Geclusterte temporäre Destinationen
es_es: Destinos temporales en clústers
fr_fr: Destinations temporaires groupées
ja_jp: クラスター化した一時的な送り先
pt_br: Destinações temporárias com cluster
zh_cn: 群集的临时目的地

source: JBoss Messaging also supports clustered temporary topics and queues. All temporary topics and queues will be clustered if the post office is clustered
de_de: JBoss Messaging unterstützt außerdem temporäre geclusterte Topics und Warteschlangen. Alle temporären Topics und Warteschlangen werden geclustert, wenn das Post Office geclustert ist.
es_es: JBoss Messaging también soporta temas y colas temporales en clústers. Todos los temas y colas temporales se pondrán en clústers si la oficina postal está en clúster
fr_fr: JBoss Messaging prend également en charge les files d'attente et les sujets temporaires. Toutes les files d'attente et tous les sujets temporaires seront groupés si Postoffice est groupé
ja_jp: JBoss Messaging はクラスター化した一時的なトピックとキューもサポートします。 ポストオフィスがクラスター化された場合に全ての一時的トピックとキューは、 クラスター化されます。
pt_br: O JBoss Messaging também suporta os tópicos temporariamente com cluster e filas. Todas as filas e tópicos temporários terão cluster se o correio possuir cluster.
zh_cn: JBoss Messaging 也支持群集的临时主题和队列。如果邮局（Post Office）是群集的，那么所有的临时主题和队列将被群集。

source: Non clustered servers
de_de: Nicht geclusterte Server
es_es: Servidores sin clústers
fr_fr: Serveurs non groupés
ja_jp: クラスター化していないサーバー群
pt_br: Servidores sem cluster
zh_cn: 非群集的服务器

source: If you don't want your nodes to participate in a cluster, or only have one non clustered server you can set the clustered attribute on the postoffice to false
de_de: Falls Sie nicht möchten, dass Ihre Nodes in einem Cluster teilhaben oder nur enen, ncht-geclusterten Server besitzen, so können Sie das "clustered"-Attribut am Post Office auf "false" setzen.
es_es: Si no quiere que sus nodos participen en un clúster o si sólo tienen un servidor sin clústers entonces puede configurar el atributo clustered en la postoffice como falso
fr_fr: Si vous ne souhaitez pas que vos noeuds participent à un groupement, ou si vous ne possédez qu'un serveur non groupé, vous pourrez configurer les attributs à 'false' sur Postoffice.
ja_jp: ご使用のノードをクラスターに参加させたくない場合、又はクラスター化していない サーバーが１台だけある場合は、postoffice のクラスター化属性を「false」に セットしてください。
pt_br: Caso você não deseje que seus nós participem de um cluster ou apenas possua um servidor sem cluster, você poderá configurar o atributo com cluster no correio para falso.
zh_cn: 如果你不希望你的节点参与某个群集，或者你只有一个非群集的服务器，你可以设置邮局的 clustered 属性为 false。

source: Message ordering in the cluster
de_de: Nachrichtenreihenfolge im Cluster
es_es: Ordenamiento de mensajes en el clúster
fr_fr: Ordonnancement des messages dans le groupement
ja_jp: クラスター内のメッセージ順序
pt_br: Pedido de mensagem no cluster
zh_cn: 管理群集里的顺序
