Repository: bobmcwhirter/jboss-messaging
Catalog: docs/EAP_4_3/JBoss_Messaging_User_Guide/*/Configuration.po
Languages: es_es, fr_fr, ja_jp, pt_br, zh_cn

source: <literal>FullSize</literal> - this is the maximum number of messages held by the queue or topic subscriptions in memory at any one time. The actual queue or subscription can hold many more messages than this but these are paged to and from storage as necessary as messages are added or consumed.
es_es: <literal>FullSize</literal> - este es el número máximo de mensajes que la cola o las subscripciones de tema mantienen en la memoria en cualquier momento. La cola misma o la subscripción pueden mantener muchos más mensajes que esto, pero estos se paginan para el almacenamiento y desde él cuando sea necesario en el momento que se añadan o se consuman los mensajes.
fr_fr: <literal>FullSize</literal> - c'est le nombre maximum des messages contenus par les abonnements sujet ou file d'attente, dans la mémoire à tout moment. La file d'attente ou l'abonnement ne peut pas contenir davantage de messages que cela, mais ces messages sont paginés en provenance ou vers la zone de stockage en fonction des besoins, et au fur et à mesure que les messages sont ajoutés ou consommés.
ja_jp: <literal>FullSize</literal> - これは一度に キュー 又はトピック のサブスクリプション により 保持できるメッセージの最大数です。実際のキュー や サブスクリプション はこれよりもっと 多数のメッセージを保持できますが、メッセージが追加や消費されるのに応じて必要時に メッセージはストレージ間でページされます。
pt_br: <literal>FullSize</literal> - este é o número máximo de mensagens mantidos pela fila ou pelas subscrições de tópico na memória a qualquer instante. A fila atual ou subscrição pode manter muitas outras mensagens que esta, mas elas são chamadas do/ para o armazenamento, toda vez que necessário, de acordo com a adição ou consumo das mensagens.
zh_cn: <literal>FullSize</literal> - 这是内存里的队列或主题订阅在任何时刻可容纳的最大消息数目。实际的队列或订阅可以容纳比这更多的消息，因为在添加或消费消息时可以按需要将这些消息分页至存储里。

source: <literal>PageSize</literal> - When loading messages from the queue or subscrition this is the maximum number of messages to pre-load in one operation.
es_es: <literal>PageSize</literal> - Al cargar mensajes desde la cola o desde la subscripción este es el número máximo de mensajes a pre-cargar en una operación.
fr_fr: <literal>PageSize</literal> - Lorsque vous chargez les messages de la file d'attente ou de l'abonnement, c'est le nombre maximum de messages à pré-charger au cours d'une seule opération.
ja_jp: <literal>PageSize</literal> - キュー あるい は サブスクリプション からメッセージをロードしている場合、 これが、１つのオペレーションでプレロードするメッセージの最大数です。
pt_br: <literal>PageSize</literal> - Este é o número máximo de mensagens de pré-carregamento em uma operação, quando carregando mensagens a partir da fila ou subscrição.
zh_cn: <literal>PageSize</literal> - 当从队列或订阅加载消息时，这是在某个操作里可以预加载的最大消息数目。

source: <literal>DownCacheSize</literal> - When paging messages to storage from the queue they first go into a "Down Cache" before being written to storage. This enables the write to occur as a single operation thus aiding performance. This setting determines the max number of messages that the Down Cache will hold before they are flushed to storage.
es_es: <literal>DownCacheSize</literal> - Al paginar mensajes al almacenamiento desde la cola primero van a un "Down Cache" antes de escribirlos en el almacenamiento. Esto activa la escritura para que ocurra como una sola operación lo cual ayuda al rendimiento. Esta configuración determina el número máximo de mensajes que el Down Cache mantendrá antes de que se vacien en el almacenamiento.
fr_fr: <literal>DownCacheSize</literal> - Lorsque vous paginez des messages de la zone de stockage vers la file d'attente, ils vont tout d'abord dans un "Down Cache" avant d'être inscrits dans la zone de stockage. Cela permet à 'écrire' d'opérer en une seule opération, améliorant ainsi la performance. Ce paramètre détermine le nombre maximum de messages que le Down Cache pourra contenir avant de le vider dans la zone de stockage.
ja_jp: <literal>DownCacheSize</literal> - キュー からストレージへメッセージをページング している場合、メッセージは先ず "Down Cache" に入ってからストレージに書き込まれます。 これにより、書き込みは単独のオペレーションとして発生し、パフォーマンスを支援することが できます。このセッティングは Down Cache がストレージに流す前に保持する メッセージの最大数を決定します。
pt_br: <literal>DownCacheSize</literal> -Isto permite que a gravação ocorra como uma única operação assim como auxiliando o desempenho. Tudo isto, quando chamando mensagens para o armazenamento a partir da fila que elas vão primeiramente a um "Down Cache", antes de serem gravadas. Esta configuração determina o número máximo de mensagens que o Down Cache manterá antes delas serem liberadas para o armazenamento.
zh_cn: <literal>DownCacheSize</literal> - 当把消息从队列里分页至存储里时，在实际上写入前它们首先进入一个 "Down Cache" 里。这使写入成为单个操作，因此提高了性能。这个设置决定了 Down Cache 在冲刷消息至存储前可容纳的消息的最大数目。

source: If no values for <literal>FullSize</literal>, <literal>PageSize</literal>, or <literal>DownCacheSize</literal> are specified they will default to values 75000, 2000, 2000 respectively.
es_es: Si no se especifican valores para <literal>FullSize</literal>, <literal>PageSize</literal>, o <literal>DownCacheSize</literal> entonces por defecto serán 75000, 2000, 2000 respectivamente.
fr_fr: Si aucune valeur pour <literal>FullSize</literal>, <literal>PageSize</literal>, ou <literal>DownCacheSize</literal> n'est spécifiée, alors les valeurs par défaut seront 75000, 2000, 2000 respectivement.
ja_jp: <literal>FullSize</literal> や <literal>PageSize</literal> や <literal>DownCacheSize</literal> の為の値が指定されていない場合、それぞれの デフォルトの値は 順に 75000, 2000, 2000 となります。
pt_br: Caso não haja valores especificados para <literal>FullSize</literal>, <literal>PageSize</literal>, ou <literal>DownCacheSize</literal>, eles irão padronizar os valores para 75000, 2000, 2000 respectivamente.
zh_cn: 如果没有指定 <literal>FullSize</literal>、<literal>PageSize</literal> 或 <literal>DownCacheSize</literal>，它们的缺省值将分别是 75000、2000、2000。

source: If you want to specify the paging parameters used for temporary queues then you need to specify them on the appropriate connection factory. See connection factory configuration for details.
es_es: Si quiere especificar los parámetros de paginación utilizados para colas temporales entonces necesita especificarlos en la fábrica de conexiones apropiadas. Consulte la configuración de la fábrica de conexiones para obtener más detalles.
fr_fr: Si vous souhaitez préciser les paramètres de pagination utilisés pour les files d'attente temporaires, vous aurez besoin de les spécifier pour les usines de connexion qui conviennent. Voir la configuration de l'usine de connexion pour davantage d'informations.
ja_jp: テンポラリ キュー に使用されるページングパラメータを指定したい場合、それらを 適切な接続ファクトリ上で指定する必要があります。その詳細については 接続ファクトリ設定をご覧下さい。
pt_br: Caso você queira especificar os parâmetros de paginação usados para filas temporárias, então você precisa especificá-los numa criação de conexão apropriada. Consulte a configuração de criação de conexão para maiores detalhes.
zh_cn: 如果你向指定用于临时队列的页面参数，那么你需要在合适的连接工厂上对它们进行指定。详情请参考连接工厂的配置。

source: Returns <literal>true</literal> if the queue was created programmatically
es_es: Retorna <literal>true</literal> si la cola fue creada programáticamente
fr_fr: Retourne <literal>true</literal> (vrai) si la file d'attente a été créée par le programme
ja_jp: キューがプログラムで作成されている場合は、<literal>true</literal> を返します。
pt_br: Retorna como <literal>true</literal>, caso a fila tenha sido criada de forma programática.
zh_cn: 如果队列是在程序里创建的话，返回 <literal>true</literal>

source: Returns the total number of messages in the queue = number not being delivered + number being delivered + number being scheduled
es_es: Retorna el número total de mensajes en la cola = número no entregado + número entregado + número programado
fr_fr: Retourne le nombre total de messages dans la file d'attente = nombre de messages non livrés + nombre de messages livrés + nombre de messages programmés
ja_jp: キュー内のメッセージの合計数を返します。これは未配信、配信中、及び配信予定の メッセージの合計数となります。
pt_br: Retorna o número total de mensagens na fila = número que não tenha sido entregue + número sendo programado.
zh_cn: 返回队列里的消息总数，它等于正在递送的消息数目 + 未递送的消息数目 + 正被调度的消息数目。

source: Returns the number of scheduled messages in the queue. This is the number of messages scheduled to be delivered at a later date.
es_es: Retorna el número de mensajes programados en la cola. Este es el número de mensajes programados para que sean entregados en una fecha posterior.
fr_fr: Retourne le nombre de messages programmés dans la file d'attente. Il s'agit du nombre de messages programmés à être envoyés plus tard.
ja_jp: キュー内の配信予定のメッセージ数を返します。これは後日に配信される予定の メッセージ数です。
pt_br: Retorna o número de mensagens programadas na fila. Este é o número de mensagens programadas na fila a ser entregue mais tarde.
zh_cn: 返回队列里已调度的消息的数目。这些消息预定在以后的时间进行递送。

source: Scheduled delivery is a feature of JBoss Messaging where you can send a message and specify the earliest time at which it will be delivered. E.g. you can send a message now, but the message won't actually be delivered until 2 hours time.
es_es: La entrega programada es una característica de JBoss Messaging por medio de la cual puede enviar un mensaje y especificar el momento más temprano en el que se entregará. Por ejemplo, puede enviar un mensaje ahora pero este no se entregará si no hasta dentro de dos horas.
fr_fr: La livraison programmée de messages est une fonction de JBoss Messaging qui vous permet d'envoyer un message et de spécifier à quel moment vous souhaitez qu'il soit livré. Par ex. vous pouvez envoyer un message maintenant, mais ce message ne sera livré que dans 2 heures.
ja_jp: スケジュールした配信は JBoss Messaging の特徴で、そこではメッセージを 送信しておいて、配信される一番早期の日時を指定することができます。 例えば、メッセージを今、送信をして、それでも実際の配信は２時間後にするという設定ができます。
pt_br: A entrega programada é um recurso do JBoss Messaging onde você pode enviar uma mensagem e especificar o período mais próximo em que ela será entregue. Por exemplo: você pode enviar uma mensagem agora, mas a mensagem não será entregue, na realidade, antes de 2 horas.
zh_cn: 调度递送是 JBoss Messaging 的一个功能，你可以发送消息并指定递送的最早时间。例如，你可以现在就发送一条消息，但这个消息实际上会在两小时后被递送。

source: To do this, you just need to set the following header in the message before sending:
es_es: Para lograr esto sólo necesita configurar el siguiente encabezado en el mensaje antes de enviarlo:
fr_fr: Pour cela, vous avez juste besoin de paramétrer le titre suivant pour le message que vous souhaitez envoyer:
ja_jp: これを行うには、送信前にメッセージ内に以下のようなヘッダをセットするだけです:
pt_br: Para isto, você precisa apenas configurar o seguinte cabeçalho na mensagem, antes do envio:
zh_cn: 要实现这一点，你只需要在消息里设置下面的消息头部信息：

source: A maximum size (in number of messages) can be specified for a queue. Any messages that arrive beyond this point will be dropped. The default is <literal>-1</literal> which is unbounded.
es_es: Se puede especificar un tamaño máximo (en número de mensajes) para una cola. Cualquier mensaje que llegue después de este punto se borrará. Por defecto es <literal>-1</literal> que significa desvinculado.
fr_fr: Vous pourrez préciser une taille maximum (en nombre de messages) pour une file d'attente. Tout message qui arrive ensuite sera abandonné. La valeur par défaut est <literal>-1</literal> valeur non bornée.
ja_jp: 最大サイズ（メッセージの数量）はキュー 用に指定できます。この数量以上に 到着するメッセージは破棄されます。デフォルトは <literal>-1</literal> で、これは 無制限です。
pt_br: O tamanho máximo (em número de mensagens) que pode ser especificado para uma fila. Qualquer mensagem que chega além deste ponto será abandonada. O padrão é <literal>-1</literal>, do qual é desvinculado.
zh_cn: 指定队列里消息的最大数目。任何超过这个数量的消息将被忽略。它的缺省值为 <literal>-1</literal>，表示不加限制。

source: Clustered destinations must have this set to <literal>true</literal>.
es_es: Los destinos en clúster deben tener esto configurado como <literal>true</literal>.
fr_fr: Les destinations groupées doivent être configurées à <literal>true</literal> (vrai).
ja_jp: クラスター化した送り先はこれを <literal>true</literal> にセットしている必要があります。
pt_br: Destinações com cluster devem possuir esta configuração para <literal>true</literal>.
zh_cn: 群集的目的地必须把它设置为 <literal>true</literal>。

source: Each queue maintains a message counter.
es_es: Cada cola mantiene un contador de mensajes.
fr_fr: Chaque file d'attente contient un compteur de messages.
ja_jp: 各キュー はメッセージカウンターを維持します。
pt_br: Cada fila mantém um contador de mensagem.
zh_cn: 每个队列都维护一个消息计数器。

source: The statistics for the message counter
es_es: Las estadísticas para un contador de mensajes
fr_fr: Les statistiques pour le compteur de messages
ja_jp: メッセージカウンターの統計
pt_br: As estatísticas para o contador de mensagem.
zh_cn: 消息计数器的统计信息

source: The maximum number of days to hold message counter history for. Overrides any value set on the ServerPeer.
es_es: El número máximo de días que se mantiene el historial contador de mensajes. Sobreescribe cualquier valor establecido en el ServerPeer.
fr_fr: Le nombre maximum de jours que vous souhaitez sauvegarder l'historique de vos messages. Remplace toute valeur configurée sur le ServerPeer.
ja_jp: メッセージカウンター履歴を保管する最大日数です。ServerPeer にセットしてある 値を上書きします。
pt_br: O número máximo de dias para manter a história do contador de mensagem. Isto substitui o valor configurado em ServerPeer.
zh_cn: 消息计数器历史记录保留的最多天数。它将覆盖 ServerPeer 配置里的任何值。

source: The number of consumers currently consuming from the queue.
es_es: El número de consumidores actualmente consumiendo de la cola.
fr_fr: Le nombre de consommateurs en train de consommer à partir d'une file d'attente.
ja_jp: 現在、キュー から消費 している コンシューマの数量。
pt_br: O número de consumidores que estão consumindo a partir da fila.
zh_cn: 目前在队列里消费的消费者的数量。

source: MBean operations of the Queue MBean
es_es: Operaciones MBean de la Queue MBean
fr_fr: Opérations MBean de la file d'attente Queue MBean
ja_jp: Queue MBean の MBean オペレーション
pt_br: Operações MBean da Fila MBean
zh_cn: Queue MBean 的 MBean 操作

source: Remove (and delete) all messages from the queue. <warning><para> Use this with caution. It will permanently delete all messages from the queue </para></warning>.
es_es: Remueve (y borra) todos los mensajes de la cola. <warning><para> Utilice esto con precaución ya que borrará de manera permanente todos los mensajes de la cola</para></warning>.
fr_fr: Enlever (et supprimer) tous les messages de la file d'attente. <warning><para> A utiliser avec précaution. Cela va effacer tous les messages de la file d'attente de façon permanente </para></warning>.
ja_jp: 全てのメッセージをキュー から取り除きます（削除します）。<warning><para> この使用には 注意が必要です。この操作は全てのメッセージを永久的に キュー から削除します。</para></warning>
pt_br: Remove (e deleta) todas as mensagens da fila. <warning><para> Utilize isto com cuidado. Isto deletará permanentemente todas as mensagens da fila. </para></warning>
zh_cn: 从队列里移除（和删除）所有消息。<warning><para>请小心使用这个操作。它将永久删除队列里所有的消息。</para></warning>

source: List all messages currently in the queue
es_es: Lista todos los mensajes actualmente en la cola.
fr_fr: Lister tous les messages actuellement dans la file d'attente
ja_jp: 現在 キュー にある全てのメッセージを一覧表示します。
pt_br: Lista todas as mensagens atualmente na fila.
zh_cn: 列出队列里当前的所有消息

source: There are two overloaded versions of this operation: One takes a JMS selector as an argument, the other does not. By using the selector you can retrieve a subset of the messages in the queue that match the criteria
es_es: Hay dos versiones sobrecargadas de esta operación. Una toma un selector JMS como argumento y la otra no. Utilizando este selector puede recuperar un subgrupo de mensajes en la cola que coinciden con los criterios.
fr_fr: Il existe deux versions surchargées pour cette opération. L'une d'entre elles implique un sélecteur JMS comme argument, et l'autre non. En utilisant le sélecteur, vous pouvez extraire un sous-ensemble de messages d'une file d'attente qui corresponde à ce critère.
ja_jp: このオペレーションには２つのオーバーロードしたバージョンがあります: １つ目は 引数として JMS セクターを使います。もう１つの方はそれを使いません。セクターを 使用すると、基準に一致するキュー 内のメッセージのサブセットを取り込むことができます。
pt_br: Existem duas versões de sobrecarregamento para esta operação: uma usa o seletor JMS como um argumento, e a outra não o faz. Utilizando este seletor, você pode resgatar um sub-conjunto de mensagens da fila que coincide com este critério.
zh_cn: 这个操作有两个重载版本：其中一个以 JMS selector 为参数，另外一个则不以其为参数。通过使用 selector，你可以获取队列里符合标准的消息子集。

source: As listAllMessages but only lists the durable messages
es_es: Como listAllMessages pero sólo lista los mensajes durables
fr_fr: Comme listAllMessages mais ne liste uniquement les messages durables
ja_jp: listAllMessages と同様ですが、継続メッセージのみを一覧表示します。
pt_br: Isto listAllMessages, mas apenas lista as mensagens duráveis.
zh_cn: 和 listAllMessages 一样但它只列出持久性消息

source: As listAllMessages but only lists the non durable messages
es_es: Como listAllMessages pero sólo lista los mensajes no durables
fr_fr: Comme listAllMessages mais ne liste uniquement que les messages durables
ja_jp: listAllMessages と同様ですが、非継続メッセージのみを一覧表示します。
pt_br: Isto listAllMessages, mas apenas as mensagens não-duráveis.
zh_cn: 和 listAllMessages 一样但它只列出非持久性消息

source: Resets the message counter to zero.
es_es: Reestablece el contador de mensajes a cero.
fr_fr: Restaure le compteur de messages à zéro.
ja_jp: メッセージカウンターをゼロにリセットします。
pt_br: Reconfigura o contador de mensagem para zero.
zh_cn: 将消息计数器清零。

source: Resets the message counter history.
es_es: Reestablece el historial del contador de mensajes.
fr_fr: Restaure l'historique du compteur de messages.
ja_jp: メッセージカウンター履歴をリセットします。
pt_br: Reconfigura a história do contador de mensagem.
zh_cn: 将消息计数器历史记录清零。

source: Lists the message counter in an easy to display HTML format
es_es: Lista el contador de mensajes en un formato HTML fácil de presentar.
fr_fr: Liste le compteur de messages dans un format HTML facile à afficher
ja_jp: メッセージカウンターを表示の簡単な HTML 形式で一覧表示します。
pt_br: Lista o contador de mensagem numa maneira fácil de se exibir o formato HTML.
zh_cn: 以 HTML 形式列出消息计数器

source: Lists the message counter history in an easy to display HTML format
es_es: Lista el historial del contador de mensajes en un formato HTML de fácil presentación.
fr_fr: Liste l'historique du compteur de messages dans un format HTML facile à afficher
ja_jp: メッセージカウンター履歴を表示の簡単な HTML 形式で一覧表示します。
pt_br: Lista a história do contador de mensagem numa maneira fácil de se exibir o formato HTML.
zh_cn: 以 HTML 形式列出消息计数器历史记录

source: Configuring topics
es_es: Configuración de temas
fr_fr: Configurer les sujets
ja_jp: トピックの設定
pt_br: Configurando tópicos
zh_cn: 配置主题

source: MBean attributes of the Topic MBean
es_es: Atributos MBean del MBean Topic
fr_fr: Les attributs MBean du sujet Topic MBean
ja_jp: Topic MBean の MBean 属性
pt_br: Os atributos MBean do Tópico MBean
zh_cn: Topic MBean 的 MBean 属性

source: The name of the topic
es_es: El nombre del tema
fr_fr: Le nom du sujet
ja_jp: トピックの名前
pt_br: O nome do tópico.
zh_cn: 状态的名称

source: The JNDI name where the topic is bound
es_es: El nombre JNDI en donde se vincula el tema
fr_fr: Le nom JNDI où le sujet est relié
ja_jp: トピックがバインドされている JNDI 名
pt_br: O nome JNDI onde o tópico é vinculado.
zh_cn: 主题所绑定的 JNDI 名称

source: The DLQ used for this topic. Overrides any value set on the ServerPeer config
es_es: El DLQ utilizado para este tema. Sobreescribe cualquier grupo de valores en la configuración ServerPeer
fr_fr: Le DLQ utilisé pour ce sujet. Remplace toute valeur paramétrée dans la configuration du ServerPeer
ja_jp: このトピック 用に使用する DLQ 。ServerPeer config 上にセットしてある値を上書きします。
pt_br: O DLQ usado para este tópico. Isto substitui qualquer valor configurado na ServerPeer config.
zh_cn: 用于该主题的 DLQ。它将覆盖 ServerPeer 配置里的任何值。

source: The Expiry queue used for this topic. Overrides any value set on the ServerPeer config
es_es: La cola Expiry utilizada para este tema. Sobreescribe cualquier grupo de valores en la configuración ServerPeer
fr_fr: La file d'attente d'expiration (Expiry queue) utilisée pour ce sujet. Remplace toute valeur paramétrée dans la configuration du ServerPeer
ja_jp: この トピック用に使用する Expiry キュー。ServerPeer config 上でセットされている 値を上書きします。
pt_br: A fila Expiry usada para este tópico. Isto substitui qualquer valor configurado na ServerPeer config.
zh_cn: 用于该主题的 Expiry queue。它将覆盖 ServerPeer 配置里的任何值。

source: The redelivery delay to be used for this topic. Overrides any value set on the ServerPeer config
es_es: El retraso en la reentrega a utilizar para este tema. Sobreescribe cualquier grupo de valores en la configuración ServerPeer
fr_fr: Le délai de renvoi utilisé pour ce sujet. Remplace toute valeur paramétrée dans la configuration du ServerPeer.
ja_jp: このトピック用に使用する再配信の遅延。ServerPeer config 上にセットしてある値を 上書きします。
pt_br: O tempo de espera da re-entrega a ser usado por este tópico. Isto substitui qualquer valor configurado numa ServerPeer config.
zh_cn: 用于该主题的重递送延迟。它将覆盖 ServerPeer 配置里的任何值。

source: Returns <literal>true</literal> if the topic was created programmatically
es_es: Retorna <literal>true</literal> si el tema se creó programáticamente
fr_fr: Retourne <literal>true</literal> (vrai) si le sujet a été créé par programme
ja_jp: トピックがプログラムで作成された場合、<literal>true</literal> を返します
pt_br: Retorna para <literal>true</literal> caso o tópico seja criado de maneira programática.
zh_cn: 如果主题在程序里被成功创建，返回 <literal>true</literal>。

source: A maximum size (in number of messages) can be specified for a topic subscription. Any messages that arrive beyond this point will be dropped. The default is <literal>-1</literal> which is unbounded.
es_es: Se puede especificar un tamaño máximo (en número de mensajes) para una subscripción de tema. Cualquier mensaje que llegue después de este punto se borrará. Por defecto es <literal>-1</literal> lo cual significa que no está vinculado.
fr_fr: On peut préciser une taille maximum (en nombre de messages) pour un abonnement de sujet. Tout message qui arrive ensuite sera abandonné. La valeur par défaut est <literal>-1</literal> valeur non bornée.
ja_jp: 最大サイズ（メッセージの数量）をトピックサブスクリプション用に指定することができます。 この数量以上に到着するメッセージは全て破棄されます。デフォルトは <literal>-1</literal> で、 無制限です。
pt_br: O tamanho máximo (em número de mensagens) que pode ser especificado para uma subscrição de tópico. Qualquer mensagem que passar deste ponto será abandonada. O padrão é <literal>-1</literal>, que é vinculado.
zh_cn: 主题订阅里的消息的最大数量。任何超过这个数量的消息将被忽略。缺省值为 <literal>-1</literal>，表示不加限制。

source: Clustered destinations must have this set to <literal>true</literal>
es_es: Los destinos en clústers deben tener esto configurado como <literal>true</literal>
fr_fr: Les destinations groupées doivent être paramétrées <literal>true</literal> (vrai)
ja_jp: クラスター化した送り先はこれを <literal>true</literal> にセットしている必要があります。
pt_br: Destinações com cluster devem possuir esta configuração para <literal>true</literal>.
zh_cn: 群集的目的地将它必须设置为 <literal>true</literal>。

source: Return a list of the message counters for the subscriptions of this topic.
es_es: Retorna una lista de los contadores de mensajes para las subscriciones de este tema.
fr_fr: Retourne une liste des compteurs de messages pour les abonnements de ce sujet.
ja_jp: この トピックのサブスクリプション用のメッセージカウンターの一覧を返します。
pt_br: Retorna uma lista de contadores de mensagem para as subscrições deste tópico.
zh_cn: 返回该主题的订阅的消息计数器列表。

source: Return the total number of messages in all subscriptions of this topic.
es_es: Retorna el número total de mensajes en todas las subscripciones de este tema.
fr_fr: Retourne le nombre total de messages contenus dans tous les abonnements de ce sujet.
ja_jp: この トピックの全てのサブスクリプション内のメッセージの合計数を返します。
pt_br: Retorna o número total de mensagens em todas subscrições deste tópico.
zh_cn: 返回该主题的订阅的所有消息的个数。

source: Return the total number of durable messages in all subscriptions of this topic.
es_es: Retorna el número total de mensajes durables en todas las subscripciones de este tema.
fr_fr: Retourne le nombre total de messages durables pour tous les abonnements de ce sujet.
ja_jp: この トピックの全てのサブスクリプション内の継続メッセージの合計数を返します。
pt_br: Retorna o número total de mensagens duráveis em todas as subscrições deste tópico.
zh_cn: 返回该主题的订阅的所有持久性消息的个数。
