Repository: bobmcwhirter/jboss-messaging
Catalog: docs/EAP_4_3/JBoss_Messaging_User_Guide/*/Configuration.po
Languages: es_es, fr_fr, ja_jp, pt_br, zh_cn

source: For instance you could deploy one connection factory that creates connections that use the HTTP transport to communicate to the server and another that creates connections that use the bisocket transport to communicate.
es_es: Por ejemplo puede desplegar una fábrica de conexiones que crea conexiones que utilizan transporte HTTP para comunicarse con el servidor y otra que crea las conexiones que utilizan un transporte bisocket para comunicar.
fr_fr: Par exemple, vous pourriez déployer une usine de connexion qui crée des connexions utilisant pour transport HTTP en vue de communiquer avec le serveur et une autre usine de connexion qui crée des connexions en utilisant pour transport bisocket pour communiquer.
ja_jp: 例えば、HTTP トランスポートを使用してサーバーに通信する接続を作成したり、 bisocket トランスポートを使用して通信する接続を作成したりする１つの接続 ファクトリをデプロイすることができます。
pt_br: Por exemplo: você poderia implementar uma criação de conexão que cria conexões, das quais utilizam o transporte HTTP para comunicar-se ao servidor, e outras que criam conexões das quais usam o transporte bisocket (classe criada para uso em caso do cliente estar atrás do firewall, mas o servidor não. Devido a isto, o segundo ServerSocket usará um portal qualquer) para comunicação.
zh_cn: 例如，你部署的连接工厂可以创建使用 HTTP 传输在服务器和客户端间通信的连接、也可以创建使用双向套接字传输通信的连接。

source: Configuring the remoting connector
es_es: Configuración del conector remoto
fr_fr: Configurer le connecteur d'appel à distance
ja_jp: remoting コネクターの設定
pt_br: Configurando o conector remoto
zh_cn: 配置远程连接器

source: JBoss Messaging uses JBoss Remoting for all client to server communication. For full details of what JBoss Remoting is capable of and how it is configured please consult the JBoss Remoting documentation.
es_es: JBoss Messaging utiliza JBoss Remoting para todas las comunicaciones cliente a servidor. Puede encontrar los detalles de las capacidades de JBoss Remoting y la manera de configurarlo en la documentación de JBoss Remoting.
fr_fr: JBoss Messaging utilise JBoss Remoting pour la communication serveur pour tous les clients. Pour davantage d'informations sur ce dont JBoss Remoting est capable de faire, et comment il est configuré, consulter la documentation JBoss Remoting.
ja_jp: JBoss Messaging は全てのクライアント対サーバーの通信に JBoss Remoting を使用します。 JBoss Remoting が持つ能力とその設定方法についての詳細は JBoss Remoting ドキュメントで 確認して下さい。
pt_br: O JBoss Messaging usa o JBoss Remoting para que todos os clientes se comuniquem ao servidor. Para maiores detalhes a respeito das capacidades do JBoss Remoting e como isto é configurado, por favor consulte a documentação do JBoss Remoting.
zh_cn: 对于所有的客户端和服务器之间的通信，JBoss Messaging 都使用 JBoss Remoting。关于 JBoss Remoting 的功能和配置，请参考 JBoss Remoting 文档。

source: The default configuration includes a single remoting connector which is used by the single default connection factory. Each connection factory can be configured to use its own connector.
es_es: La configuración predeterminada incluye un sólo conector remoto, el cual lo utiliza la fábrica de conexiones predeterminada. Cada fábrica de conexiones se puede configurar para que utilice su propio conector.
fr_fr: La configuration par défaut inclut un seul connecteur d'appel à distance, qui est utilisé par l'unique usine de connexion par défaut. Chaque usine de connexion peut être configurée pour utiliser son propre connecteur.
ja_jp: そのデフォルト設定には、単独デフォルト接続ファクトリで使用される単独 remoting connector が 含まれています。各接続ファクトリはそれ自身の connector を使うように設定できます。
pt_br: A configuração padrão inclui um único conector remoto, do qual é usado pela única criação da conexão padrão. Cada criação de conexão pode ser configurada para uso do próprio conector.
zh_cn: 缺省的配置包括单一的远程连接器，它被单一的缺省连接工厂使用。你可以配置每个连接工厂都使用自己的连接器。

source: The default connector is configured to use the remoting bisocket transport. The bisocket transport is a TCP socket based transport which only listens and accepts connections on the server side. I.e. connections are always initiated from the client side. This means it works well in typical firewall scenarios where only inbound connections are allowed on the server. Or where onlu outbound connections are allowed from the client.
es_es: El conector predeterminado se configura para que utilice el transporte bisocket remoto. El transporte bisocket es un transporte con base en un socket TCP, el cual sólo escucha y acepta conexiones del lado del servidor. Por ejemplo, las conexiones siempre se inician del lado del cliente. Esto significa que funciona bien en un escenario de cortafuergos típico en donde se permiten las conexiones entrantes en el servidor o en donde sólo se permiten las conexiones salientes del cliente.
fr_fr: Le connecteur par défaut est configuré pour utiliser le transport distant bisocket. Le transport bisocket est un transport basé-logicel connecteur TCP, qui n'écoute et n'accepte les connexions que côté-serveur, c'est à dire que les connexions sont toujours initiées côté-client. Ainsi ce système fonctionne bien dans les scénarios de pare-feu habituels, où seules les connexions entrantes sont autorisées sur le serveur ou bien lorsque seules les connexions sortantes sont autorisées par le client.
ja_jp: デフォルトの connector は remoting bisocket トランスポートを使用するように 設定されています。bisocket トランスポートは TCP ソケットベースのトランスポートであり、 サーバー側にある接続のみをリッスンして受理します。この接続は常にクライアント側から 始まっているものです。このことは、サーバー上で着信の接続だけが許可される典型的な ファイアウォールシナリオで良く機能すると言う意味になります。あるいは、 クライアントからの発信接続のみが許可されるところとなります。
pt_br: O conector padrão é configurado para uso do transporte bisocket remoto. O transporte bisocket é um transporte baseado no soquete TCP, do qual apenas escuta e aceita conexões no lado do servidor. Por exemplo: as conexões são sempre iniciadas no lado do cliente. Isto significa que isto funciona bem em cenários de firewall típicos, onde apenas conexões de entrada são permitidas ao lado do servidor. Ou, ainda, onde apenas conexões de saída são permitidas a partir do lado do servidor.
zh_cn: 缺省的连接器使用远程双向套接字传输（bisocket transport）。双向套接字传输基于 TCP 套接字，它只在服务器端侦听和接受连接。也就是说，连接总是从客户端发起。这意味着它适合于典型的防火墙环境里，因为此时只允许服务器上的转入连接。或者说只允许客户端的转出连接。

source: The bisocket transport can be configured to use SSL where a higher level of security is required.
es_es: El transporte bisocket se puede configurar para poder utilizar SSL en donde se requiera un mayor nivel de seguridad.
fr_fr: Le transport bisocket peut être configuré pour utiliser SSL pour des conditions nécessitant un haut niveau de sécurité.
ja_jp: bisocket トランスポートは、より高度なセキュリティが要求されるところに SSL を使用するように設定できます。
pt_br: O transporte bisocket pode ser configurado para uso do SSL, onde um alto nível de segurança é solicitado.
zh_cn: 如果需要更高级别的安全性，我们可以配置双向套接字传输使用 SSL。

source: The other supported transport is the HTTP transport. This uses the HTTP protocol to communicate between client and server. Data is received on the client by the client periodically polling the server for messages. This transport is well suited to situations where there is a firewall between client and server which only allows incoming HTTP traffic on the server. Please note this transport will not be as performant as the bisocket transport due to the nature of polling and the HTTP protocl. Also please note it is not designed for high load situations.
es_es: El otro transporte soportado es el transporte HTTP. Este utiliza el protocolo HTTP para la comunicación entre cliente y servidor. Los datos se reciben en el cliente y el cliente sondea periódicamente el servidor en busca de mensajes. Este transporte es bien apropiado para situaciones en donde hay un cortafuegos entre el cliente y el servidor, lo cual sólo permite tráfico HTTP de entrada en el servidor. Observe que este transporte no tiene tanto rendimiento como el transporte bisocket debido a la naturaleza del sondeo y al protocolo HTTP. También observe que no está diseñado para situaciones con bastante carga.
fr_fr: L'autre transport pris en charge est le transport HTTP qui utilise le protocole HTTP pour communiquer entre le client et le serveur. Les données sont reçues périodiquement par le client, qui invite le serveur à émettre les messages. Ce transport est bien adapté aux situations où il existe un pare-feu entre le client et le serveur, qui n'autorise que le traffic HTTP qui arrive vers le serveur. Veuillez noter que ce transport ne sera pas aussi performant que le transport bisocket en raison de la nature de l'émission et du protocole HTTP. Aussi veillez noter qu'il n'est pas conçu pour les situations impliquant de hauts volumes de travail.
ja_jp: 他のサポートのあるトランスポートとしては、HTTP トランスポートがあります。 これは HTTP プロトコルを使用してクライアントとサーバー間の通信をします。 データは、クライアントがメッセージ用に定期的にサーバーをポーリングすることで クライアント側に受信されます。このトランスポートは、サーバー上で着信 HTTP トラフィックのみを 許可するファイアウォールがクライアントとサーバー間にある状況に良く適しています。ポーリングと HTTP プロトコルの性格のため、このトランスポートは bisocket トランスポートほどパフォーマンスが 良くないことに注意して下さい。そしてこれは高負荷状態用に設計されていないことにも注意して 下さい。
pt_br: O outro transporte suportado é o transporte HTTP. Ele usa o protocolo HTTP para comunicação entre o cliente e o servidor. Os dados são recebidos pelo cliente pela pesquisa periódica de mensagens pelo cliente no servidor. Este transporte é bem adaptado em situações onde há firewall entre cliente e servidor, do qual apenas permite o tráfico HTTP de chegada no servidor. Perceba que o desempenho deste transporte não é tão bom com o transporte bisocket, devido a sua natureza de pesquisa periódica e o protocolo HTTP.
zh_cn: 另外一种被支持的传输协是 HTTP 传输。它使用 HTTP 协议在服务器和客户端之间通信。客户端通过定期地轮询服务器来接收数据。这种传输特别适合于在客户端和服务器之间存在防火墙的情况，此时只允许服务器上的转入 HTTP 通信。请注意，这种传输不具有和双向传输相同的性能，这是由于轮询的性质以及 HTTP 协议的采用。也请注意它不是为高负载环境设计的。

source: No other remoting transports are currently supported by JBoss Messaging
es_es: JBoss Messaging no soporta actualmente ningún otro transporte remoto
fr_fr: Aucun autres transports distants sont actuellement pris en charge par JBoss Messaging.
ja_jp: 現在、他の remoting トランスポートは JBoss Messaging でサポートが ありません。
pt_br: Outros transportes remotos não estão atualmente suportados pelo JBoss Messaging.
zh_cn: JBoss Messaging 目前不支持其他远程传输模式。

source: You can look at remoting configuration under:
es_es: Puede ver la configuración del servicio remoto bajo:
fr_fr: Vous pouvez observer la configuration pour les appels à distance sous:
ja_jp: 以下のパスの下で remoting 設定を見ることができます:
pt_br: Você pode observar a configuração remota abaixo:
zh_cn: 你可以在这里查看远程配置：

source: Here is an example bisocket remoting configuration:
es_es: Este es un ejemplo de una configuración del remoto bisocket:
fr_fr: Voici un exemple de configuration bisocket pour appels à distance:
ja_jp: bisocket remoting 設定の例を以下に示します:
pt_br: Segue abaixo, um exemplo da configuração remota bisocket:
zh_cn: 下面是一个关于双向远程传输的配置示例：

source: Please note that some of the attributes should not be changed unless you know exactly what you are doing. We will discuss the attributes that you may have a good reason to change:
es_es: Observe que algunos de los atributos no se deben cambiar a menos de que sepa exactamente lo que está haciendo. Vamos a discutir los atributos para los que posiblemente tendrá una buena razón para cambiarlos:
fr_fr: Veillez noter que certains des attributs ne devraient pas être modifiés à moins que vous sachiez exactement ce que vous êtes en train de faire. Nous discuterons les attributs que vous pourriez avoir une bonne raison de changer:
ja_jp: 一部の属性は、自分の操作を十分に理解していない限りは変更すべきものでは ありません。以下に適切な理由で変更できる属性を説明していきます:
pt_br: Perceba que alguns deste atributo não deveriam ser alterados a não ser que você saiba exatamente o que você está fazendo. Iremos descrever os atributos que você poderá ter um bom motivo para modificá-los:
zh_cn: 请注意，除非你有明确的目的，否则不要修改其中一些属性。我们将讨论你可能需要修改的属性：

source: clientLeasePeriod - Clients periodically send heartbeats to the server to tell the server they are still alive. If the server does not receive a heartbeat after a certain time it will close down the connection and remove all resources on the server corresponding to the client's session. The clientLeasePeriod determines the period of heartbeats. The server will (by default) close a client if it does not receive a heartbeat in 2 * clientLeasePeriod ms. The actual factor gets automatically resized according to system load. The value is in milliseconds. The defaut value is 10000 ms.
es_es: clientLeasePeriod - Los clientes envían periódicamente heartbeats al servidor para decirle al servidor que aún se encuentran vivos. Si el servidor no recibe un heartbeat después de cierto tiempo entonces cerrará la conexión y removerá todos los recursos en el servidor correspondiente a la sesión del cliente. El clientLeasePeriod determina el periodo de heartbeats. El servidor cerrará (por defecto) un cliente si no recibe un heartbeat en 2 * clientLeasePeriod ms. El factor real se modifica automáticamente de tamaño de acuerdo con la carga del sistema. El valor es en milisegundos. El valor predeterminado es 10000 ms.
fr_fr: clientLeasePeriod - Les clients envoient périodiquement des pulsations (heartbeats) vers le serveur pour lui signifier qu'ils sont toujours vivants. Si le serveur ne reçoit pas de pulsations après un certain temps, il va fermer la connexion et il va retirer toutes les ressources du serveur qui correspondent à la session client. La clientLeasePeriod détermine la période de pulsations. Le serveur fermera (par défaut) un client s'il ne reçoit pas de pulsation dans les 2 * clientLeasePeriod ms. Le facteur est ajusté automatiquement suivant les charges de travail. La valeur est en millesecondes. La valeur par défaut est de 10000 ms.
ja_jp: clientLeasePeriod - クライアントは定期的にハートビートをサーバーに送信して、 クライアントが生存していることをサーバーに伝えます。サーバーが一定期間後に このハートビートを受信しない場合、サーバーは接続を閉じてそのクライアント セッションに対応する全てのサーバー上のリソースを削除します。clientLeasePeriod は ハートビートの期間を決定します。デフォルトでサーバーは、clientLeasePeriod ミリ秒の ２倍の時間内にハートビートを受信しないとクライアントを閉じます。実際の要素はシステム負荷に 応じて自動的にサイズ変更されます。その値はミリ秒で示し、デフォルトは 10000 ミリ秒です。
pt_br: clientLeasePeriod - Os clientes freqüentemente enviam heartbeat ao servidor para informá-los que eles estão ativos. Caso o servidor não receba um heartbeat após um certo período, ele encerrará a conexão e removerá todos os recursos no servidor correspondentes à sessão do cliente. O clientLeasePeriod determina o período de heartbeats. Por padrão, o servidor irá encerrar um cliente, caso ele não receba um heartbeat em 2 * clientLeasePeriod ms. O fator atual é automaticamente redimensionado de acordo com o carregamento do sistema. O valor é em milésimos de segundos. O valor padrão é 10000 ms.
zh_cn: clientLeasePeriod - 客户端定期地往服务器发送 heartbeat 来告知它处于活动状态。如果服务器在一段时间后没有接收到 heartbeat，那么它将关掉连接并删除这个会话对应的所有服务器上的资源。clientLeasePeriod 决定了发送 heartbeat 的间隔。如果服务器在 2 * clientLeasePeriod 毫秒后还没有收到 heartbeat 信息，它缺省将关闭这个客户连接。实际的因子会根据系统负载自动进行调节。这个值以毫秒为单位。它的缺省值是 10000 毫秒。

source: numberOfRetries - This effectively corresponds to the number of seconds JBoss Remoting will block on the client connection pool waiting for a connection to become free. If you have a very large number of sessions concurrently accessing the server from a client and you are experiencing issues due to not being able to obtain connections from the pool, you may want to consider increasing this value.
es_es: numberOfRetries - Esto corresponde efectivamente al número de segundos que JBoss Remoting bloqueará en el pool de conexiones del cliente en espera de una conexión libre. Si tiene un número grande de sesiones accediendo a mismo tiempo al servidor desde un cliente y tiene problemas ya que no puede obtener conexiones desde el pool, debería considerar el incrementar este valor.
fr_fr: numberOfRetries - Cette valeur correspond au nombre de secondes que JBoss Remoting va bloquer sur la réserve de connexions du client en attendant que la connexion ne se libère. Si vous possédez un grand nombre de sessions entrain d'accéder au serveur simultanément en provenance d'un client et que vous expérimentez des problèmes liés à vos difficultés d'obtention de connexions de la réserve, vous devez sans doute considérer augmenter cette valeur.
ja_jp: numberOfRetries - これは実質的に JBoss Remoting が、接続が開放されるのを待っている クライアント接続プールをブロックする秒数に相当します。クライアントからサーバーに 同時にアクセスしている多数のセッションがあって、そのプールから接続を取得できない 為に問題に遭遇している場合は、この値の増大を考慮する方が良いでしょう。
pt_br: numberOfRetries - Isto corresponde efetivamente ao número de segundos que o JBoss Remoting bloqueará um pool de conexão de cliente, esperando que uma conexão esteja livre. Caso você possua um número grande de sessões acessando o servidor a partir do cliente e você estiver experimentando problemas, não estando apto a obter conexões a partir do pool, você provavelmente desejará aumentar este valor.
zh_cn: numberOfRetries - 它对应 JBoss Remoting 在等待客户连接池有空闲的连接时阻塞的时间（秒）。如果有数目众多的会话并行地访问服务器，且你遇到不能从连接池获得连接的问题，那么你就可以考虑增大这个值。

source: clientMaxPoolSize - JBoss Remoting maintains a client side pool of TCP connections on which to service requests. If you have a very large number of sessions concurrently accessing the server from a client and you are experiencing issues due to not being able to obtain connections from the pool in a timely manner, you may want to consider increasing this value.
es_es: clientMaxPoolSize - JBoss Remoting mantiene un pool del lado del cliente de conexiones TCP en las cuales prestar servicios a las peticiones. Si tiene un número grande de sesiones simultáneas accediendo el servidor desde un cliente y está experimentando problemas ya que no puede obtener conexiones desde el pool de una manera pronta, considere el incrementar este valor.
fr_fr: clientMaxPoolSize - JBoss Remoting entretient une réserve côté-client de connexions TCP sur lesquelles servir les demandes des clients. Si vous possédez un grand nombre de sessions entrain d'accéder au serveur simultanément en provenance d'un client et que vous expérimentez des problèmes liés à vos difficultés d'obtention de connexions de la réserve, vous devez sans doute considérer augmenter cette valeur.
ja_jp: clientMaxPoolSize - JBoss Remoting は、要求に対しサービスする為の TCP 接続の クライアント側プールを維持します。クライアントからサーバーへ同時にアクセスしている 多数のセッションがあり、このプールから素早く接続を取得できない為に問題に遭遇している 場合は、この値の増大を考慮する方が良いでしょう。
pt_br: clientMaxPoolSize - O JBoss Remoting mantém o pool ao lado do cliente de conexões TCP pelas quais atendem as solicitações. Caso você possua um número muito grande de sessões acessando, no momento, o servidor a partir de um cliente e você não estiver apto a obter conexões a partir do pool no período desejado, você poderá considerar o aumento deste valor.
zh_cn: clientMaxPoolSize - JBoss Remoting 维护一个客户端的对应服务请求的 TCP 连接池。如果有数目众多的会话并行地访问服务器，且你遇到不能及时地从连接池获得连接的问题，那么你就可以考虑增大这个值。

source: secondaryBindPort - The bisocket transport uses control connections to pass control messages between server and client. If you want to work behind a firewall you may want to specify a particular value for this according to your firewall configuration. This is the address the secondary ServerSocket binds to
es_es: secondaryBindPort - El transporte bisocket utiliza conexiones de control para pasar mensajes de control entre el servidor y el cliente. Si quiere trabajar por detrás de un cortafuegos puede que quiera especificar un valor en particular para esto de acuerdo a la configuración de su cortafuegos. Esta es la dirección a la que se vincula el ServerSocket secundario
fr_fr: secondaryBindPort - Le transport bisocket utilise des connexions de contrôle pour passer des messages de contrôle entre le serveur et le client. Si vous souhaitez travailler derrière un pare-feu, vous souhaitez peut-être préciser une valeur particulière en fonction de la configuration de votre pare-feu. Il s'agit de l'adresse secondaire à laquelle ServerSocket est relié.
ja_jp: secondaryBindPort - bisocket トランスポートは control connection を使用して サーバーとクライアント間で制御メッセージを渡します。ファイアウォールの背後で 作業したい場合は、使用するファイアウォール設定に応じてこの為に特定の値を 指定すれば良いでしょう。これが、２つめの ServerSocket がバインドする アドレスです。
pt_br: secondaryBindPort - O transporte bisocket usa as conexões de controle para passar mensagens entre o servidor e o cliente. Caso você queira trabalhar por trás de um firewall, você deverá especificar um valor particular para isto, de acordo com a sua configuração firewall. Este é o endereço que o ServerSocket secundário irá vincular-se.
zh_cn: secondaryBindPort - 双向传输使用控制连接（control connection）在服务器和客户端之间传递控制消息。如果你想在防火墙后工作，你可能需要按照防火墙配置为这个连接指定特殊的值。它是第二个 ServerSocket 所绑定的地址。

source: secondaryConnectPort - This is the port the client uses to connect. You may want to specify this to allow clients to work with NAT routers.
es_es: secondaryConnectPort - Este es el puerto que el cliente utiliza para conectarse. Puede especificar esto para permitirle a los clientes trabajar con routers NAT.
fr_fr: secondaryConnectPort - Il s'agit du port que le client utilise pour se connecter. Vous souhaitez peut-être l'indiquer pour permettre aux clients de travailler avec les routeurs NAT.
ja_jp: secondaryConnectPort - これはクライアントが接続の為に使用するポートです。 クライアントが NAT ルーターを利用して機能できるようにこれを指定すると 良いでしょう。
pt_br: secondaryConnectPort - Este é o portal que o cliente usa para conexão. Você talvez queira especificar isto para permitir que clientes trabalhem com os roteamentos NAT.
zh_cn: secondaryConnectPort - 这是客户端用户连接的端口。你可能希望指定它来允许客户使用 NAT 路由器。

source: maxPoolSize - This is the number of threads used on the server side to service requests.
es_es: maxPoolSize - Este es el número de hilos utilizados en el lado del servidor para atender peticiones.
fr_fr: maxPoolSize - I s'agit du nombre de threads utilisés côté-serveur pour répondre aux demandes.
ja_jp: maxPoolSize - これは、要求に対応するためにサーバー上で使用するスレッドの数量です。
pt_br: maxPoolSize - Este é o número de segmentos usados no lado do servidor para solicitações de serviços.
zh_cn: maxPoolSize - 这是服务器端用于处理请求的线程数量。

source: By default JBoss Messaging binds to ${jboss.bind.address} which can be defined by: ./run.sh -c &lt;yourconfig&gt; -b yourIP.
es_es: Por defecto JBoss Messaging se vincula a ${jboss.bind.address} el cual puede ser definido por: ./run.sh -c &lt;yourconfig&gt; -b yourIP.
fr_fr: Par défaut, JBoss Messaging est relié à ${jboss.bind.address} qui peut être défini par: ./run.sh -c &lt;yourconfig&gt; -b yourIP.
ja_jp: JBoss Messaging はデフォルトで ./run.sh -c &lt;yourconfig&gt; -b yourIP に よって定義できる ${jboss.bind.address} にバインドします。
pt_br: Por padrão, o JBoss Messaging efetua o binding em ${jboss.bind.address}, que pode ser definido pelo: ./run.sh -c &lt;yourconfig&gt; -b yourIP.
zh_cn: 在缺省情况下，JBoss Messaging 绑定到 ${jboss.bind.address}，它可用 ./run.sh -c &lt;yourconfig&gt; -b yourIP 进行定义。

source: You can change remoting-bisocket-service.xml if you want for example use a different communication port.
es_es: Puede cambiar remoting-bisocket-service.xml si por ejemplo quiere utilizar un puerto de comunicación diferente.
fr_fr: Vous pouvez changer remoting-bisocket-service.xml si vous souhaiter utiliser un port de communication différent par exemple.
ja_jp: 例えば異なる通信ポートを使用したい場合、remoting-bisocket-service.xml を 変更することができます。
pt_br: Você pode modificar o remoting-bisocket-service.xml, caso você queira, por exemplo, usar um portal de comunicação diferente.
zh_cn: 如果你想使用不同的通信端口，你可以修改 remoting-bisocket-service.xml。
