Repository: bobmcwhirter/jboss-messaging
Catalog: docs/EAP_4_3/JBoss_Messaging_User_Guide/*/Configuration.po
Languages: es_es, fr_fr, ja_jp, pt_br, zh_cn

source: There is rarely a good reason to change values in the the bisocket or sslbisocket connector configuration apart from clientLeasePeriod, clientMaxPoolSize, maxRetries, numberOfRetries, secondaryBindPort or secondaryConnectPort. Changing them can cause JBoss Messaging to stop functioning correctly.
es_es: Muy pocas veces hay una buena razón para cambiar los valores en el bisocket o en la configuración del conector sslbisocket aparte de clientLeasePeriod, clientMaxPoolSize, maxRetries, numberOfRetries, secondaryBindPort o secondaryConnectPort. El cambiarlos puede causar que JBoss Messaging pare de funcionar correctamente.
fr_fr: Il y a rarement une bonne raison de changer les valeurs dans la configuration des connecteurs bisocket ou sslbisocket à part clientLeasePeriod, clientMaxPoolSize, maxRetries, numberOfRetries, secondaryBindPort or secondaryConnectPort. Les changer peut causer JBoss Messaging de cesser de fonctionner correctement.
ja_jp: 上述の clientLeasePeriod、clientMaxPoolSize、maxRetries、 numberOfRetries、secondaryBindPort、 secondaryConnectPort 以外では、bisocket 又は、sslbisocket コネクター設定で値を変更するのに適切な理由は ほとんどありません。それらの値を変更すると JBoss Messaging が正常に機能することを 停止する原因になる可能性があります。
pt_br: É muito difícil encontrar um bom motivo para modificar os valores no bisocket ou na configuração do conector sslbisocket, sem dizer o clientLeasePeriod, clientMaxPoolSize, maxRetries, numberOfRetries, secondaryBindPort ousecondaryConnectPort. A modificação dos mesmos pode causar o interrompimento do funcionamento correto do JBoss Messaging.
zh_cn: 除了 clientLeasePeriod、clientMaxPoolSize、maxRetries、numberOfRetries、secondaryBindPort 和 secondaryConnectPort 以外，我们通常不需修改 bisocket 或 sslbisocket 连接器配置里的其他值。修改这些值可能导致 JBoss Messaging 不能正常运行。

source: If you are using the JBoss AS ServiceBindingManager to provide different servers with different port ranges, then you must make sure that the JBoss Messaging remoting configuration specified in the JBoss Messaging section of the ServiceBindingManager xml file exactly matches that in remoting-bisocket-service.xml.
es_es: Si está utilizando el JBoss AS ServiceBindingManager para brindar diferentes servidores con diferentes rangos de puerto entonces debe asegurarse de que la configuración de JBoss Messaging remoting se especifica en la sección JBoss Messaging del archivo ServiceBindingManager xml coincide exactamente con el que se encuentra en remoting-bisocket-service.xml.
fr_fr: Si vous utilisez JBoss AS ServiceBindingManager pour fournir différents serveurs avec des intervals portuaires différents, alors vous devez veiller à ce que la configuration distante JBoss Messaging spécifiée dans la section JBoss Messaging du fichier ServiceBindingManager xml. corresponde exactement celle de remoting-bisocket-service.xml.
ja_jp: JBoss AS ServiceBindingManager を使用して異なるポート範囲を利用する異なる サーバーを提供する場合は、ServiceBindingManager xml ファイル内の JBoss Messaging セクションに指定してある JBoss Messaging remoting 設定が remoting-bisocket-service.xml の設定にぴったりと一致することを確認しなければなりません。
pt_br: Caso você esteja usando o JBoss AS ServiceBindingManager para o fornecimento de servidores diferentes com intervalos de portais diferentes, então você deve ter certeza absoluta que a especificada configuração remota do JBoss Messaging, na seção do JBoss Messaging do arquivo xml ServiceBindingManager, é compatível ao remoting-bisocket-service.xml.
zh_cn: 如果你要使用 JBoss AS ServiceBindingManager 来提供带有不同端口范围俄的不同服务器，你必须确保 ServiceBindingManager xml 文件里的 JBoss Messaging 部分里的 JBoss Messaging 远程配置完全符合 remoting-bisocket-service.xml 里的配置。

source: If you are using a newer version of JBM in an older version of JBAS then the example bindings in the AS distribution may well be out of date. It is therefore imperative that the relevant sections are overwritten with the remoting configuration from the JBM distribution.
es_es: Si está utilizando una versión más reciente de JBM en una versión más antigua de JBAS entonces el ejemplo de las vinculaciones en la distribución AS puede que esté desactualizada. Por lo tanto es imperativo que las secciones relevantes se sobreescriban con la configuración remoting de la distribución JBM.
fr_fr: Si vous utilisez une nouvelle version de JBM dans une ancienne version de JBAS, alors les exemples de mises en liaison de la distribution AS sont certainement obsolètes. Il est donc impératif que les sections concernées soient remplacées par la configuration distante de JBM distribution.
ja_jp: JBAS の旧バージョン内で JBM のより新しいバージョンを使用している場合、 AS ディストリビューション内のサンプルのバインディングはたぶん時代遅れに なっている可能性があります。その為、該当するセクションは JBM ディストリビューションからの remoting 設定で書き換えることが必須となります。
pt_br: Caso você esteja usando a versão mais nova do JBM numa versão antiga do JBAS, o exemplo bindings na distribuição AS poderá estar desatualizado. Isto é, então, imperativo que as seções relevantes sejam substituídas com a configuração remota, a partir da distribuição JBM.
zh_cn: 如果你在较旧版本的 JBAS 里使用更新版本的 JBM，那么 AS 发行版本里的例子可能是过期的。因此相关部分急需用 JBM 发行版本里的远程配置进行覆盖。

source: JBoss Messaging provides a message counter history which shows the number of messages arriving on each queue of a certain number of days. This attribute represents the maxiumum number of days for which to store message counter history. It can be overridden on a per destination basis.
fr_fr: JBoss Messaging propose un historique de comptage des messages qui montre le nombre de messages qui arrivent sur chaque file d'attente après un certain nombre de jours. Cet attribut représente le nombre maximum de jours pris en considération par l'historique du comptage des messages. Cet attribut peut être remplacé sur la base de la destination.

source: This operation returns <literal>true</literal> if the queue was successfull undeployed. otherwise it returns <literal>false</literal>.
fr_fr: Cette opération retourne <literal>true</literal> (vrai) si la queue a été déployée avec succès, sinon cette opération retourne <literal>false</literal> (faux).
