Repository: bobmcwhirter/jboss-messaging
Catalog: docs/EAP_4_3/JBoss_Messaging_User_Guide/*/Configuration.po
Languages: es_es, fr_fr, ja_jp, pt_br, zh_cn

source: This parameter specifies the window size for consumer flow control. The window size determines the number of messages a server can send to a consumer without blocking. Each consumer maintains a buffer of messages from which it consumes. Please note that TCP also implements its own flow control, so if you set this to too large a number, then the TCP window size may be hit before the <literal>prefetchSize</literal>, which can cause writes to block.
es_es: Este parámetro especifica el tamaño de la ventana para el control de flujo del consumidor. El tamaño de la ventana determina el número de mensajes que un servidor puede enviar a un consumidor sin bloquearse. Cada consumidor mantiene un buffer de mensajes desde donde consume. Observe que TCP también implementa su propio control de flujo así que si configura esto con un número muy grande entonces el tamaño de la ventana TCP se puede llenar antes del <literal>prefetchSize</literal>, lo cual puede causar que se bloqueen las escrituras.
fr_fr: Ce paramètre précise la taille de la fenêtre pour le contrôle du flux du consommateur. La taille de la fenêtre détermine le nombre de messages qu'un serveur peut envoyer à un consommateur sans blocage. Chaque consommateur garde une zone tampon de messages comme base de leur consommation. Veuillez noter que TCP implémente également son propre contrôle de flux, et si vous le configurer par un grand nombre, alors la taille de la fenêtre TCP pourrait être modifiée avant <literal>prefetchSize</literal>, ce qui peut entraîner le blocage de 'write'.
ja_jp: このパラメータは コンシューマ フロー制御のウィンドウサイズを指定します。この ウィンドウサイズはサーバーがブロッキングなしにコンシューマ に送信することの できるメッセージの数量を決定します。各コンシューマ は自身が消費する メッセージのバッファを維持します。TCP もそれ自身のフロー制御を実装するため、 ユーザーがこのパラメータを過大にセットすると TCP ウィンドウサイズは、 <literal>prefetchSize</literal> 以前に到達する可能性があることに注意して 下さい。これはブロックするような書き込みの原因になります。
pt_br: Este parâmetro especifica o tamanho da janela para o controle de fluxo do consumidor. O tamanho da janela determina o número de mensagens que um servidor pode enviar a um consumidor sem o bloqueamento. Cada consumidor mantém um buffer de mensagens do qual ele consume. Perceba que o TCP também implementa o próprio controle de fluxo, de maneira que você configura isto a um número muito grande, e então o tamanho da janela TCP poderá ser atingida antes do <literal>prefetchSize</literal>, do qual pode causar gravações para o bloqueamento.
zh_cn: 这个参数为消费者（Consumer）流控制指定窗口大小。这个窗口大小决定服务器可以发送到某个消费者而不阻塞的消息数量。每个消费者都维护一个它从中消费的消息缓冲。请注意，TCP 也实现自己的流控制，所以如果你把它设置为过大的值，TCP 窗口大小限制可能在 <literal>prefetchSize</literal> 之前就被突破，这样会导致写阻塞。

source: If you have very slow consumers, then you probably want to make sure they don't buffer any messages since this can prevent them from being consumed by faster consumers. Setting this to true is equivalent to setting <literal>PrefetchSize</literal> to 1.
es_es: Si tiene consumidores muy despaciosos entonces probablemente quiera asegurarse de que no pongan en buffer ningun mensaje ya que esto puede prevenir que sean consumidos por consumidores más rápidos. El configurar esto como verdadero es equivalente a establecer <literal>PrefetchSize</literal> como 1
fr_fr: Si vous avez des consommateurs lents, alors vous voudrez probablement vous assurer qu'ils ne tamponnent aucun message car cela les empêcherait d'être consommés par des consommateurs plus rapides. En le paramétrant à 'true' (vrai) équivaut à paramétrer <literal>PrefetchSize</literal> à 1.
ja_jp: 非常に遅い コンシューマ がある場合は、それがメッセージのいずれをもバッファしないことを 確実にするべきです。バッファするとメッセージがより速い コンシューマ によって消費 されることを阻止してしまいます。これを「true」にセットすると、<literal>PrefetchSize</literal> を 「1」にセットすることと同じになります。
pt_br: Caso você possua consumidores bastante demorados, você poderá ter certeza de que eles não irão realizar o buffer em qualquer mensagem, uma vez isto poderá prevení-los de serem consumidos por consumidores mais rápidos. A configuração disto para verdadeiro é equivalente à configuração do <literal>PrefetchSize</literal> para 1.
zh_cn: 如果存在非常慢的消费者，你可能希望它们不缓冲任何消息，因为这会阻止这些消息被更快的消费者所消费。把它设置为 true 和设置 <literal>PrefetchSize</literal> 为 1 是相等的。

source: Set this to true if you want strict JMS behaviour as required by the TCK.
es_es: Configure esto como verdadero si quiere un comportamiento JMS estricto tal como lo requiere el TCK.
fr_fr: Paramétrer à 'true' (vrai) si vous souhaitez un comportement JMS strict, selon les critères TCK.
ja_jp: TCK からの要求に応じて JMS の動作を規制したい場合は、これを「true」にセットします。
pt_br: Configure isto para verdadeiro, caso você queira o comportamento JMS estrito, conforme solicitado pelo TCK.
zh_cn: 如果你期望 TCK 所要求的严格的 JMS 行为的话，你可以将它设置为 true。

source: Temporary queue paging parameters
es_es: Parámetros temporales de paginación de colas
fr_fr: Paramètres de pagination de file d'attente temporaire
ja_jp: テンポラリキュー ページングパラメータ
pt_br: Parâmetros de paginação da fila temporária
zh_cn: 临时队列的页面参数

source: DefaultTempQueueFullSize, DefaultTempQueuePageSize, DefaultTempQueueDownCacheSize are optional attributes that determine the default paging parameters to be used for any temporary destinations scoped to connections created using this connection factory. See the section on paging channels for more information on what these values mean. They will default to values of 200000, 2000 and 2000 respectively if ommitted.
es_es: DefaultTempQueueFullSize, DefaultTempQueuePageSize, DefaultTempQueueDownCacheSize son atributos opcionales que determinan los parámetros predeterminados de paginación a utilizar para cualquier destino temporal a conexiones creadas utilizando esta fábrica de conexiones. Para obtener mayor información sobre lo que significan estos valores consulte los canales de paginación. Si se omite entonces los valores predeterminados serán 200000, 2000 y 2000 respectivamente.
fr_fr: DefaultTempQueueFullSize, DefaultTempQueuePageSize, DefaultTempQueueDownCacheSize sont des attributs optionnels qui déterminent les paramètres de pagination par défaut à utiliser pour toutes destinations temporaires liées à des connexions créées en utilisant cette usine de connexion. Voir la section sur les voies de pagination pour davantage d'informations sur la signification de ces valeurs. Si omises, ces valeurs par défaut seront 200000, 2000 et 2000 respectivement.
ja_jp: DefaultTempQueueFullSize, DefaultTempQueuePageSize, DefaultTempQueueDownCacheSize：これらはオプションの属性であり、この接続 ファクトリを使用して作成された接続へ向けてスコープされている一時的送り先用に 使えるようにデフォルトページングパラメータを決定します。詳細についてはページング チャンネルのセクションでこれらの値の意味をご覧ください。これらの属性は指定がない場合、 それぞれ 順に 200000、2000、2000 のデフォルト値を持っています。
pt_br: O DefaultTempQueueFullSize, DefaultTempQueuePageSize e DefaultTempQueueDownCacheSize são atributos opcionais que determinam os parâmetros de paginação padrão a serem utilizados em qualquer destinação temporária com escopo, usando esta criação de conexão. Consulte a seção nos canais de paginação para maiores informações a respeito do significado destes valores. Eles irão padronizar os valores para 200000, 2000 e 2000 respectivamente, caso tenham sido omitidos.
zh_cn: DefaultTempQueueFullSize、DefaultTempQueuePageSize、DefaultTempQueueDownCacheSize 是决定缺省页面参数的可选属性，它们用于连接工厂创建的作用域为临时目的连接。关于这些参数的更多信息，请参考 paging channels 部分的内容。如果忽略的话，它们的缺省值为 200000, 2000 和 2000。

source: When using a session with acknowledge mode of DUPS_OK_ACKNOWLEDGE this setting determines how many acknowledgments it will buffer locally before sending. The default value is <literal>2000</literal>
es_es: Al utilizar una sesión con modo de reconocimiento de DUPS_OK_ACKNOWLEDGE esto determina el número de reconocimientos que pondrá en el buffer localmente antes de realizar el envío. El valor predeterminado es <literal>2000</literal>
fr_fr: Lorsque vous utilisez une session sur le mode DUPS_OK_ACKNOWLEDGE, ce paramètre détermine le nombre de notifications il tamponnera localement avant tout envoi. La valeur par défaut est <literal>2000</literal>
ja_jp: DUPS_OK_ACKNOWLEDGE の 承認（acknowledge）モードでセッションを使用している場合、 このセッティングは送信の前にローカルでバッファする承認の数量を決定します。デフォルト値は <literal>2000</literal> です。
pt_br: Quando utilizando uma sessão com o modo de confirmação do DUPS_OK_ACKNOWLEDGE, esta configuração determinará quantas confirmações isto realizará o buffer localmente, antes do envio. O valor padrão é <literal>2000</literal>.
zh_cn: 当使用带有 DUPS_OK_ACKNOWLEDGE 确认模式的会话时，设置它可以决定在发送前确认多少次后就在本地进行缓冲。它的缺省值为 <literal>2000</literal>。

source: When using a connection factory with a clustered JBoss Messaging installation you can choose whether to enable client side connection load-balancing. This is determined by setting the attribute supportsLoadBalancing on the connection factory.
es_es: Al utilizar una fábrica de conexiones con una instalación de JBoss Messaging en clúster puede escoger el activar el balanceo de carga de la conexión del lado del cliente. Esto se determina al configurar el atributo supportsLoadBalancing en la fábrica de conexiones.
fr_fr: Lorsque vous utilisez une usine de connexion avec une installation JBoss Messaging, vous pouvez déterminer si vous souhaitez activer la connexion côté-client pour l'équilibrage des charges de travail. On le détermine en configurant les attributs supportsLoadBalancing sur l'usine de connexion.
ja_jp: クラスター化した JBoss Messaging インストールに於いて接続ファクトリを使用している 場合は、クライアント側の接続ロードバランシングを有効にするかどうかを選択できます。 これは、接続ファクトリで属性 upportsLoadBalancing をセットすることで決定されます。
pt_br: Quando usando a criação de conexão com um cluster de instalação do JBoss Messaging, você poderá escolher se ativar o carregamento- balanceado de conexão ao lado do cliente. Isto é determinado configurando o atributo supportsLoadBalancing na criação da conexão.
zh_cn: 当使用带有群集 JBoss Messaging 安装的连接工厂时，你可以选择是否启用客户端连接的负载平衡。这可以通过设置连接工厂的 supportsLoadBalancing 属性来实现。

source: If load balancing is enabled on a connection factory then any connections created with that connection factory will be load-balanced across the nodes of the cluster. Once a connection is created on a particular node, it stays on that node.
es_es: Si el balanceo de carga se encuentra activado en una fábrica de conexiones entonces cualquier conexión creada con esa fábrica de conexiones tendrá balanceo de carga a través de los nodos del clúster. Una vez se crea una conexión en un nodo en particular, esta permanece en ese nodo.
fr_fr: Si l'équilibrage de la charge de travail est activé sur une usine de connexion, alors toute connexion créée sur cette usine de connexion sera équilibrée au niveau de la charge de travail à travers les noeuds dans le groupement. Une fois la connexion créée sur un noeud particulier, il reste sur ce noeud.
ja_jp: ロードバランシングが接続ファクトリで有効になっている場合、その接続ファクトリで 作成されたいずれの接続もクラスターの全てのノードに渡ってロードバランスされます。 接続が特定のノード上で構成されると、それはそのノード上に留まります。
pt_br: Caso o carregamento balanceado seja ativado numa criação de conexão, então quaisquer conexões criadas com aquela criação de conexão serão carregadas-balanceadas, através dos nós de um cluster. Uma vez que a conexão for criada em um nó em particular, ela permanecerá naquele nó.
zh_cn: 如果连接工厂启用了负载平衡，那么用它创建的任何连接都将在群集里的节点间进行负载平衡。一旦在某个节点上创建了一个连接，它就会呆在那个节点上。

source: The exact policy that determines how connections are load balanced is determined by the LoadBalancingFactory attribute
es_es: La política exacta que determina la manera en que se realiza el balanceo de carga está determinado por el atributo LoadBalancingFactory.
fr_fr: La politique exacte qui détermine comment les connexions sont équilibrées au niveau charge de travail, est déterminé par l'attribut LoadBalancingFactory
ja_jp: 接続がロードバランスを受ける方法を決定する厳密なポリシーは、LoadBalancingFactory 属性に よって決定されます。
pt_br: A política exata que determina como as conexões são carregadas balanceadas é determinada pelo atributo LoadBalancingFactory.
zh_cn: 连接使用何种策略进行负载平衡是由 LoadBalancingFactory 属性决定的

source: The default value is <literal>false</literal>
es_es: El valor predeterminado es <literal>false</literal>
fr_fr: La valeur par défaut est <literal>false</literal> (faux)
ja_jp: デフォルト値は <literal>false</literal> です。
pt_br: O valor do padrão é <literal>false</literal>.
zh_cn: 它的缺省值为 <literal>false</literal>

source: When using a connection factory with a clustered JBoss Messaging installation you can choose whether to enable client side automatic failover. This is determined by setting the attribute supportsFailover on the connection factory.
es_es: Al utilizar una fábrica de conexiones con una instalación de JBoss Messaging en clúster puede escoger si quiere activar la conmutación de servidores en caso de fallo de manera automática del lado del cliente. Esto se determina al configurar el atributo supportsFailover en la fábrica de conexiones.
fr_fr: Lorsque vous utilisez une usine de connexion avec une installation Groupée JBoss Messaging, vous pouvez opter pour l'activation de la reprise automatique côté-client. Il suffit de configurer l'attribut supportsFailover dans l'usine de connexion.
ja_jp: クラスター化した JBoss Messaging インストールに於いて接続ファクトリを 使用している場合、クライアント側の自動フェイルオーバーを有効にするかどうかを 選択できます。これは、接続ファクトリで属性 supportsFailover をセットすることで 決定されます。
pt_br: Quando utilizando a criação da conexão com a instalação do JBoss Messaging com cluster, você pode escolher se ativar o failover automático ao lado do cliente. Isto é determinado pela configuração do atributo na criação da conexão.
zh_cn: 当使用带有群集 JBoss Messaging 安装的连接工厂时，你可以选择是否启用客户端自动失效切换。这可以通过设置连接工厂的 supportsFailover 属性来完成。

source: If automatic failover is enabled on a connection factory, then if a connection problem is detected with the connection then JBoss Messaging will automatically and transparently failover to another node in the cluster.
es_es: Si la conmutación automática de servidor en caso de fallo se activa en una fábrica de conexiones entonces si se detecta un problema en la conexión entonces JBoss Messaging de manera automática y transparente conmutará en caso de fallo a otro nodo en el clúster.
fr_fr: Si la reprise automatique est activée sur une usine de connexion, et qu'un problème de connexion est détecté, alors JBoss Messaging reprendra automatiquement sur un autre noeud du groupement et ce, de façon transparente.
ja_jp: 接続ファクトリで自動フェイルオーバーが有効になっている場合は、その接続で 接続問題が検出されると、JBoss Messaging は自動的に、そして透過的に クラスター内の別のノードにフェイルオーバーします。
pt_br: Caso o failover automático seja ativado numa criação de conexão, e se um problema de conexão for detectado com a conexão, então o JBoss Messaging irá automaticamente e claramente realizar o failover para outro nó no cluster.
zh_cn: 如果连接工厂启用了自动失效切换，且某个连接出现了连接问题，JBoss Messaging 将自动和透明地切换至群集里的另外一个节点上。

source: The failover is transparent meaning the user can carry on using the sessions, consumers, producers and connection objects as before.
es_es: La conmutación en caso de fallo es transparente lo que significa que el usuario puede continuar utilizando las sesiones, los consumidores, los productores y los objetos de conexión tal como antes.
fr_fr: La reprise est transparente, ce qui signifie que l'utilisateur peut continuer en utilisant les sessions, les consommateurs, les producteurs et les objets de connexion comme auparavant.
ja_jp: フェイルオーバーが透過的であることは、ユーザーが以前と同様に セッション、コンシューマ、 プロデューサ、そして 接続オブジェクトの使用を継続できると言う意味です。
pt_br: O failover significa claramente que o usuário pode continuar usando as sessões, consumidores, produtores e objetos de conexão, conforme anteriormente.
zh_cn: 透明的失效切换意味着客户可以象故障发生前一样地使用会话、消费者、生产者和连接对象。

source: If automatic failover is not required, then this attribute can be set to false. With automatic failover disabled it is up to the user code to catch connection exceptions in synchronous JMS operations and install a JMS ExceptionListener to catch exceptions asynchronously. When a connection is caught, the client side code should lookup a new connection factory using HAJNDI and recreate the connection using that.
es_es: Si no se requiere una conmutación automática en caso de fallo entonces este atributo se puede configurar como falso. Si esta conmutación automática se desactiva ya queda del código del usuario el atrapar excepciones de conexiones en operaciones JMS sincrónicas y el instalar un ExceptionListener JMS para atrapar excepciones de manera asincrónica. Cuando se atrapa una conexión, el código del lado del cliente debe buscar una nueva fábrica de conexiones utilizando HAJNDI y recrear la conexión utilizando eso.
fr_fr: Si la reprise automatique n'est pas requise, alors l'attribut peut être configuré à 'false'. Quand la reprise automatique est désactivée, c'est au code utilisateur d'intercepter les exceptions de connexion dans les opérations JMS synchrones et d'installer un ExceptionListener JMS pour intercepter les exceptions asynchrones. Lorsqu'une connexion est prise, le code côté-client doit trouver une nouvelle usine de connexion en utilisant HAJNDI et recréer une connexion en l'utilisant.
ja_jp: 自動フェイルオーバーが必要でない場合は、この属性を「false」にセットすることが できます。自動フェイルオーバーが無効になっていると、同期 JMS オペレーション内の 接続例外を検出するのはユーザーコードに依存し、非同期的に例外を検出するのには ExceptionListener をインストールします。接続が検出される時には、クライアント側の コードは、HAJNDI を使用して新規の接続ファクトリをルックアップして、その使用により 接続を再作成します。
pt_br: Caso o failover automático não seja solicitado, então este atributo pode ser configurado para falso. Uma vez desativado o failover automático, fica a critério do código do usuário capturar exceções de conexão em operações JMS síncronas e instalar um JMS ExceptionListener, para capturar exceções assíncronas. Quando a conexão for capturada, o código ao lado do cliente deverá observar uma nova criação de conexão, usando o HAJNDI e, desta forma, recriar a conexão.
zh_cn: 如果不要求自动失效切换，那可以把这个属性设置为 false。如果禁用了自动失效切换，那么程序代码要在同步 JMS 操作里捕获异常或安装 JMS ExceptionListener 来异步捕获异常。当某个连接被捕获时，客户端代码应该查找一个使用 HAJNDI 的连接工厂并用它来重新创建连接。

source: By default, when deploying a connection factory, JBoss Messaging checks that the corresponding JBoss Remoting Connector has "sensible" values. JBoss Messaging is very sensitive to the values and for many of them there's rarely a good reason to change them. To disable such sanity checking set this to false.
es_es: Por defecto, al implementar una fábrica de conexiones, JBoss Messaging chequea que el JBoss Remoting Connector correspondiente tenga valores "sensatos". JBoss Messaging es muy sensible a los valores y para la mayoría de ellos casi nunca hay una buena razón para cambiarlos. Para desactivar tal chequeo de sanidad configure esto como falso.
fr_fr: Par défaut, lorsque vous déployez une usine de connexion, JBoss Messaging vérifie que le connecteur JBoss Remoting Connector correspondant possède des valeurs "raisonnables". JBoss Messaging est très sensible à ces valeurs et on a rarement besoin de les changer. Pour désactiver ce contrôle de sanité, configurer le à 'faux'.
ja_jp: 接続ファクトリをデプロイしている時には、デフォルトで JBoss Messaging は対応する JBoss Remoting Connector が「妥当な」値を持っているかどうかを チェックします。 JBoss Messaging はこの値に非常に敏感で、多くの値にとっては それを変更するべき適切な理由はほとんどありません。このような確認チェックを 無効にするには、これを「false」にセットします。
pt_br: O JBoss Messaging checa que o Conector Remoto correspondente possui valores "lógicos", quando implementando a criação de conexão pelo padrão. O JBoss Messaging é bastante sensível a valores e para muitos destes, é muito difícil existir um bom motivo para modificá-los. Para desativar esta checagem, configure-o para falso.
zh_cn: 在缺省情况下，在部署一个连接工厂时，JBoss Messaging 将检查对应的 JBoss Remoting Connector 是否具有某些敏感的（"sensible"）值。JBoss Messaging 对这些值非常敏感且很少有修改这些值的时候。要禁用这样的检查，可将其设置为 false。

source: There is rarely a good reason to disable checking. Only do so if you are absolutely sure in what you are doing
es_es: Muy rara vez hay una buena razón para desactivar el chequeo. Hágalo solo si está completamente seguro de lo que está haciendo.
fr_fr: Il y a rarement une bonne raison de désactiver le contrôle. Procédez uniquement si vous êtes absolument certain de ce que vous faîtes
ja_jp: チェックを無効にするのに適切な理由はほとんどありません。これは 自分の行動に絶対的に確信を持てる場合のみに実行して下さい。
pt_br: É muito difícil encontrar um bom motivo para desativar a checagem. Apenas realize isto, se você possuir absoluta certeza do que está fazendo.
zh_cn: 我们通常没什么理由禁用这个检查。请在有明确目的时才这么做。

source: If you are using a connection factory with client side load balancing then you can specify how the load balancing is implemented by overriding this attribute. The value must correspond to the name of a class which implements the interface org.jboss.jms.client.plugin.LoadBalancingFactory
es_es: Si está utilizando una fábrica de conexiones con balanceo de carga del lado del cliente entonces puede especificar la manera en que se implementa el balanceo de carga sobreescribiendo este atributo. El valor debe corresponder al nombre de la clase que implementa la interfaz org.jboss.jms.client.plugin.LoadBalancingFactory
fr_fr: Si vous utilisez une usine de connexion avec un équilibrage des charges de travail côté-client, alors vous pouvez spécifier comment l'équilibre de la charge de travail est implémentée en remplaçant cet attribut. La valeur doit correspondre au nom de la classe qui implémente l'interface org.jboss.jms.client.plugin.LoadBalancingFactory
ja_jp: クライアント側のロードバランシングを用いて接続ファクトリを使用している場合、 この属性を上書きすることでロードバランシングの実装の仕方を指定することが できます。その値は、インターフェイス org.jboss.jms.client.plugin.LoadBalancingFactory を 実装するクラスの名前に相当しなければなりません。
pt_br: Caso você esteja usando a criação da conexão com o carregamento balanceado ao lado do cliente, então você poderá especificar como o carregamento balanceado será carregado pela substituição deste atributo. O valor deve corresponder ao nome da classe que implementa a interface org.jboss.jms.client.plugin.LoadBalancingFactory.
zh_cn: 如果你在使用带有客户端负载平衡的连接工厂，你可以通过覆盖这个属性来指定实施方法。这个值必须对应实现 org.jboss.jms.client.plugin.LoadBalancingFactory 接口的类名。

source: The default value is org.jboss.jms.client.plugin.RoundRobinLoadBalancingFactory, which load balances connections across the cluster in a round-robin fashion
es_es: El valor predeterminado es org.jboss.jms.client.plugin.RoundRobinLoadBalancingFactory, el cual balancea la carga de conexiones a través del clúster de una manera equitativa.
fr_fr: La valeur par défaut est org.jboss.jms.client.plugin.RoundRobinLoadBalancingFactory, qui équilibre les charges de travail des connexions à travers le groupement en circuit cyclique.
ja_jp: デフォルト値は org.jboss.jms.client.plugin です。RoundRobinLoadBalancingFactory は クラスター全域に渡って round-robin （総当たり）式に接続をロードバランスします。
pt_br: O valor padrão é org.jboss.jms.client.plugin.RoundRobinLoadBalancingFactory, do qual o carregamento efetua o balanço das conexões através do cluster, num estilo de repetição alternada.
zh_cn: 它的缺省值是 org.jboss.jms.client.plugin.RoundRobinLoadBalancingFactory，这将以 round-robin 模式在群集里平衡连接负载。

source: Connector
es_es: Conector
fr_fr: Connecteur
pt_br: Conector
zh_cn: 连接器

source: This specifies which remoting connector this connection factory uses. Different connection factories can use different connectors.
es_es: Este especifica el conector remoto que esta fábrica de conexiones utiliza. Diferentes fábricas de conexiones pueden utilizar diferentes conectores.
fr_fr: Il précise quel connecteur distant est utilisé par cette usine de connexion. Des usines de connexions différentes peuvent utiliser des connecteurs différents.
ja_jp: これは、この接続ファクトリが使用する remoting connector を指定します。 異なる接続ファクトリは異なるコネクターを使用できます。
pt_br: Isto especifica qual conector esta criação de conexão utiliza. Diferentes criações de conexão podem usar diferentes conectores.
zh_cn: 它指定连接工厂使用的远程连接器。不同的连接工厂可以使用不同的连接器。
