Repository: bobmcwhirter/jboss-messaging
Catalog: docs/EAP_4_3/JBoss_Messaging_User_Guide/*/Configuration.po
Languages: es_es, fr_fr, ja_jp, pt_br, zh_cn

source: The JMS service in the JBoss AS uses relational databases to persist its messages. For improved performance, you should change the JMS service to take advantage of the external database. To do that, you need to replace the file <filename>jboss-as/server/production/deploy/jboss-messaging.sar/clustered-hsqldb-persistence-service.xml</filename> with a file in <filename>jboss-as/docs/examples/jms/</filename> depending on your external database and restart your server. <itemizedlist> <listitem><para>MySQL: <literal>mysql-persistence-service.xml</literal></para></listitem> <listitem><para>PostgreSQL: <literal>postgresql-persistence-service.xml</literal></para></listitem> <listitem><para>Oracle: <literal>oracle-persistence-service.xml</literal></para></listitem> <listitem><para>Sybase: <literal>sybase-persistence-service.xml</literal></para></listitem> <listitem><para>MS SQL Server: <literal>mssql-persistence-service.xml</literal></para></listitem> </itemizedlist> For the <literal>default</literal> and <literal>all</literal> configurations, replace the files <filename>jboss-as/server/default/deploy/jboss-messaging.sar/hsqldb-persistence-service.xml</filename> and <filename>jboss-as/server/all/deploy/jboss-messaging.sar/clustered-hsqldb-persistence-service.xml</filename> respectively.
es_es: El servicio JMS en JBoss AS utiliza bases de datos relacionales para persistir sus mensajes. Para un rendimiento mejorado debe cambiar el servicio JMS para sacar ventaja de la base de datos externa. Para lograr esto, es necesario reemplazar el archivo <filename>jboss-as/server/production/deploy/jboss-messaging.sar/clustered-hsqldb-persistence-service.xml</filename> con un archivo en <filename>jboss-as/docs/examples/jms/</filename> dependiendo de su base de datos externa y reiniciar su servidor. <itemizedlist> <listitem><para>MySQL: <literal>mysql-persistence-service.xml</literal></para></listitem> <listitem><para>PostgreSQL: <literal>postgresql-persistence-service.xml</literal></para></listitem> <listitem><para>Oracle: <literal>oracle-persistence-service.xml</literal></para></listitem> <listitem><para>Sybase: <literal>sybase-persistence-service.xml</literal></para></listitem> <listitem><para>MS SQL Server: <literal>mssql-persistence-service.xml</literal></para></listitem> </itemizedlist> Para las configuraciones <literal>default</literal> y <literal>all</literal> reemplace los archivos <filename>jboss-as/server/default/deploy/jboss-messaging.sar/hsqldb-persistence-service.xml</filename> y <filename>jboss-as/server/all/deploy/jboss-messaging.sar/clustered-hsqldb-persistence-service.xml</filename> respectivamente.
fr_fr: Le service JMS qui fait partie de JBoss As utilise des bases de données relationnelles pour rendre ses messsages persistants. Pour améliorer la performance, vous devez changer le service JMS pour bénéficier de la base de données externe. Pour cela, vous aurez besoin de remplacer <filename>jboss-as/server/production/deploy/jboss-messaging.sar/clustered-hsqldb-persistence-service.xml</filename> par un fichier situé dans <filename>jboss-as/docs/examples/jms/</filename> suivant votre base de données externe et vous devrez redémarrer votre serveur. <itemizedlist> <listitem><para>MySQL: <literal>mysql-persistence-service.xml</literal></para></listitem> <listitem><para>PostgreSQL: <literal>postgresql-persistence-service.xml</literal></para></listitem> <listitem><para>Oracle: <literal>oracle-persistence-service.xml</literal></para></listitem> <listitem><para>Sybase: <literal>sybase-persistence-service.xml</literal></para></listitem> <listitem><para>MS SQL Server: <literal>mssql-persistence-service.xml</literal></para></listitem> </itemizedlist> Pour les configurations <literal>default</literal> et <literal>all</literal>, remplacer les fichiers <filename>jboss-as/server/default/deploy/jboss-messaging.sar/hsqldb-persistence-service.xml</filename> et <filename>jboss-as/server/all/deploy/jboss-messaging.sar/clustered-hsqldb-persistence-service.xml</filename> respectivement.
ja_jp: JBoss AS の JMS サービスは関係データベースを使用して、そのメッセージを永続化させます。 より良いパフォーマンスの為には、JMS サービスを変更して外部のデータベースを活用する べきです。それを行うには、ファイル <filename>jboss-as/server/production/deploy/jboss-messaging.sar/clustered-hsqldb-persistence-service.xml</filename> を使用する外部データベースに応じて、 <filename>jboss-as/docs/examples/jms/</filename> 内のファイルに替えます。そしてサーバーを 再起動します。<itemizedlist> <listitem><para>MySQL: <literal>mysql-persistence-service.xml</literal></para></listitem> <listitem><para>PostgreSQL: <literal>postgresql-persistence-service.xml</literal></para></listitem> <listitem><para>Oracle: <literal>oracle-persistence-service.xml</literal></para></listitem> <listitem><para>Sybase: <literal>sybase-persistence-service.xml</literal></para></listitem> <listitem><para>MS SQL Server: <literal>mssql-persistence-service.xml</literal></para></listitem> </itemizedlist> <literal>default</literal> と <literal>all</literal> の設定では、ファイル <filename>jboss-as/server/default/deploy/jboss-messaging.sar/hsqldb-persistence-service.xml</filename> と ファイル <filename>jboss-as/server/all/deploy/jboss-messaging.sar/clustered-hsqldb-persistence-service.xml</filename> をそれぞれ 替えます。
pt_br: O serviço JMS no JBoss AS usa o banco de dados relacional para persistência das próprias mensagens. Para melhoramento do desempenho, você deverá modificar o serviço JMS para aproveitamento do banco de dados externo. Para isto, você precisa substituir o arquivo <filename>jboss-as/server/production/deploy/jboss-messaging.sar/clustered-hsqldb-persistence-service.xml</filename> por um arquivo <filename>jboss-as/docs/examples/jms/</filename>, baseando-se no seu banco de dados externo e restaurar seu servidor. <itemizedlist> <listitem><para>MySQL: <literal>mysql-persistence-service.xml</literal></para></listitem> <listitem><para>PostgreSQL: <literal>postgresql-persistence-service.xml</literal></para></listitem> <listitem><para>Oracle: <literal>oracle-persistence-service.xml</literal></para></listitem> <listitem><para>Sybase: <literal>sybase-persistence-service.xml</literal></para></listitem> <listitem><para>MS SQL Server: <literal>mssql-persistence-service.xml</literal></para></listitem> </itemizedlist> Para o <literal>padrão</literal> e <literal>todas</literal> as configurações, substitua os arquivos <filename>jboss-as/server/default/deploy/jboss-messaging.sar/hsqldb-persistence-service.xml</filename> e <filename>jboss-as/server/all/deploy/jboss-messaging.sar/clustered-hsqldb-persistence-service.xml</filename> respectivamente.
zh_cn: JBoss AS 里的 JMS 服务使用关系型数据库来持久化消息。为了提供性能，你应该让 JMS 服务利用外部的数据库。根据不同的数据库，你需要用 <filename>jboss-as/docs/examples/jms/</filename> 里的文件替换 <filename>jboss-as/server/production/deploy/jboss-messaging.sar/clustered-hsqldb-persistence-service.xml</filename> 并重启服务器。<itemizedlist> <listitem><para>MySQL: <literal>mysql-persistence-service.xml</literal></para></listitem> <listitem><para>PostgreSQL: <literal>postgresql-persistence-service.xml</literal></para></listitem> <listitem><para>Oracle: <literal>oracle-persistence-service.xml</literal></para></listitem> <listitem><para>Sybase: <literal>sybase-persistence-service.xml</literal></para></listitem> <listitem><para>MS SQL Server: <literal>mssql-persistence-service.xml</literal></para></listitem> </itemizedlist> 对于 <literal>default</literal> 和 <literal>all</literal> 配置，请分别替换 <filename>jboss-as/server/default/deploy/jboss-messaging.sar/hsqldb-persistence-service.xml</filename> 和 <filename>jboss-as/server/all/deploy/jboss-messaging.sar/clustered-hsqldb-persistence-service.xml</filename>。

source: Also, be aware that by default, the Messaging services relying on a datastore are referencing <literal>"java:/DefaultDS"</literal> for the datasource. If you are deploying a datasource with a different JNDI name, you need to update all the <literal>DataSource</literal> attribute in the persistence configuration file. Example data source configurations for each of the popular databases are available in the distribution.
es_es: También, tenga en cuenta que por defecto, los servicios de Messaging que dependen de un almacenamiento de datos están referenciando <literal>"java:/DefaultDS"</literal> para la fuente de datos. Si está desplegando una fuente de datos con un nombre JNDI diferente entonces necesita actualizar todos los atributos <literal>DataSource</literal> en el archivo de configuración de persistencia. En la distribución encontrará configuraciones de fuentes de datos de ejemplo para cada una de las bases de datos más populares.
fr_fr: Aussi, soyez conscients que par défaut, les services de Messaging dépendant d'un datastore référencent <literal>"java:/DefaultDS"</literal> pour la source de données. Si vous déployez une source de données associée à un JNDI différent, vous aurez besoin de mettre à jour tous les attributs <literal>DataSource</literal> (source de données) dans le fichier de configuration de la persistance. Des exemples de configurations des sources de données pour chaque base de donnée courante, sont disponibles dans la distribution.
ja_jp: また、デフォルトで データストアに依存する Messaging サービスは、データソース用に <literal>"java:/DefaultDS"</literal> を照合していることに留意してください。異なる JNDI 名を利用するデータソースをデプロイする場合は、永続化設定ファイル内の全ての <literal>DataSource</literal> 属性を更新する必要があります。ポピュラーなデータベースのそれぞれの為のサンプルのデータソース設定はディストリビューション内に あります。
pt_br: Além disso, esteja ciente que pelo padrão, os serviços Messaging dependem que o datastore esteja referenciando o <literal>"java:/DefaultDS"</literal> para o banco de dados. Caso você esteja implementando um banco de dados com um nome JNDI diferente, você precisará atualizar todos os atributos <literal>DataSource</literal> no arquivo de configuração de persistência. As configurações de recurso de dados para cada um dos banco de dados populares, estão disponíveis na distribuição.
zh_cn: 而且，请注意 Messaging 服务缺省依赖于以 <literal>"java:/DefaultDS"</literal> 引用的数据源。如果你采用不同的 JNDI 名称部署数据源，你需要更新持久化配置文件里所有的 <literal>DataSource</literal> 属性。本发行版本里包含了所有流行数据库的数据源配置示例。

source: You can configure a JCA datasource using an example from <filename>jboss-as/docs/examples/jca</filename> and copying to <filename>jboss-as/server/<replaceable>&lt;config-name&gt;</replaceable>/deploy</filename>. By default JBoss Messaging uses <literal>DefaultDS</literal>.
es_es: Puede configurar una fuente de datos JCA usando un ejemplo de <filename>jboss-as/docs/examples/jca</filename> y copiando a <filename>jboss-as/server/<replaceable>&lt;config-name&gt;</replaceable>/deploy</filename>. Por defecto JBoss Messaging usa <literal>DefaultDS</literal>.
fr_fr: Vous pouvez configurer la source de données JCA en utilisant un exemple dans <filename>jboss-as/docs/examples/jca</filename> et en le copiant dans <filename>jboss-as/server/<replaceable>&lt;config-name&gt;</replaceable>/deploy</filename>. Par défaut, JBoss Messaging utilise <literal>DefaultDS</literal>.
ja_jp: JCA データソースを設定するには、<filename>jboss-as/docs/examples/jca</filename> からのサンプルを使用し、それを <filename>jboss-as/server/<replaceable>&lt;config-name&gt;</replaceable>/deploy</filename> にコピーします。 デフォルトで JBoss Messaging は <literal>DefaultDS</literal> を使用します。
pt_br: Você pode configurar um banco de dados JCA usando um exemplo a partir do <filename>jboss-as/docs/examples/jca</filename> e gravando para <filename>jboss-as/server/<replaceable>&lt;config-name&gt;</replaceable>/deploy</filename>. O JBoss Messaging usa o <literal>DefaultDS</literal> pelo padrão.
zh_cn: 你可以把 <filename>jboss-as/docs/examples/jca</filename> 里的例子复制到 <filename>jboss-as/server/<replaceable>&lt;config-name&gt;</replaceable>/deploy</filename> 里来配置 JCA 数据源。JBoss Messaging 缺省使用 <literal>DefaultDS</literal>。

source: Configuring the Post office
es_es: Configuración de la oficina postal
fr_fr: Configurer Post office
ja_jp: ポストオフィスの設定
pt_br: Configuração do Correio
zh_cn: 配置邮局

source: It is the job of the post office to route messages to their destination(s).
es_es: La oficina postal es la encargada de enrutar los mensajes a su(s) destino(s).
fr_fr: Le travail de Post office est de diriger les messages vers leur(s) destination(s).
ja_jp: メッセージを送り先 まで回送するのはポストオフィスの役目です。
pt_br: É função do correio realizar o roteamento das mensagens às suas próprias destinações.
zh_cn: 邮局（Post Office）的职责是把消息传递至目的地。

source: The post office maintains the mappings between addresses to which messages can be sent and their final queues.
es_es: La oficina postal mantiene los mapeos entre direcciones a las cuales se pueden enviar mensajes y sus colas finales.
fr_fr: Post office conserve les mappings entre les adresses où les messages peuvent être envoyés et leurs files d'attente finales.
ja_jp: ポストオフィスはメッセージを配信できるアドレスとそれらの最終 キューの間の マッピングを維持します。
pt_br: O correio mantém os mapeamentos entre endereços pelos quais as mensagens podem ser enviadas e suas filas finais.
zh_cn: 邮局维护消息可发送到的地址和最终队列之间的映射关系。

source: For example when sending a message with an address that represents a JMS queue name, the post office will route this to a single queue - the JMS queue. When sending a message with an address that repesents a JMS topic name, the post office will route this to a set of queues - one for each JMS subscription.
es_es: Por ejemplo cuando al enviar un mensaje con una dirección que representa un nombre de cola JMS, la oficina postal enrutará esto a una sola cola - la cola JMS. Al enviar un nmensaje con una dirección que representa un nombre de tema JMS, la oficina postal enrutará esto a un grupo de colas - uno para cada subscripción JMS.
fr_fr: Par exemple, lorsque vous envoyez un message associé à une adresse qui représente le nom d'une file d'attente JMS, Post office le dirigera vers une file d'attente unique - la file d'attente JMS. Lorsque vous envoyez un message associé à une adresse qui représente le nom d'un sujet JMS, Post office le dirigera vers un ensemble de files d'attente - une file d'attente pour chaque abonnement JMS.
ja_jp: 例えば、JMS キュー名を代表するアドレスを利用するメッセージを送信する時は、 ポストオフィスはこれを単独の キュー である JMS キュー に回送します。 JMS トピック 名を代表するアドレスを利用するメッセージを送信する時は、 ポストオフィスはこれを キュー のセットに対して、各 JMS サブスクリプション毎に １つずつ送信します。
pt_br: Por exemplo: quando enviando uma mensagem com um endereço que representa o nome da fila JMS, o correio realizará o roteamento disto para uma fila única - a fila JMS.
zh_cn: 例如，当发送带有代表 JMS 队列名称的地址的消息时，邮局会将其传递到单一的对列 - 该 JMS 对列。而当带有代表 JMS 主题名称的地址的消息时，邮局会将其传递到一组对列 - 每个 JMS 订阅对应一个。

source: The post office also handles the persistence for the mapping of addresses.
es_es: La oficina postal también maneja la persistencia para el mapeo de direcciones.
fr_fr: Post office gère également la persistance du mapping des adresses.
ja_jp: ポストオフィスはまた、アドレスのマッピング用永続化も処理します。
pt_br: O correio também manuseia a persistência para o mapeamento dos endereços.
zh_cn: 邮局也处理地址映射的持久化。

source: JBoss Messaging post-offices are also cluster aware. In a cluster they will automatically route and pull messages between them in order to provide fully distributed JMS queues and topics.
es_es: Las oficinas postales de JBoss Messaging también tienen en cuenta clústers. En un clúster enrutarán de manera automática y obtendrán mensajes entre ellos con el fin de proporcionar temas y colas JMS completamente distribuidas.
fr_fr: Les post-offices de JBoss Messaging sont sensibles au groupage. Au sein d'un groupement, elles vont automatiquement diriger et extraire des messages entre elles en vue de fournir les files d'attente et des sujets totalement distribués.
ja_jp: JBoss Messaging ポストオフィスはまた、クラスター認識があります。クラスター内では、 ポストオフィスは自動的にメッセージの回送、及び引き取りをして、完全に分散した JMS キューと JMS トピックを提供します。
pt_br: Os correios do JBoss Messaging estão também cientes do cluster. Num cluster eles irão automaticamente rotear e absorver as mensagens entre eles, com o objetivo de fornecer tópicos e filas JMS inteiramente distribuídos.
zh_cn: JBoss Messaging 的邮局也可用于群集。在群集环境里，它们将在节点间自动传递和获取消息来提供完全分布式的 JMS 队列和主题。

source: The post office configuration is found in the xxx-persistence-service.xml file (where xxx is the name of your database).
es_es: La configuración de la oficina postal se encuentra en el archivo xxx-persistence-service.xml (en donde xxx es el nombre de su base de datos).
fr_fr: La configuration de Post office se situe dans le fichier xxx-persistence-service.xml (où xxx est le nom de la base de données).
ja_jp: ポストオフィスの設定は xxx-persistence-service.xml ファイル内で見つけることが できます。（ここで xxx とはご使用のデータベースの名前です）
pt_br: A configuração de correio pode ser encontrada no arquivo xxx-persistence-service.xml (onde xxx é o nome de seu banco de dados).
zh_cn: 邮局的配置在 xxx-persistence-service.xml（xxx 是数据库的名称）文件里进行。

source: Here is an example of a post office configuration:
es_es: Este es un ejemplo de una configuración de la oficina postal:
fr_fr: Voici une exemple de la configuration de Post office:
ja_jp: ポストオフィス設定の例を以下に示します:
pt_br: Segue abaixo um exemplo da configuração de correio:
zh_cn: 下面是一个邮局的配置示例：

source: The post office has the following attributes
es_es: La oficina postal tiene los siguientes atributos
fr_fr: Post office contient les attributs suivants
ja_jp: ポストオフィスは以下のような属性を持ちます
pt_br: O correio possui os seguintes atributos:
zh_cn: 邮局具有下列的属性

source: The datasource the postoffice should use for persisting its mapping data.
es_es: La fuente de datos que el postoffice debe utilizar para persistir sus datos mapeados.
fr_fr: Source de données que Post office doit utiliser pour rendre ses données de mapping persistantes.
ja_jp: ポストオフィスがそのマッピングデータの永続化の為に使用すべきデータソース
pt_br: O datasource do correio deve ser usado para persistência do próprio dado de mapeamento.
zh_cn: 邮局用来持久化其映射数据的数据源。

source: This is where the DDL and DML for the particular database is specified. If a particular DDL or DML statement is not overridden, the default Hypersonic configuration will be used for that statement.
es_es: Aquí es donde se especifican el DDL y el DML para una base de datos en particular. Si una declaración DDL o DML en particular no se sobreescribe, la configuración Hypersonic predeterminada se utilizará para esa declaración.
fr_fr: C'est l'endroit où les DDL et DML sont spécifiés pour une base de données particulière. Si les instructions spécifiées pour les DDl et DML n'ont pas été modifiées, la configuration Hypersonic par défaut sera utilisée pour cet énoncé.
ja_jp: 特定のデータベース用の DDL 又は DML が指定される場所です。特定の DDL 又は DML の ステートメントが上書きされない場合、デフォルトの Hypersonic 設定がそのステートメント用に 使用されます。
pt_br: Isto é onde o DDL e DML são especificados para um database em particular. Caso uma declaração DDL ou DML específica não seja substituída, a configuração Hypersonic padrão será usada para aquela declaração.
zh_cn: 这是为特定数据库指定的 DDL 和 DML。如果 DDL 和 DML 没有根据特定数据库覆盖，那么缺省的 Hypersonic 配置将被使用。

source: Set this to <literal>true</literal> if you wish the post office to attempt to create the tables (and indexes) when it starts. If the tables (or indexes) already exist a <literal>SQLException</literal> will be thrown by the JDBC driver and ignored by the Persistence Manager, allowing it to continue.
es_es: Configure esto como <literal>true</literal> si desea que la oficina postal intente crear las tablas (e índices) cuando arranca. Si las tablas (o los índices) ya existen el controlador JDBC presentará una excepción <literal>SQLException</literal> y será ignorada por el administrador de persistencia permitiéndole continuar.
fr_fr: Configurer <literal>true</literal> (vrai) si vous souhaitez que Post office tente de créer des tables (et des index) au démarrage. Si les tables (ou les index) existent déjà, le pilote JDBC renverra une <literal>SQLException</literal> qui sera ignorée par le gestionnaire de persistances (Persistence Manager), lui permettant ainsi de continuer.
ja_jp: ポストオフィスが、スタートする時にテーブル（及びインデックス）の作成を試みる ようにしたい場合、これを <literal>true</literal> にセットします。テーブル （又はインデックス）が既に存在する場合、<literal>SQLException</literal> が JDBC ドライバーによって送出されて、Persistence Manager に無視されます。 その為、継続が可能になります。
pt_br: Configure isto para <literal>true</literal>, caso você queira que o correio faça a tentativa de criação de tabela (e indexes), no período de inicialização. Caso a tabela e indexes já existirem, um <literal>SQLException</literal> será lançado pelo driver JDBC e ignorado pelo Gerenciador de Persistência, permitindo que isto continue.
zh_cn: 如果你希望邮局在启动时创建表（和索引），设置它为 <literal>true</literal>。如果这个表（或索引）已经存在，那么 JDBC 驱动将抛出 <literal>SQLException</literal>，但 Persistence Manager 会忽略它并允许继续运行。

source: By default the value of <literal>CreateTablesOnStartup</literal> attribute is set to <literal>true</literal>
es_es: Por defecto el valor del atributo <literal>CreateTablesOnStartup</literal> está establecido como <literal>true</literal>
fr_fr: Par défaut, la valeur de l'attribut <literal>CreateTablesOnStartup</literal> est configurée à <literal>true</literal> (vrai)
ja_jp: デフォルトで、<literal>CreateTablesOnStartup</literal> 属性の値は <literal>true</literal> にセットされています。
pt_br: O valor do atributo <literal>CreateTablesOnStartup</literal> é configurado para <literal>true</literal>, por padrão.
zh_cn: <literal>CreateTablesOnStartup</literal> 属性的缺省值是 <literal>true</literal>。

source: Set this to <literal>true</literal> if you wish the post office to detect duplicate messages, that may be sent, when a send is retried on a different node after a server failure.
es_es: Configure esto como <literal>true</literal> si quiere que la oficina postal detecte mensajes duplicados que pueden ser enviados cuando se reintenta un envío en un nodo diferente después de una falla en un servidor.
fr_fr: Configurer à <literal>true</literal> (vrai) si vous souhaitez que Post office puisse détecter les messages en duplicata, qui ont pu être envoyés, quand un envoi est dirigé vers un autre noeud suite à un échec du serveur.
ja_jp: サーバー障害の後で異なるノード上で送信が再試行される時に送信される可能性がある重複メッセージを ポストオフィスが検出するようにしたい場合は、これを <literal>true</literal> にセットします。
pt_br: Configure isto para <literal>true</literal>, caso você deseje que o correio detecte mensagens duplicadas, das quais poderão ser enviadas, uma vez que o envio é retido num nó diferente, após a falha do servidor.
zh_cn: 如果你希望邮局检测在服务器故障后重发的重复消息，可将其设置为 <literal>true</literal>。

source: By default the value of the <literal>DetectDuplicates</literal> attribute is set to <literal>true.</literal>
es_es: Por defecto el valor del atributo <literal>DetectDuplicates</literal> está configurado como <literal>true.</literal>
fr_fr: Par défaut, la valeur de l'attribut <literal>DetectDuplicates</literal> est paramétrée à <literal>true.</literal> (vrai).
ja_jp: <literal>DetectDuplicates</literal> 属性の値はデフォルトで、 <literal>true</literal> にセットされています。
pt_br: O valor do atributo <literal>DetectDuplicates</literal> é configurado para <literal>true</literal>, pelo padrão.
zh_cn: <literal>DetectDuplicates</literal> 属性的缺省值是 <literal>true</literal>。
