Repository: bobmcwhirter/jboss-messaging
Catalog: docs/EAP_4_3/JBoss_Messaging_User_Guide/*/Configuration.po
Languages: es_es, fr_fr, ja_jp, pt_br, zh_cn

source: Configuration
es_es: Configuración
ja_jp: 設定
pt_br: Configuração
zh_cn: 配置

source: The JMS API specifies how a messaging client interacts with a messaging server. The exact definition and implementation of messaging services, such as message destinations and connection factories, are specific to JMS providers. JBoss Messaging has its own configuration files to configure services. If you are migrating services from JBossMQ (or other JMS provider) to JBoss Messaging, you will need to understand these configuration files. In this chapter, we will discuss how to configure various services inside JBoss Messaging, which work together to provide JMS API level services to client applications.
es_es: El API JMS especifica la manera en que un cliente de mensajeria interactúa con un servidor de mensajes. La definición exacta y la implementación de servicios de mensajes tal como los destinos y las fábricas de conexiones son especificas para los proveedores JMS. JBoss Messaging tiene sus propios archivos de configuración para configurar los servicios. Si está migrando servicios desde JBossMQ (u otro proveedor JMS) a JBoss Messaging, necesitará comprender estos archivos de configuración. En este capítulo vamos a discutir cómo configurar varios servicios dentro de JBoss Messaging, los cuales trabajan juntos para proporcionar servicios a nivel de API JMS a las aplicaciones de clientes.
fr_fr: JMS API précise comment un client entrain de traiter des messages interacte avec le serveur un messagerie. La définition exacte et l'implémentation des services de messagerie, comme les destinations de message et les usines de connexion, sont particulières aux providers JBoss. JBoss Messaging comprend ses propres fichiers pour configurer les services. Si vous migrez des services de JBossMQ (ou d'un autre provider JMS) vers JBoss Messaging, vous devrez comprendre ces fichiers de configuration. Dans ce chapitre, nous discuterons comment configurer les différents services dans JBoss Messaging, qui contribuent ensemble à procurer des services de niveau JMS API aux applications client.
ja_jp: JMS API はメッセージングクライアントがメッセージングサーバーと交流する方法を 指定します。メッセージ 送り先 や接続ファクトリなどのメッセージングサービスの 厳密な定義と実装は JMS プロバイダーに特有なものです。JBoss Messaging は サービスを設定するためにそれ自身の設定ファイルを持っています。サービスを JBossMQ (又は他の JMS プロバイダー) から JBoss Messaging に移行している場合は、 これらの設定ファイルを理解する必要があります。この章では、JBoss Messaging 内で 各種のサービスを設定する方法を説明していますが、これらの各種サービスが一緒に機能して クライアントアプリケーションに JMS API レベルのサービスを提供します。
pt_br: O JMS API especifica como um cliente messaging interage com um servidor messaging. A definição exata e implementação de serviços de mensagem, tais como destinações de mensagem e criações de conexão, são especificadas para os provedores JMS. O JBoss Messaging possui os seus próprios arquivos de configuração para configurar serviços. Caso você esteja migrando serviços do JBossMQ (ou outro provedor JMS) para o JBoss Messaging, você precisará entender estes arquivos de configuração. Neste capítulo, iremos relatar como configurar vários serviços dentro do JBoss Messaging, dos quais trabalham juntos para fornecer os serviços de nível de serviço JMS API para aplicativos de cliente.
zh_cn: JMS API 指定消息客户端怎样和服务器进行交互。消息服务的确切定义和实现，如消息目的地和连接工厂，都是 JMS 提供者所专有的。JBoss Messaging 具有自己的配置文件来对服务进行配置。如果你准备从 JBossMQ（或其他 JMS 提供者）移植服务到 JBoss Messaging 里，你需要理解这些配置文件。在本章我们将讨论如何配置 JBoss Messaging 里的不同服务，使其为客户应用程序提供 JMS API 级的服务。

source: The JBoss Messaging service configuration is spread among several configuration files. Depending on the functionality provided by the services it configures, the configuration data is distributed between <filename>messaging-service.xml</filename>, <filename>remoting-bisocket-service.xml</filename>, <filename>xxx-persistence-service.xml (where xxx is the name of your database)</filename>, <filename>connection-factories-service.xml</filename> and <filename>destinations-service.xml</filename>.
es_es: La configuración del servicio de JBoss Messaging abarca varios archivos de configuración. Dependiendo de la funcionalidad que brindan los servicios que configura, los datos de configuración se distribuyen entre <filename>messaging-service.xml</filename>, <filename>remoting-bisocket-service.xml</filename>, <filename>xxx-persistence-service.xml (en donde xxx es el nombre de su base de datos)</filename>, <filename>connection-factories-service.xml</filename> y <filename>destinations-service.xml</filename>.
fr_fr: La configuration du service JBoss Messaging est répartie à travers plusieurs fichiers de configuration. Suivant la fonctionnalité offerte par les services qu'il configure, les données de configuration sont distribuées entre <filename>messaging-service.xml</filename>, <filename>remoting-bisocket-service.xml</filename>,<filename>xxx-persistence-service.xml (où xxx est le nom de votre base de données)</filename>, <filename>connection-factories-service.xml</filename> et <filename>destinations-service.xml</filename>.
ja_jp: JBoss Messaging サービスの設定は数種の設定ファイルに分散しています。 設定をするサービスが提供する機能に応じて設定データは、<filename>messaging-service.xml</filename>、 <filename>remoting-bisocket-service.xml</filename>、<filename>xxx-persistence-service.xml (ここで xxx とは 使用データベースの名前)</filename>、<filename>connection-factories-service.xml</filename>、 <filename>destinations-service.xml</filename> 内に分かれています。
pt_br: A configuração de serviço do JBoss Messaging é dispersada entre diversos arquivos de configuração. Dependendo da funcionalidade fornecida pelos serviços que ela configura, o dado de configuração é distribuído entre o <filename>messaging-service.xml</filename>, <filename>remoting-bisocket-service.xml</filename>, <filename>xxx-persistence-service.xml (onde xxx é o nome de seu banco de dados)</filename>, <filename>connection-factories-service.xml</filename> e <filename>destinations-service.xml</filename>.
zh_cn: JBoss Messaging 服务的配置分布在几个配置文件里。根据所配置服务的功能，配置数据分布在 <filename>messaging-service.xml</filename>、<filename>remoting-bisocket-service.xml</filename>、 <filename>xxx-persistence-service.xml（这里的 xxx 是数据库名）</filename>、<filename>connection-factories-service.xml</filename> 和 <filename>destinations-service.xml</filename> 里。

source: The AOP client-side and server-side interceptor stacks are configured in <filename>aop-messaging-client.xml</filename> and <filename>aop-messaging-server.xml</filename>. Normally you will not want to change them, but some of the interceptors can be removed to give a small performance increase, if you don't need them. Be very careful you have considered the security implications before removing the security interceptor.
es_es: Las pilas de interceptores del lado del servidor y el AOP de lado del cliente se configuran en <filename>aop-messaging-client.xml</filename> y <filename>aop-messaging-server.xml</filename>. Usualmente usted no querrá cambiarlos pero algunos de los interceptores se pueden remover para poder incrementar el rendimiento un poco, en caso de que no los necesite. Antes de remover el interceptor de seguridad tenga mucho cuidado en tener en consideración las implicaciones en la seguridad.
fr_fr: Les piles d'intercepteurs AOP côté-client et côté-serveur sont configurées dans <filename>aop-messaging-client.xml</filename> et <filename>aop-messaging-server.xml</filename>. Normalement, vous ne souhaiterez pas les changer, mais certains intercepteurs peuvent être retirés pour améliorer légèrement la performance, si vous n'en avez pas besoin. Soyez sûrs de bien avoir considéré les implications au niveau de la sécurité avant de retirer l'intercepteur de sécurité.
ja_jp: AOP クライアントサイドとサーバーサイドのインターセプタースタックは <filename>aop-messaging-client.xml</filename> と <filename>aop-messaging-server.xml</filename> 内で設定されています。通常、これらは変更すべきではありませんが、 必要がない場合は少々のパフォーマンス向上の目的で、インターセプターの一部は削除することができます。しかし、 セキュリティインターセプターを削除する前にセキュリティへの影響について十分に注意してください。
pt_br: As pilhas do interceptor ao lado do servidor e ao lado do cliente AOP estão configuradas em <filename>aop-messaging-client.xml</filename> e <filename>aop-messaging-server.xml</filename>. Normalmente, você não desejará modificá-las, mas alguns dos interceptores poderão ser removidos para fornecer um pequeno aumento de desempenho, caso você não precise dos mesmos. Seja bastante cauteloso, uma vez que você terá que considerar as implicações de segurança antes de remover o interceptor de segurança.
zh_cn: AOP 客户端和服务器端的拦截器栈在 <filename>aop-messaging-client.xml</filename> 和 <filename>aop-messaging-server.xml</filename> 里进行配置。通常你不用改动它们，但你可以删除某些不需要的拦截器来小幅提高性能。在删除安全拦截器（security interceptor）之前，请先仔细考虑安全隐患。

source: Configuring the ServerPeer
es_es: Configuración del ServerPeer
fr_fr: Configurer ServerPeer
ja_jp: ServerPeer の設定
pt_br: Configuração do ServerPeer
zh_cn: 配置 ServerPeer

source: The Server Peer is the heart of the JBoss Messaging JMS facade. The server's configuration, resides in <filename>messaging-service.xml</filename> configuration file.
es_es: El Server Peer es el corazón de la fachada de JBoss Messaging JMS. La configuración del servidor se encuentra en el archivo de configuración <filename>messaging-service.xml</filename>.
fr_fr: Server Peer est au coeur de la vitrine JBoss Messaging. La configuration du serveur se trouve dans le fichier de configuration <filename>messaging-service.xml</filename>.
ja_jp: サーバーピアは JBoss Messaging JMS 表層部の中核となるものです。サーバーの設定は、 <filename>messaging-service.xml</filename> 設定ファイルの中に存在します。
pt_br: O Servidor Peer é a parte principal do JBoss Messaging JMS facade. A configuração do servidor reside no arquivo de configuração <filename>messaging-service.xml</filename>.
zh_cn: Server Peer 是 JBoss Messaging JMS facade 的核心。相关服务器的配置位于 <filename>messaging-service.xml</filename> 文件里。

source: All JBoss Messaging services are rooted at the server peer.
es_es: Todos los servicios de JBoss Messaging tienen raíz en el servidor compañero.
fr_fr: Tous les services JBoss Messaging sont enracinés dans le Server Peer.
ja_jp: 全ての JBoss Messaging サービスは、サーバーピアを根源にしています。
pt_br: Todos os serviços do JBoss Messaging estão enraizados ao servidor peer.
zh_cn: 所有的 JBoss Messaging 服务在 server peer 里都以根用户运行。

source: An example of a Server Peer configuration is presented below. Note that not all values for the server peer's attributes are specified in the example
es_es: A continuación encontrará un ejemplo de una configuración de un servidor compañero. Observe que no todos los valores para los atributos del servidor compañero se especifican en el ejemplo.
fr_fr: Nous présentons ci-dessous un exemple de configuration du Server Peer. Notez bien que toutes les valeurs des attributs du Server Peer sont spécifiées dans l'exemple.
ja_jp: サーバーピア設定のサンプルは以下に提示してあります。サーバーピアの属性用の 全ての値がこのサンプルで指定されていないことに注意してください。
pt_br: Segue abaixo, um exemplo da configuração. Perceba que nem todos os valores para os atributos do servidor peer estão especificados no exemplo.
zh_cn: 下面是一个 Server Peer 配置的例子。请注意这个例子并没有指定所有 Server Peer 属性的值。

source: SECURITY RISK! To avoid a security risk, you MUST specify the value of the attribute SuckerPassword in the Server Peer config (messaging-service.xml). If you do not specify a value, the default value will be used. Any person that knows the default value will be able to access to all destinations on the server. The password chosen should only be exposed to administrators
es_es: RIESGO DE SEGURIDAD! Para evitar un riesgo de seguridad, tiene que especificar el valor del atributo SuckerPassword en la configuración del servidor compañero (messaging-service.xml). Si no especifica un valor entonces se utiliza el valor predeterminado. Cualquier persona que conozca el valor predeterminado podrá acceder a todos los destinos en el servidor. La contraseña elegida sólo la deben conocer los administradores
fr_fr: SECURITY RISK! (RISQUE DE SÉCURITÉ) Afin d'éviter un risque de sécurité, vous DEVEZ préciser la valeur de l'attribut SuckerPassword dans la config du Server Peer (messaging-service.xml). Si vous ne précisez pas de valeur, on utilisera la valeur par défaut. Toute personne qui connaît la valeur par défaut pourra accéder à toutes les destinations sur le serveur. Le mot de passe sélectionné ne doit être connu que par les administrateurs.
ja_jp: セキュリティリスク!：セキュリティリスクを避ける為に、サーバーピア設定 (messaging-service.xml) 内で 属性 SuckerPassword の値を指定しなければなりません。この値を指定しないと、デフォルト値が使用されます。 その場合、このデフォルト値を知る全ての人がサーバー上の全ての送り先にアクセスできるようになってしまいます。 選択したパスワードは管理者のみに知られるべきものです。
pt_br: SECURITY RISK! Para evitar um risco de segurança, você DEVERÁ especificar o atributo SuckerPassword no Server Peer config (messaging-service.xml). Caso você não especifique o valor, o valor padrão será utilizado. Qualquer pessoa que possuir conhecimento do valor padrão, estará apto a acessar todas as destinações no servidor. A senha escolhida deve ser apenas disponível a administradores.
zh_cn: 安全风险！要避免安全风险，你必须指定 Server Peer 配置文件（messaging-service.xml）里的 SuckerPassword 属性的值。如果你没有进行指定，缺省值将被使用。任何知道缺省值的人都可以访问服务器上的所有目的地。只有管理员才应该知道这个密码。

source: ServerPeer attributes
es_es: Atributos del ServerPeer
fr_fr: Attributs ServerPeer
ja_jp: ServerPeer 属性
pt_br: Atributos do ServerPeer
zh_cn: ServerPeer 的属性

source: We will now discuss the MBean attributes of the ServerPeer MBean.
es_es: Vamos a discutir los atributos MBean del ServerPeer MBean.
fr_fr: Nous allons maintenant discuter les attributs MBean du ServerPeer MBean.
ja_jp: ServerPeer MBean の MBean 属性について説明します。
pt_br: Iremos discutir agora os atributos do ServerPeer MBean.
zh_cn: 现在我们将讨论 ServerPeer MBean 的 MBean 属性。

source: The unique id of the server peer. Every node you deploy MUST have a unique id. This applies to different nodes that form a cluster as well as nodes that are only linked via a message bridge. The id must be a valid integer.
es_es: El id único del servidor compañero. Todo nodo que despliegue tiene que tener un id único. Esto aplica a diferentes nodos que forman un clúster así como a los nodos que sólo están vinculados por medio de un puente de mensajes. El id debe ser un número entero válido.
fr_fr: L'id unique du Server Peer. Chaque noeud que vous déployez DOIT posséder sa propre id. Ceci s'applique à différents noeuds qui forment un groupement, ainsi qu'à des noeuds qui sont uniquement liés par un pont de messagerie. L'id doit être un entier relatif valide.
ja_jp: サーバーピアの特有な id です。デプロイする全てのノードは特有の id を持たなければなりません。 これはクラスターを構成する異なるノード群にも、そしてメッセージブリッジ経由でのみリンク されているノードにも当てはまります。id は有効な整数でなければなりません。
pt_br: A id única do servidor peer. Cada nó que você implementa DEVE possuir uma id única. Isto é aplicado a nós diferentes que compõem um cluster, assim como os nós que estão apenas ligados através de uma mensagem de interligação. A id deve ser um número válido.
zh_cn: Server peer 的唯一 ID。你部署的每个节点都必须有唯一的 ID。这适用于组成群集的不同节点，也适用于仅通过消息桥链接的节点。这个 ID 必须为有效的整型值。

source: The default JNDI context to use when binding queues. Defaults to /queue.
es_es: El contexto JNDI predeterminado a utilizar al vincular colas. Por defecto es /queue.
fr_fr: Le contexte JNDI à utiliser par défaut lorsqu'on relie les files d'attente.
ja_jp: キューをバインドする時に使用するデフォルトの JNDI コンテキストです。/queue にデフォルトとなります。
pt_br: O contexto JNDI padrão de uso, quando as filas estiverem sofrendo o binding. Os padrões estão para /queue.
zh_cn: 绑定队列时使用的缺省 JNDI 上下文。缺省为 /queue。

source: The default JNDI context to use when binding topics. Defaults to /topic.
es_es: El contexto JNDI predeterminado al utilizar al vincular temas. Por defecto es /topic.
fr_fr: Contexte JNDI par défaut à utiliser quand on relie les sujets. Défauts de /topic.
ja_jp: トピックをバインドする時に使用するデフォルトの JNDI コンテキストです。/topic にデフォルトとなります。
pt_br: O contexto JNDI padrão de uso, quando os tópicos estiverem sofrendo binding. Os padrões estão para /topic.
zh_cn: 绑定主题时使用的缺省 JNDI 上下文。缺省为 /topic。

source: This is the post office that the ServerPeer uses. Normally, you wouldn't have to change this attribute. The post office is responsible for routing messages to queues and maintaining the mapping between addresses and queues.
es_es: Esta es la oficina postal que el ServerPeer utiliza. Usualmente no es necesario que cambie este atributo. La oficina postal es la responsable de enrutar los mensajes a colas y mantener el mapeo entre direcciones y colas.
fr_fr: Il s'agit du Post office que le ServerPeer utilise. Normalement, vous n'avez pas besoin de changer cet attribut. Le Post office est responsable de diriger les messages vers les files d'attente et de maintenir le mapping entre les adressses et les files d'attente.
ja_jp: ServerPeer が使用するポストオフィスです。通常、この属性は変更する必要はありません。 ポストオフィスはキューへのメッセージのルーティング、及びアドレスとキュー 間のマッピングの 維持を担当します。
pt_br: Este é o correio que o ServerPeer utiliza. Normalmente, você não precisaria modificar este atributo. O correio é responsável pelo roteamento de mensagens para filas e suporte do mapeamento entre endereços e filas.
zh_cn: 这是 ServerPeer 使用的邮局（Post Office）。通常，你不需要修改这个属性。邮局负责把消息转发至队列并维护地址和队列间的映射。

source: The JAAS security domain to be used by this server peer.
es_es: El dominio de seguridad JAAS a utilizar por este servidor compañero.
fr_fr: Le domaine de sécurité JAAS à utiliser par ce Server Peer.
ja_jp: このサーバーピアで使用される JAAS セキュリティドメインです。
pt_br: O domínio de segurança JAAS a ser usado pelo servidor peer.
zh_cn: 本 server peer 使用的 JAAS 安全域名。

source: Default security configuration is used when the security configuration for a specific queue or topic has not been overridden in the destination's deployment descriptor. It has exactly the same syntax and semantics as in JBossMQ.
es_es: La configuración de seguridad predeterminada se utiliza cuando la configuración de seguridad para una cola en específico o para un tema no se ha sobreescrito en el descriptor de despliegue del destino. Tiene exactamente la misma sintaxis y semántica que en JBossMQ.
fr_fr: La configuration de sécurité par défaut est utilisée lorsque la configuration de sécurité spécifique à une certaine file d'attente ou à un sujet n'a pas été supprimée dans le descripteur de déploiement d'une destination. La syntaxe et la sémantique sont exactement les mêmes que dans JBossMQ.
ja_jp: 特定のキューやトピック用のセキュリティ設定が送り先のデプロイメント記述子内で上書きされていない時に デフォルトのセキュリティ設定が使用されます。これは全く JBossMQ の構文とセマンティクスと 同じになります。
pt_br: A configuração de segurança padrão é usada quando a configuração de segurança for uma fila ou tópico específico do qual não está substituído no descritor de implementação de destinação. Isto possui exatamente a mesma sintaxe e semântica como se estivesse no JBossMQ.
zh_cn: 当特定队列或主题的安全配置没有覆盖目的地的部署描述符时，缺省的安全配置将被使用。它与在 JBossMQ 里的语法和模式完全相同。

source: The <literal>DefaultSecurityConfig</literal> attribute element should contain one <literal>&lt;security&gt;</literal> element. The <literal>&lt;security&gt;</literal> element can contain multiple <literal>&lt;role&gt;</literal> elements. Each <literal>&lt;role&gt;</literal> element defines the default access for that particular role.
es_es: El elemento atributo <literal>DefaultSecurityConfig</literal> debe contener un elemento <literal>&lt;security&gt;</literal>. El elemento <literal>&lt;security&gt;</literal> puede contener múltiples elementos <literal>&lt;role&gt;</literal>. Cada elemento <literal>&lt;role&gt;</literal> define el acceso predeterminado para ese rol en particular.
fr_fr: L'élément de l'attribut <literal>DefaultSecurityConfig</literal> doit comprendre un élément <literal>&lt;security&gt;</literal>. L'élément <literal>&lt;security&gt;</literal> peut comprendre plusieurs éléments <literal>&lt;role&gt;</literal>. Chaque élément <literal>&lt;role&gt;</literal> définit l'accès par défaut pour ce rôle particulier.
ja_jp: <literal>DefaultSecurityConfig</literal> 属性エレメントは <literal>&lt;security&gt;</literal> エレメントを１つ含んでいる必要があります。この <literal>&lt;security&gt;</literal> エレメントは 複数の <literal>&lt;role&gt;</literal> エレメントを含むことができます。各 <literal>&lt;role&gt;</literal> エレメントは特定の役割（role）用にデフォルトのアクセスを定義します。
pt_br: O elemento do atributo <literal>DefaultSecurityConfig</literal> deve conter um elemento <literal>&lt;security&gt;</literal>. O elemento <literal>&lt;security&gt;</literal> pode conter elementos <literal>&lt;role&gt;</literal> múltiplos. Cada elemento <literal>&lt;role&gt;</literal> define o acesso padrão para cada função em particular.
zh_cn: <literal>DefaultSecurityConfig</literal> 属性元素应该包含一个 <literal>&lt;security&gt;</literal> 元素。<literal>&lt;security&gt;</literal> 元素可以包含多个 <literal>&lt;role&gt;</literal> 元素。每个 <literal>&lt;role&gt;</literal> 元素都定义了特定角色的缺省访问权限。

source: If the <literal>read</literal> attribute is <literal>true</literal> then that role will be able to read (create consumers, receive messaages or browse) destinations by default.
es_es: Si el atributo <literal>read</literal> es <literal>true</literal> entonces ese role podrá leer (crear consumidores, recibir mensajes o navegar) destinos por defecto.
fr_fr: Si l'attribut <literal>read</literal> (lecture) est <literal>true</literal> (vrai), alors ce rôle sera en mesure de lire (créer des consommateurs, recevoir des messages ou naviguer) des destinations par défaut.
ja_jp: <literal>read</literal> 属性が <literal>true</literal> の場合、その役割はデフォルトで 送り先を読み込む （コンシューマの作成、メッセージの受信、閲覧など）ことができます。
pt_br: Caso o atributo <literal>read</literal> for <literal>true</literal>, então aquela função estará apta a ler (criar consumidores, receber mensagens ou navegar) destinações por padrão.
zh_cn: 如果 <literal>read</literal> 属性为 <literal>true</literal>，那么这个角色将缺省可以读取目的地（创建消费者、接收或浏览消息）。

source: If the <literal>write</literal> attribute is <literal>true</literal> then that role will be able to write (create producers or send messages) to destinations by default.
es_es: Si el atributo <literal>write</literal> es <literal>true</literal> entonces ese rol podrá escribir (crear productores o enviar mensajes) a destinos por defecto.
fr_fr: Si l'attribut <literal>write</literal> (écriture) est <literal>true</literal> (vrai), alors ce rôle sera en mesure d'écrire (de créer des producteurs ou d'envoyer des messages) vers les destinations par défaut.
ja_jp: <literal>write</literal> 属性が <literal>true</literal> の場合、その役割は デフォルトで 送り先に対して書き込む（プロデューサの作成、メッセージの送信） ことができます。
pt_br: Caso o atributo <literal>write</literal> for <literal>true</literal>, então aquela função estará apta a ler (criar produtores ou enviar mensagens) para destinações pelo padrão.
zh_cn: 如果 <literal>write</literal> 属性为 <literal>true</literal>，那么这个角色将缺省可以写入目的地（创建生产者或发送消息）。

source: If the <literal>create</literal> attribute is <literal>true</literal> then that role will be able to create durable subscriptions on topics by default.
es_es: Si el atributo <literal>create</literal> es <literal>true</literal> entonces ese rol podrá crear subscripciones durables en temas por defecto.
fr_fr: Si l'attribut <literal>create</literal> (créer) est <literal>true</literal> (vrai) alors ce rôle sera en mesure de créer des abonnements durables sur les sujets par défaut.
ja_jp: <literal>create</literal> 属性が <literal>true</literal> の場合、 その役割はデフォルトで トピック上に持続的なサブスクリプションを作成 できるようになります。
pt_br: Caso o atributo <literal>create</literal> for <literal>true</literal>, então aquela função estará apta a criar subscrições duráveis em tópicos pelo padrão.
zh_cn: 如果 <literal>create</literal> 属性为 <literal>true</literal>，那么这个角色将缺省可以创建主题上的可持久订阅。
