Repository: bobmcwhirter/jboss-messaging
Catalog: docs/EAP_4_3/JBoss_Messaging_User_Guide/*/Configuration.po
Languages: es_es, fr_fr, ja_jp, pt_br, zh_cn

source: Return the total number of non durable messages in all subscriptions of this topic.
es_es: Retorna el número total de mensajes no durables en todas las subscripciones de este tema.
fr_fr: Retourne le nombre total de messages non durables pour tous les abonnements de ce sujet.
ja_jp: このトピックの全てのサブスクリプション内の非継続メッセージの合計数を返します。
pt_br: Retorna o número total de mensagens não-duráveis em todas subscrições deste tópico.
zh_cn: 返回该主题的订阅的所有非持久性消息的个数。

source: The count of all subscriptions on this topic
es_es: El contador de todas las subscripciones en este tema
fr_fr: Le comptage pour tous les abonnements pour ce sujet.
ja_jp: このトピックの全てのサブスクリプションのカウント
pt_br: A contagem de todas as subscrições deste tópico.
zh_cn: 该主题上所有订阅的个数。

source: The count of all durable subscriptions on this topic
es_es: El conteo de todas las subscripciones durables en este tema
fr_fr: Le comptage pour tous les abonnements durables pour ce sujet
ja_jp: このトピックの全ての恒久サブスクリプションのカウント
pt_br: A contagem de todas subscrições deste tópico.
zh_cn: 该主题上所有持久性订阅的个数。

source: The count of all non durable subscriptions on this topic
es_es: El conteo de todas las subscripciones no durables en este tema
fr_fr: Le comptage pour tous les abonnements non durables pour ce sujet
ja_jp: このトピックの全ての非恒久サブスクリプションのカウント
pt_br: A contagem de todas subscrições não-duráveis deste tópico.
zh_cn: 该主题上所有非持久性订阅的个数。

source: MBean operations of the Topic MBean
es_es: Operaciones MBean del MBean Topic
fr_fr: Opérations MBean du sujet Topic MBean
ja_jp: Topic MBean の MBean オペレーション
pt_br: As operações MBean deste Tópico MBean.
zh_cn: Topic MBean 的 MBean 操作

source: Remove (and delete) all messages from the subscriptions of this topic.
es_es: Remueve (y borra) todos los mensajes de las subscripciones de este tema.
fr_fr: Enlever (et supprimer) tous les messages des abonnements pour ce sujet.
ja_jp: このトピックのサブスクリプションからの全てのメッセージを取り除く（削除）。
pt_br: Remove (e deleta) todas as mensagens das subscrições deste tópico.
zh_cn: 从该主题的订阅里移除（并删除）所有消息。

source: Use this with caution. It will permanently delete all messages from the topic
es_es: Utilice esto con precaución ya que borrará permanentemente todos los mensajes del tema
fr_fr: A utiliser avec soin. Cela va effacer tous les messages en provenance du sujet de façon permanente
ja_jp: この使用には要注意。これは全てのメッセージをトピックから永久的に削除します。
pt_br: Utilize isto com cuidado. Isto deletará permanentemente todas as mensagens do tópico.
zh_cn: 请小心使用这个操作。它将永久地删除主题里的所有消息。

source: List all subscriptions of this topic
es_es: Lista todas las subscripciones de este tema
fr_fr: Liste tous les abonnements pour ce sujet
ja_jp: このトピックの全てのサブスクリプションを一覧表示
pt_br: Lista todas as subscrições deste tópico.
zh_cn: 列出该主题的所有订阅。

source: List all durable subscriptions of this topic
es_es: Lista todas las subscripciones durables de este tema
fr_fr: Liste tous les abonnements durables pour ce sujet
ja_jp: このトピックの全ての恒久サブスクリプションを一覧表示
pt_br: Lista todas as subscrições duráveis deste tópico.
zh_cn: 列出该主题的所有持久性订阅。

source: List all non durable subscriptions of this topic
es_es: Lista todas las subscripciones no durables de este tema
fr_fr: Liste tous les abonnements non durables pour ce sujet
ja_jp: このトピックの全ての非恒久サブスクリプションを一覧表示
pt_br: Lista todas as subscrições não-duráveis deste tópico.
zh_cn: 列出该主题的所有非持久性订阅。

source: List all subscriptions of this topic in an easy to display HTML format
es_es: Lista todas las subscripciones de este tema en un formato HTML de fácil presentación
fr_fr: Liste tous les abonnements pour ce sujet dans un format HTML facile à afficher
ja_jp: このトピックの全てのサブスクリプションを表示の簡単な HTML 形式で一覧表示
pt_br: Lista todas subscrições deste tópico numa maneira simples de se exibir o formato HTML.
zh_cn: 以 HTML 形式列出该主题的所有订阅。

source: List all durable subscriptions of this topic in an easy to display HTML format
es_es: Lista todas las subscripciones durables de este tema en un formato HTML de fácil presentación
fr_fr: Liste tous les abonnements durables pour ce sujet dans un format HTML facile à afficher
ja_jp: このトピックの全ての恒久サブスクリプションを表示の簡単な HTML 形式で一覧表示
pt_br: Lista todas as subscrições duráveis deste tópico de forma fácil de se exibir o formato HTML.
zh_cn: 以 HTML 形式列出该主题的所有持久性订阅。

source: List all non durable subscriptions of this topic in an easy to display HTML format
es_es: Lista todas las subscripciones no durables de este tema en un formato HTML de fácil presentación
fr_fr: Liste tous les abonnements non durables pour ce sujet dans un format HTML facile à afficher
ja_jp: このトピックの全ての非恒久サブスクリプションを表示し易い HTML 形式で 一覧表示
pt_br: Lista todas as subscrições não-duráveis deste tópico de forma simples de se exibir o formato HTML.
zh_cn: 以 HTML 形式列出该主题的所有非持久性订阅。

source: Lists all messages for the specified subscription.
es_es: Lista todos los mensajes para la subscripción especificada.
fr_fr: Liste tous les messages pour un abonnement spécifique
ja_jp: 指定したサブスクリプション用の全てのメッセージを一覧表示
pt_br: Lista todas as mensagens para a especificada subscrição.
zh_cn: 列出指定订阅的所有消息。

source: There are two overloaded versions of this operation. One that takes a selector and one that does not. By specifyingthe selector you can limit the messages returned.
es_es: Hay dos versiones sobrecargadas de esta operación. Una que toma un selector y una que no. Al especificar el selector puede limitar los mensajes retornados.
fr_fr: Il existe deux versions surchargées de cette opération. L'une d'entre elles implique un sélecteur et l'autre non. En précisant le sélecteur, vous pouvez limiter le nombre de messages retournés.
ja_jp: このオペレーションには２つのオーバーロードしたバージョンがあります。その１つは セクターを使用し、もう１つはそれを使用しません。セクターを指定すると、返還される メッセージを制限できます。
pt_br: Existem duas versões sobrecarregadas desta operação. Uma delas usa um seletor e a outra não. Especificando o seletor, você poderá limitar as mensagens retornadas.
zh_cn: 这个操作有两个重载版本。其中一个使用 selector 而另外一个则不使用。通过指定 selector，你可以限制返回的消息。

source: Lists all non durable messages for the specified subscription.
es_es: Lista todos los mensajes no durables para la subscripción especificada.
fr_fr: Liste les messages non durables pour un abonnement spécifique.
ja_jp: 指定したサブスクリプション用の全ての非継続メッセージを一覧表示。
pt_br: Lista todas as mensagens não-duráveis para a especificada subscrição.
zh_cn: 列出指定订阅的所有非持久性消息。

source: Lists all durable messages for the specified subscription.
es_es: Lista todos los mensajes durables para la subscripción especificada.
fr_fr: Liste tous les messages durables pour un abonnement spécifique
ja_jp: 指定したサブスクリプション用の全ての継続メッセージを一覧表示。
pt_br: Lista todas as mensagens duráveis para a especificada subscrição.
zh_cn: 列出指定订阅的所有持久性消息。

source: Configuring Connection Factories
es_es: Configuración de fábricas de conexión
fr_fr: Configurer les usines de connexion
ja_jp: 接続ファクトリの設定
pt_br: Configurando Criações de Conexão
zh_cn: 配置连接工厂

source: With the default configuration JBoss Messaging binds two connection factories in JNDI at start-up.
es_es: Con la configuración predeterminada JBoss Messaging vincula dos fábricas de conexiones en JNDI en el arranque.
fr_fr: Dans la configuration par défaut, JBoss Messaging relie deux usines de connexion dans JNDI au démarrage.
ja_jp: デフォルトの設定で、JBoss Messaging は起動時に JNDI 内で ２つの接続ファクトリをバインドします。
pt_br: O JBoss Messaging de configuração padrão vincula duas criações de conexão em JNDI na inicialização.
zh_cn: 在启动时，JBoss Messaging 用缺省的配置在 JNDI 里构建了两个连接工厂。

source: The first connection factory is the default non-clustered connection factory and is bound into the following JNDI contexts: <literal>/ConnectionFactory, /XAConnectionFactory, java:/ConnectionFactory, java:/XAConnectionFactory</literal>. This connection factory is provided to maintain compatibility with applications originally written against JBoss MQ which has no automatic failover or load balancing. This connection factory should be used if you do not require client side automatic failover or load balancing.
es_es: La primera fábrica de conexiones es la fábrica de conexiones sin clústers predeterminada y se vincula a los siguientes contextos JNDI: <literal>/ConnectionFactory, /XAConnectionFactory, java:/ConnectionFactory, java:/XAConnectionFactory</literal>. Esta fábrica de conexiones se proporciona para mantener compatibilidad con las aplicaciones que originalmente se escribieron frente a JBoss MQ, el cual no tiene conmutación automática de servidor en caso de fallos ni balanceo de carga. Esta fábrica de conexiones se debe utilizar si no requiere conmutación de servidor en caso de fallos o balaceo de carga automáticos.
fr_fr: La première usine de connexion est l'usine de connexion non-groupée par défaut, qui est liée aux contextes JNDI suivants: <literal>/ConnectionFactory, /XAConnectionFactory, java:/ConnectionFactory, java:/XAConnectionFactory</literal>. Cette usine de connexion est fournie pour garantir la compatibilité avec les applications écrites à l'origine sur le format JBoss MQ, sans reprise automatique, ni équilibrage des charges de travail. Cette usine de connexion devra être utilisée si vous n'avez pas besoin de reprise automatique du côté du client, ni besoin de système d'équilibrage des charges de travail.
ja_jp: １つめの接続ファクトリはデフォルトのクラスターに対応していない接続ファクトリであり、 これは以下の JNDI コンテキストにバインドされています: <literal>/ConnectionFactory, /XAConnectionFactory, java:/ConnectionFactory, java:/XAConnectionFactory</literal> この接続ファクトリは、元来 自動フェイルオーバーや ロードバランシングのない JBoss MQ に対して書かれたアプリケーションへの互換性を維持する為に提供されています。 この接続ファクトリは、クライアント側の自動フェイルオーバーやロードバランシングが 必要ない場合に使用されるべきものです。
pt_br: A primeira criação de conexão é a criação de conexão sem cluster padrão e é vinculada nos seguintes contextos JNDI: <literal>/ConnectionFactory, /XAConnectionFactory, java:/ConnectionFactory, java:/XAConnectionFactory</literal>. Esta criação de conexão é fornecida para manter compatibilidade com os aplicativos originalmente gravados em referência ao JBoss MQ, do qual não possui failover automático ou carregamento balanceado. Esta criação de conexão deve ser usada caso você não queira o failover automático ao lado do cliente ou carregamento automático.
zh_cn: 第一个连接工厂是缺省的非群集连接工厂，它绑定在下面的 JNDI 上下文里：<literal>/ConnectionFactory, /XAConnectionFactory, java:/ConnectionFactory, java:/XAConnectionFactory</literal>。这个连接工厂用来兼容原来针对 JBoss MQ 编写的没有自动失效切换或负载平衡功能的应用程序。如果你不要求客户端的自动失效切换或负载平衡，你应该使用它。

source: The second connection factory is the default clustered connection factory and is bound into the following JNDI contexts <literal>/ClusteredConnectionFactory, /ClusteredXAConnectionFactory, java:/ClusteredConnectionFactory, java:/ClusteredXAConnectionFactory</literal>.
es_es: La segunda fábrica de conexiones es la fábrica predeterminada de conexiones en clúster y está vinculada a los siguientes contextos JNDI <literal>/ClusteredConnectionFactory, /ClusteredXAConnectionFactory, java:/ClusteredConnectionFactory, java:/ClusteredXAConnectionFactory</literal>.
fr_fr: La deuxième usine de connexion est l'usine de connexion groupée par défaut, qui est liée aux contextes JNDI suivants <literal>/ClusteredConnectionFactory, /ClusteredXAConnectionFactory, java:/ClusteredConnectionFactory, java:/ClusteredXAConnectionFactory</literal>.
ja_jp: ２つめの接続ファクトリはデフォルトのクラスター化接続ファクトリであり、これは 以下の JNDI コンテキストにバインドされています：<literal>/ClusteredConnectionFactory, /ClusteredXAConnectionFactory, java:/ClusteredConnectionFactory, java:/ClusteredXAConnectionFactory</literal>
pt_br: A segunda criação de conexão é a criação de conexão com cluster padrão e é vinculada nos seguintes contextos JNDI: <literal>/ClusteredConnectionFactory, /ClusteredXAConnectionFactory, java:/ClusteredConnectionFactory, java:/ClusteredXAConnectionFactory</literal>.
zh_cn: 第二个连接工厂是缺省的群集连接工厂，它绑定在下面的 JNDI 上下文里：<literal>/ClusteredConnectionFactory, /ClusteredXAConnectionFactory, java:/ClusteredConnectionFactory, java:/ClusteredXAConnectionFactory</literal>。

source: You may want to configure additional connection factories, for instance if you want to provide a default client id for a connection factory, or if you want to bind it in different places in JNDI, if you want different connection factories to use different transports, or if you want to selective enable or disable load-balancing and/or automatic failover for a particular connection factory. Deploying a new connection factory is equivalent with adding a new ConnectionFactory MBean configuration to <filename>connection-factories-service.xml</filename>.
es_es: Es posible que quiera configurar fábricas de conexiones adicionales, por ejemplo, si quiere brindar un id de cliente predeterminado para una fábrica de conexiones o si quiere vincularlo en diferentes lugares en JNDI, si quiere que diferentes fábricas de conexiones utilicen diferentes transportes o si quiere activar o desactivar selectivamente el balanceo de carga y/o la conmutación de servidor en caso de fallo para una fábrica de conexiones en particular. El implementar una nueva fábrica de conexiones es equivalente que el añadir una nueva configuración MBean ConnectionFactory a <filename>connection-factories-service.xml</filename>.
fr_fr: Vous souhaiterez peut-être configurer des usines de connexion supplémentaires, par exemple si vous souhaitez fournir une id client par défaut pour une usine de connexion, ou si vous souhaitez la relier à différents endroits dans JNDI, si vous souhaitez des usines de connexion différentes pour utiliser des transports différents, ou si vous souhaitez sélectivement activer ou désactiver l'équilibre des charges de travail et/ou la reprise automatique pour une usine de connexion en particulier. Le déploiement d'une nouvelles connexion équivaut à ajouter une nouvelle configuration ConnectionFActory MBean à <filename>connection-factories-service.xml</filename>.
ja_jp: 追加の接続ファクトリを設定したいことがあるかも知れません。例えば、１つの接続ファクトリ用の デフォルトのクライアントアイデンティティを提供したり、 又はそれを JNDI 内の別の場所に バインドしたり、異なるトランスポートを使用する為に異なる接続ファクトリを持ったり、あるいは特定の 接続ファクトリの為にロードバランシングや自動フェイルオーバーの有効化/無効化を選択したり したい場合などです。新規の接続ファクトリをデプロイすることは、新規の ConnectionFactory MBean 設定を <filename>connection-factories-service.xml</filename> に追加することを同じになります。
pt_br: A implementação de uma nova criação de conexão é equivalente a adição de uma nova configuração ConnectionFactory MBean à <filename>connection-factories-service.xml</filename>. Caso você queira configurar criações de conexão adicional, por exemplo: se você quiser fornecer uma id de cliente padrão para uma criação de conexão diferente para usar transportes diferentes, ou caso você queira vinculá-la a lugares diferentes em JNDI. Adicionado a isto, se você quiser que criações de conexão diferente usem diferentes transportes, ou ainda, se você quiser selecionar a ativação ou desativação do failover automático e/ou carregamento balanceado para uma criação de conexão específica.
zh_cn: 你可能想配置其他的连接工厂，例如，你想为连接工厂提供缺省的客户 ID、或者想绑定到不同的 JNDI 位置、或让不同的连接工厂使用不同的传输协议、或选择性地为某个特定的连接工厂启用或禁止负载平衡和/或自动失效切换。在 <filename>connection-factories-service.xml</filename> 里添加新的 ConnectionFactory MBean 配置就可以部署新的连接工厂。

source: It is also possible to create an entirely new service deployment descriptor <filename>xxx-service.xml</filename> altogether and deploy it in <filename>$JBOSS_HOME/server/messaging/deploy</filename>.
es_es: También es posible crear un descriptor de despliegue de servicio completamente nuevo <filename>xxx-service.xml</filename> y desplegarlo en <filename>$JBOSS_HOME/server/messaging/deploy</filename>.
fr_fr: Il est également possible de créer un descripteur de déploiement de service entièrement nouveau <filename>xxx-service.xml</filename> et de le déployer dans <filename>$JBOSS_HOME/server/messaging/deploy</filename>.
ja_jp: 全面的 全く新しいサービスデプロイメント記述子 <filename>xxx-service.xml</filename> を作成して、それを <filename>$JBOSS_HOME/server/messaging/deploy</filename> に デプロイすることが可能です。
pt_br: É também possível criar um completo descritor de implementação de novo serviço <filename>xxx-service.xml</filename> e implementá-lo em <filename>$JBOSS_HOME/server/messaging/deploy</filename>.
zh_cn: 你也可以创建一个完全新的服务部署描述符 <filename>xxx-service.xml</filename> 并部署在 <filename>$JBOSS_HOME/server/messaging/deploy</filename> 里。

source: Connection factories can support automatic failover and/or load-balancing by setting the corresponding attributes
es_es: Las fábricas de conexiones pueden soportar la conmutación automática de servidores en caso de fallo y/o el balanceo de carga configurando los atributos correspondientes.
fr_fr: Les usines de connexion peuvent supporter les reprises automatiques et/ou les équilibrages de charge de travail en configurant les attributs suivants
ja_jp: 接続ファクトリは該当する属性をセットすることで、自動フェイルオーバー/ロードバランスを サポートすることができます。
pt_br: As criações de conexão podem suportar automaticamente o failover e/ou o carregamento-balanceado pela configuração dos atributos correspondentes.
zh_cn: 通过设置相关属性，连接工厂也可以支持自动失效切换和/或负载平衡。

source: An example connection factory configuration is presented below:
es_es: A continuación puede ver una configuración de ejemplo de la fábrica de conexiones:
fr_fr: Une configuration d'usine de connexion est présentée ci-dessous:
ja_jp: 接続ファクトリ設定のサンプルは以下に示してあります:
pt_br: Um exemplo de configuração de criação de conexão é apresentado abaixo:
zh_cn: 下面是一个连接工厂配置的例子：

source: The above example would create a connection factory with pre-configured client ID <literal>myClientID</literal> and bind the connection factory in two places in the JNDI tree: <literal>/MyConnectionFactory</literal> and <literal>/factories/cf</literal>. The connection factory overrides the default values for PreFetchSize, DefaultTempQueueFullSize, DefaultTempQueuePageSize, DefaultTempQueueDownCacheSize and DupsOKBatchSize, SupportsFailover, SupportsLoadBalancing and LoadBalancingFactory. The connection factory will use the default remoting connector. To use a different remoting connector with the connection factory change the <literal>Connector</literal> attribute to specify the service name of the connector you wish to use.
es_es: El ejemplo anterior crearía una fábrica de conexiones con ID de cliente pre-configurado <literal>myClientID</literal> y vincularía la fábrica de conexiones en dos lugares en el árbol JNDI: <literal>/MyConnectionFactory</literal> y <literal>/factories/cf</literal>. La fábrica de conexiones sobreescribe los valores predeterminados para PreFetchSize, DefaultTempQueueFullSize, DefaultTempQueuePageSize, DefaultTempQueueDownCacheSize y DupsOKBatchSize, SupportsFailover, SupportsLoadBalancing y LoadBalancingFactory. La fábrica de conexiones utilizará el conector remoto predeterminado. Para utilizar un conector remoto diferente con la fábrica de conexiones cambie el atributo <literal>Connector</literal> para especificar el nombre del servicio del conector que quiere utilizar.
fr_fr: L'exemple ci-dessus créerait une usine de connexion ayant pour ID client pré-configuré <literal>myClientID</literal> et reliant l'usine de connexion à deux endroits dans l'arborescence JNDI: <literal>/MyConnectionFactory</literal> et <literal>/factories/cf</literal>. L'usine de connexion remplace les valeurs par défaut pour PreFetchSize, DefaultTempQueueFullSize, DefaultTempQueuePageSize, DefaultTempQueueDownCacheSize et DupsOKBatchSize, SupportsFailover, SupportsLoadBalancing et LoadBalancingFactory. L'usine de connexion va utiliser le connecteur d'appel à distance (remoting). Pour utiliser un connecteur d'appel à distance en combinaison avec une usine de connexion, changer l'attribut <literal>Connector</literal> pour spécifier le nom du service du connecteur que vous souhaitez utiliser.
ja_jp: 上記の例では、事前設定のクライアントアイデンティティ <literal>myClientID</literal> を 利用して接続ファクトリの作成をして、JNDI ツリー内の ２つの場所: <literal>/MyConnectionFactory</literal> と <literal>/factories/cf</literal> に接続ファクトリをバインドしています。この接続ファクトリは PreFetchSize, DefaultTempQueueFullSize, DefaultTempQueuePageSize, DefaultTempQueueDownCacheSize と DupsOKBatchSize, SupportsFailover, SupportsLoadBalancing 及び LoadBalancingFactory などのデフォルト値を上書きします。 この接続ファクトリはデフォルトの remoting connector を使用することになります。異なる remoting connector を この接続ファクトリで使用するには、<literal>Connector</literal> 属性を変更して使用したい connector のサービス名を 指定します。
pt_br: O exemplo acima poderia produzir a criação de conexão com a ID do cliente pré-configurada <literal>myClientID</literal> e vincular a criação de conexão em dois diferentes lugares na árvore JNDI: <literal>/MyConnectionFactory</literal> e <literal>/factories/cf</literal>. A criação de conexão substitui os valores padrões para PreFetchSize, DefaultTempQueueFullSize, DefaultTempQueuePageSize, DefaultTempQueueDownCacheSize e DupsOKBatchSize, SupportsFailover, SupportsLoadBalancing e LoadBalancingFactory. A criação de conexão usará o conector de remoção padrão. Para usar um conector remoto diferente com a de criação de conexão, mude o atributo do <literal>Connector</literal> para especificar o nome do serviço do conector que você deseja usar.
zh_cn: 上面的例子将创建一个带有预配置客户 ID <literal>myClientID</literal> 的连接工厂并绑定在 JNDI 树的两个地方：<literal>/MyConnectionFactory</literal> 和 <literal>/factories/cf</literal>。这个连接工厂覆盖了 PreFetchSize、DefaultTempQueueFullSize、DefaultTempQueuePageSize、DefaultTempQueueDownCacheSize 和 DupsOKBatchSize 的缺省值。它将使用缺省的远程连接器（remoting connector）。要使用不同的远程连接器，你可以修改 <literal>Connector</literal> 属性来指定连接器的服务名。

source: MBean attributes of the ConnectionFactory MBean
es_es: Atributos MBean del MBean ConnectionFactory
fr_fr: Les attributs MBean de l'usine ConnectionFActory MBean
ja_jp: 接続ファクトリ MBean の MBean 属性
pt_br: Os atributos do ConnectionFactory MBean
zh_cn: ConnectionFactory MBean 的 MBean 属性

source: Connection factories can be pre-configured with a client id. Any connections created using this connection factory will obtain this client id
es_es: Las fábricas de conexiones se pueden pre-configurar con un id de cliente. Cualquier conexión creada utilizando esta fábrica de conexiones obtendrá este id de cliente
fr_fr: Les usines de connexion peuvent être pré-configurées avec un id client. Toute connexion créée à partir de cette usine de connexion obtiendra cette id client
ja_jp: 接続ファクトリはクライアントアイデンティティを利用して事前設定することが できます。この接続ファクトリを使用して作成された接続はいずれもこのクライアント アイデンティティを取得します。
pt_br: As criações de conexão podem ser pré-configuradas com a id do cliente. Qualquer conexão criada usando esta conexão obterá esta id do cliente.
zh_cn: 连接工厂可用 client id 进行预配置。使用这个连接工厂创建的任何连接都将获得这个 ID。

source: The list of the JNDI bindings for this connection factory
es_es: La lista de vínculos JNDI para esta fábrica de conexiones
fr_fr: La liste des mises en liaison JNDI pour cette usine de connexion
ja_jp: この接続ファクトリ用の JNDI バインディングの一覧
pt_br: A lista de bindings JNDI para esta criação de conexão.
zh_cn: 这个连接工厂使用的 JNDI 绑定的列表
