Repository: bobmcwhirter/jboss-messaging
Catalog: docs/EAP_4_3/JBoss_Messaging_User_Guide/*/Configuration.po
Languages: es_es, fr_fr, ja_jp, pt_br, zh_cn

source: The JMS user manager handles the mapping of pre-configured client IDs to users and also managers the user and role tables which may or may not be used depending on which login module you have configured
es_es: El administrador de usuarios de JMS maneja el mapeo de IDs pre-configurados de clientes a usuarios y también administra las tablas de usuarios y roles, las cuales puede que se utilicen o no dependiendo del módulo login que ha configurado.
fr_fr: Le gestionnaire de l'utilisateur JMS gère le mapping des IDs du client pré-configuré pour les utilisateurs et aussi gère les tables de rôle et d'utilisateur qui pourraient être ou ne pas être utilisées, suivant le module de login que vous avez configuré.
ja_jp: JMS ユーザーマネージャは、事前設定したクライアントアイデンティティのユーザーへのマッピングを 処理して更に、設定したログインモジュールに応じて 使用している、又は使用していないユーザーと役目のテーブルを管理します。
pt_br: O gerenciador do usuário JMS manuseia o mapeamento das IDs do cliente pré-configurado para usuários, além de gerenciar o usuário e outras tabelas que poderão ser usadas ou não, dependendo de qual módulo de logon você tenha configurado.
zh_cn: JMS user manager 处理预配置的客户 ID 和用户的映射，它也管理用户和角色表（其是否被使用取决于你所配置的登录模块）。

source: Here is an example JMSUserManager configuration
es_es: Este es un ejemplo de la configuración del JMSUserManager
fr_fr: Voici un exemple de la configuration JMSUserManager
ja_jp: JMSUserManager 設定のサンプルを以下に示します
pt_br: Segue abaixo, um exemplo da configuração JMSUserManager:
zh_cn: 下面是一个配置 JMSUserManager 的例子

source: MBean attributes of the JMSUserManager MBean
es_es: Atributos MBean del MBean JMSUserManager
fr_fr: Les attributs MBean du JMSUserManager MBean
ja_jp: JMSUserManager MBean の MBean 属性
pt_br: Os atributos MBean do JMSUserManager MBean
zh_cn: JMSUserManager MBean 的 MBean 属性

source: Set this to <literal>true</literal> if you wish the JMS user manager to attempt to create the tables (and indexes) when it starts. If the tables (or indexes) already exist a <literal>SQLException</literal> will be thrown by the JDBC driver and ignored by the Persistence Manager, allowing it to continue.
es_es: Configure esto como <literal>true</literal> si quiere que el administrador de usuarios JMS intente crear las tablas (e índices) cuando inicia. Si las tablas (o índices) ya existen el controlador JDBC presentará una <literal>SQLException</literal> y el administrador de presistencia la ignorará, permitiéndole continuar.
fr_fr: Configurer le à <literal>true</literal> (vrai) si vous souhaitez que le gestionnaire de l'utilisateur JMS tente de créer des tables (et des index) au démarrage. Si les tables (ou les index) existent déjà, le pilote JDBC enverra un <literal>SQLException</literal> qui sera ignoré par le Persistence Manager, lui permettant ainsi de continuer.
ja_jp: JMS ユーザーマネージャがその起動時にテーブル（及びインデックス）の作成を 試みるようにしたい場合は、これを <literal>true</literal> にセットします。 テーブル（又はインデックス）が既に存在する場合は、JDBC ドライバーによって <literal>SQLException</literal> が送出されて、Persistence Manager によって 無視されます。その為、継続が可能になります。
pt_br: Configure isto para <literal>true</literal>, caso você deseje que o gerenciador do usuário JMS realize a tentativa de criação de tabelas (e indexes), uma vez inicializado. Caso as tabelas (ou indexes) já existirem, uma <literal>SQLException</literal> será lançada pelo driver JDBC e ignorada pelo Gerenciador de Persistência, permitindo que isto continue.
zh_cn: 如果你希望 JMS user manager 试图在启动时创建表（和索引），请设置它为 <literal>true</literal>。如果这个表（或索引）已经存在，那么 JDBC 驱动将抛出 <literal>SQLException</literal> 而 Persistence Manager 会忽略这个异常来使其继续运行。

source: Default user and role data can also be specified here. Any data to be inserted must be specified with property names starting with <literal>POPULATE.TABLES</literal> as in the above example.
es_es: Aquí también se puede especificar los usuarios predeterminados y los datos de roles. Cualquier dato que se va a insertar debe ser especificado con nombres de propiedades empezando por <literal>POPULATE.TABLES</literal> como en el ejemplo anterior.
fr_fr: L'utilisateur par défaut et les rôle data peuvent également être précisés ici. Toute donnée à insérer doit comprendre les noms de propriété commençant par <literal>POPULATE.TABLES</literal> comme dans l'exemple ci-dessus.
ja_jp: デフォルトのユーザーと役目のデータもここで指定できます。挿入すべき データはいずれも、上記の例のように <literal>POPULATE.TABLES</literal> で始まるプロパティ名で指定しなければなりません。
pt_br: O usuário padrão e os dados de função podem ser também especificados aqui. Quaisquer dados a serem inseridos devem ser especificados com nomes apropriados, inicializados com <literal>POPULATE.TABLES</literal>, conforme o exemplo acima.
zh_cn: 缺省的用户和角色数据也可以在这里指定。如上例一样，任何被插入的数据必须用名称以 <literal>POPULATE.TABLES</literal> 开始的属性来指定。

source: Configuring Destinations
es_es: Configuración de destinos
fr_fr: Configurer les destinations
ja_jp: 送り先の設定
pt_br: Configurando Destinações
zh_cn: 配置目的地

source: Pre-configured destinations
es_es: Destinos pre-configurados
fr_fr: Destinations pré-configurées
ja_jp: 事前設定した送り先
pt_br: Destinações pré-configuradas
zh_cn: 预配置的目的地

source: JBoss Messaging ships with a default set of pre-configured destinations that will be deployed during the server start up. The file that contains configuration for these destinations is <filename>destinations-service.xml</filename>. A section of this file is listed below:
es_es: JBoss Messaging se envía junto con un grupo predeterminado de destinos pre-configurados que se implementarán durante el arranque del servidor. El archivo que contiene la configuración para esos destinos es <filename>destinations-service.xml</filename>. A continuación puede ver una sección de este archivo:
fr_fr: JBoss Messaging est proposé avec un ensemble de destinations pré-configurées qui seront déployées au démarrage du serveur. Le fichier qui contient la configuration de ces destinations est <filename>destinations-service.xml</filename>. Une section de ce fichier est listée ci-dessous:
ja_jp: JBoss Messaging はサーバーの起動時にデプロイされる事前設定の送り先 の デフォルトセットを収納して配布されています。これらの送り先用の設定を 含んだファイルは <filename>destinations-service.xml</filename> となります。 このファイルの１セクションが以下に一覧表示されています:
pt_br: O JBoss Messaging lança um padrão determinado de destinações pré-configuradas que será implementado durante a inicialização do servidor. O arquivo que contém configuração para estas destinações é <filename>destinations-service.xml</filename>. A seção deste arquivo é listada abaixo:
zh_cn: JBoss Messaging 带有一套缺省的预配置目的地，它将在服务器启动过程中被部署。针对这些目的地的包含配置信息的文件是 <filename>destinations-service.xml</filename>。下面是这个文件的一部分内容：

source: Configuring queues
es_es: Configuración de colas
fr_fr: Configurer les files d'attente
ja_jp: キュー の設定
pt_br: Configurando filas
zh_cn: 配置队列

source: Attributes of the Queue MBean
es_es: Atributos del MBean Queue
fr_fr: Attributs de la file d'attente MBean
ja_jp: Queue MBean の属性
pt_br: Atributos da Fila MBean
zh_cn: Queue MBean 的属性

source: Name
fr_fr: Nom
pt_br: Nome

source: The name of the queue
es_es: El nombre de la cola
fr_fr: Le nom de la file d'attente
ja_jp: キューの名前
pt_br: O nome da fila
zh_cn: 队列的名称

source: The JNDI name where the queue is bound
es_es: El nombre JNDI en donde se vincula la cola
fr_fr: Le nom JNDI où la file d'attente est reliée
ja_jp: キューがバインドされている JNDI の名前
pt_br: O nome JNDI onde a fila é vinculada.
zh_cn: 队列绑定的 JNDI 名称

source: The DLQ used for this queue. Overrides any value set on the ServerPeer config
es_es: El DLQ utilizado para esta cola. Sobreescribe cualquier grupo de valores en la configuración ServerPeer
fr_fr: DLQ utilisé pour cette file d'attente. Remplace toute valeur inscrite sur la configuration du ServerPeer
ja_jp: このキューに使用する DLQ。ServerPeer config に設定してある全ての値を上書きします。
pt_br: O DLQ usado para esta fila. Isto substitui qualquer valor determinado em ServerPeer config.
zh_cn: 用于这个队列的 DLQ。它将覆盖 ServerPeer 配置里的任何值。

source: The Expiry queue used for this queue. Overrides any value set on the ServerPeer config
es_es: La cola Expiry utilizada para esta cola. Sobreescribe cualquier grupo de valores en la configuración ServerPeer
fr_fr: File d'attente d'expiration (Expiry queue) utilisée pour cette file d'attente. Remplace toute valeur configurée sur le ServerPeer
ja_jp: このキューの為に使用される期限 キュー。ServerPeer config に設定してある 値を上書きします。
pt_br: A fila Expiry utilizada para esta fila. Isto substitui qualquer valor determinado em ServerPeer config.
zh_cn: 用于这个队列的过期队列（Expiry Queue）。它将覆盖 ServerPeer 配置里的任何值。

source: The redelivery delay to be used for this queue. Overrides any value set on the ServerPeer config
es_es: El retraso de re-entrega a utilizar para esta cola. Sobreescribe cualquier grupo de valores en la configuración ServerPeer.
fr_fr: Le délai de redistribution à utiliser pour cette file d'attente. Remplace toute valeur inscrite sur la configuration ServerPeer
ja_jp: この キューの為に使用される 再配信の遅延。ServerPeer config にセットしてる 値を上書きします。
pt_br: A demora de re-entrega a ser usada para esta fila. Isto substitui qualquer valor configurado em ServerPeer config.
zh_cn: 这个队列使用的重递送延迟。它将覆盖 ServerPeer 配置里的任何值。

source: The maximum number of times delivery of a message will be attempted before sending the message to the DLQ, if configured. If set to -1 (the default), the value from the ServerPeer config is used. Any other setting overrides the value set on the ServerPeer config.
es_es: El número máximo de veces que se intentará entregar un mensaje antes de enviar el mensaje al DLQ, si está configurado. Si tiene un valor de -1 (predeterminado) entonces se utiliza el valor de la configuración ServerPeer. Cualquier otra configuración sobreescribe el valor establecido en la configuración ServerPeer.
fr_fr: Le nombre maximum de tentatives d'envoi d'un message avant d'envoyer ce message au DLQ, s'il est configuré. S'il est paramétré à -1 (par défaut), alors on utilisera la valeur de la configuration du ServerPeer. Tout autre paramètre remplace la valeur inscrite la configuration du ServerPeer.
ja_jp: 設定されている場合、 DLQ に送信する前にメッセージを配信する試みの 最大回数です。-1 (デフォルト) にセットされていると、ServerPeer config からの 値が使用されます。他のセッテイングは ServerPeer config にセットしてある値を 上書きします。
pt_br: O número máximo de entrega de uma mensagem será tentado antes do envio de mensagem ao DLQ, caso configurado. Caso configurado para -1 (o padrão), o valor a partir do ServerPeer config será usado. Qualquer outra configuração substitui o valor determinado em ServerPeer config.
zh_cn: 在把消息发送到 DLQ 之前，尝试递送消息的最大次数。如果为 -1（缺省值），ServerPeer 配置里值将被使用。任何其他值将覆盖 ServerPeer 配置里的值。

source: Destination Security Configuration
es_es: Configuración de seguridad del destino
fr_fr: Configuration de sécurité pour la destination
ja_jp: 送り先セキュリティの設定
pt_br: Configuração de Segurança de Destinação
zh_cn: 目的地的安全性配置

source: <literal>SecurityConfig</literal> - allows you to determine which roles are allowed to read, write and create on the destination. It has exactly the same syntax and semantics as the security configuration in JBossMQ destinations.
es_es: <literal>SecurityConfig</literal> - le permite determinar a que roles se les permite leer, escribir y crear en el destino. Tiene exactamente la misma sintaxis y semántica que la configuración de seguridad en destinos JBossMQ.
fr_fr: <literal>SecurityConfig</literal> - vous permet de déterminer les rôles qui sont autorisés à lire, écrire ou créer sur la destination. La syntaxe et la sémantique sont exactement les mêmes que celles utilisées pour la configuration de sécurité pour les destinations JBossMQ.
ja_jp: <literal>SecurityConfig</literal> - 送り先で読み込み、書き込み、作成を 許可される役目の決定をできるようにします。これは JBossMQ destination 内の セキュリティ設定と全く同じシンタックスとセマンティクスを持っています。
pt_br: <literal>SecurityConfig</literal> - permite que você determine quais funções são permitidas para leitura, gravação e criação na destinação. Isto possui exatamente a mesma sintaxe e semântica como a configuração de segurança nas destinações JBossMQ.
zh_cn: <literal>SecurityConfig</literal> - 允许你决定哪些角色可以在目的地读、写和创建。它具有和 JBossMQ 目的地的安全配置完全相同的语法。

source: The <literal>SecurityConfig</literal> element should contain one <literal>&lt;security&gt;</literal> element. The <literal>&lt;security&gt;</literal> element can contain multiple <literal>&lt;role&gt;</literal> elements. Each <literal>&lt;role&gt;</literal> element defines the access for that particular role.
es_es: El elemento <literal>SecurityConfig</literal> debe contener un elemento <literal>&lt;security&gt;</literal>. El elemento <literal>&lt;security&gt;</literal> puede contener múltiples elementos <literal>&lt;role&gt;</literal>. Cada elemento <literal>&lt;role&gt;</literal> define el accesso para ese rol en particular.
fr_fr: L'élément <literal>SecurityConfig</literal> doit comprendre un élément <literal>&lt;security&gt;</literal>. L'élément <literal>&lt;security&gt;</literal> peut comprendre des éléments multiples <literal>&lt;role&gt;</literal>. Chaque élément <literal>&lt;role&gt;</literal> définit l'accès pour ce rôle particulier.
ja_jp: <literal>SecurityConfig</literal> エレメントは <literal>&lt;security&gt;</literal> エレメントを１つ含んでいる必要があります。<literal>&lt;security&gt;</literal> エレメントは複数の <literal>&lt;role&gt;</literal> エレメントを含むことができます。 それぞれの <literal>&lt;role&gt;</literal> エレメントはその特定の役目用のアクセスを 定義します。
pt_br: O elemento <literal>SecurityConfig</literal> deve conter um elemento <literal>&lt;security&gt;</literal>. O elemento <literal>&lt;security&gt;</literal> pode conter múltiplos elementos de <literal>&lt;role&gt;</literal>. Cada elemento de <literal>&lt;role&gt;</literal> define o acesso para aquela função em particular.
zh_cn: <literal>SecurityConfig</literal> 元素里应该包含一个 <literal>&lt;security&gt;</literal> 元素。而 <literal>&lt;security&gt;</literal> 元素可以包含多个 <literal>&lt;role&gt;</literal> 元素。每个 <literal>&lt;role&gt;</literal> 元素都定义特定角色的访问权限。

source: If the <literal>read</literal> attribute is <literal>true</literal> then that role will be able to read (create consumers, receive messaages or browse) this destination.
es_es: Si el atributo <literal>read</literal> es <literal>true</literal> entonces ese rol podrá leer (crear consumidores, recibir mensajes o navegar) este destino.
fr_fr: Si l'attribut <literal>read</literal> (lire) est <literal>true</literal> (vrai) alors ce rôle pourra lire (créer des consommateurs, recevoir des messages ou naviguer) cette destination.
ja_jp: <literal>read</literal> 属性が <literal>true</literal> の場合、その役目はこの送り先 の 読み込み（コンシューマの作成や、メッセージの受信や、閲覧）をすることができます。
pt_br: Caso o atributo de <literal>read</literal> seja <literal>true</literal>, então a função será apta a ler (criar consumidores, receber mensagens ou navegar) esta destinação.
zh_cn: 如果 <literal>read</literal> 属性为 <literal>true</literal>，那么这个角色可以读取（创建消费者、接收消息或浏览消息）目的地。

source: If the <literal>write</literal> attribute is <literal>true</literal> then that role will be able to write (create producers or send messages) to this destination.
es_es: Si el atributo <literal>write</literal> es <literal>true</literal> entonces ese rol podrá escribir (crear productores o enviar mensajes) a este destino.
fr_fr: Si l'attribut <literal>write</literal> (écrire) est <literal>true</literal> (vrai) alors ce rôle pourra écrire (créer des consommateurs, recevoir des messages ou naviguer) cette destination.
ja_jp: <literal>write</literal> 属性が <literal>true</literal> の場合、その役目は この 送り先の 書き込み（プロデューサ の作成や、メッセージの送信）をすることが できます。
pt_br: Caso o atributo <literal>write</literal> seja <literal>true</literal>, então a função será apta a gravar (criar produtores ou enviar mensagens) para esta destinação.
zh_cn: 如果 <literal>write</literal> 属性为 <literal>true</literal>，那么该角色可以写这个目的地（创建生产者或发送消息）。

source: If the <literal>create</literal> attribute is <literal>true</literal> then that role will be able to create durable subscriptions on this destination.
es_es: Si el atributo <literal>create</literal> es <literal>true</literal> entonces ese rol podrá crear subscripciones durables en este destino.
fr_fr: Si l'attribut <literal>create</literal> (créer) est <literal>true</literal> (vrai) alors ce rôle pourra créer des abonnements durables sur cette destination.
ja_jp: <literal>create</literal> 属性が <literal>true</literal> である場合、 その役目はこの送り先上に恒久サブスクリプションを作成することが できます。
pt_br: Caso o atributo <literal>create</literal> seja <literal>true</literal>, então aquela função estará apta a criar subscrições duráveis nesta destinação.
zh_cn: 如果 <literal>create</literal> 属性为 <literal>true</literal>，那么该角色可以在这个目的地上创建持久性订阅。

source: Note that the security configuration for a destination is optional. If a <literal>SecurityConfig</literal> element is not specifed then the default security configuration from the Server Peer will be used.
es_es: Observe que la configuración de seguridad para un destino es opcional. Si no se especifica un elemento <literal>SecurityConfig</literal> entonces se utilizará la configuración predeterminada de seguridad del Server Peer.
fr_fr: Noter que la configuration de sécurité pour cette destination est optionnelle. Si un élément <literal>SecurityConfig</literal> n'est pas spécifié, alors on utilisera la configuration de sécurité par défaut du Server Peer.
ja_jp: 送り先 用のセキュリティ設定はオプションであることに注意して下さい。 <literal>SecurityConfig</literal> エレメントが指定されていない場合は、 Server Peer からデフォルトのセキュリティ設定が使用されます。
pt_br: Perceba que a configuração de segurança para a destinação é opcional. Caso um elemento <literal>SecurityConfig</literal> não seja especificado, então a configuração de segurança padrão, a partir do Servidor Peer, será usada.
zh_cn: 请注意目的地的安全性配置是可选的。如果没有指定 <literal>SecurityConfig</literal> 元素，那么 Server Peer 里的缺省安全配置将被使用。

source: Destination paging parameters
es_es: Parámetros de paginación de destinos
fr_fr: Paramètres de pagination de destination
ja_jp: 送り先ページングパラメータ
pt_br: Parâmetros de paginação da destinação
zh_cn: 目的地的页面参数

source: 'Pageable Channels' are a sophisticated new feature available in JBoss Messaging.
es_es: Los 'canales paginables'son una característica nueva y sofisticada disponible en JBoss Messaging.
fr_fr: Les canaux de pagination ('Pageable Channels') sont des fonctions sophistiquées disponibles dans JBoss Messaging.
ja_jp: 'Pageable Channels' とは、 JBoss Messaging で利用できる洗練された 新規の機能です。
pt_br: 'Pageable Channels - Canais Pagináveis' são o novo recurso sofisticado disponível no JBoss Messaging.
zh_cn: 'Pageable Channels' 是 JBoss Messaging 里的一个复杂的新功能。

source: If your application needs to support very large queues or subscriptions containing potentially millions of messages, then it's not possible to store them all in memory at once.
es_es: Si su aplicación necesita soportar colas muy largas o subscripciones que contienen potencialmente millones de mensajes entonces no es posible almacenarlas todas en la memoria de una sola vez.
fr_fr: Si votre application doit prendre en charge des files d'attente très longues ou des abonnements qui contiennent potentiellement des millions de messages, alors il est possible de tous les stocker dans la mémoire d'un seul coup.
ja_jp: ご使用のアプリケーションが数百万のメッセージを含む可能性のある非常に大規模のキュー 又は サブスクリプションをサポートする必要がある場合は、それらを一度にメモリーに格納する ことは不可能です。
pt_br: Caso o seu aplicativo precise suportar filas grandes ou subscrições contendo milhões de mensagens potenciais, então não será possível armazená-las na memória de uma só vez.
zh_cn: 如果你的应用程序需要支持超大的对列或可能包含数百万条消息的订阅，那么一次性进行存储就不可能。

source: JBoss Messaging solves this problem but letting you specify the maximum number of messages that can be stored in memory at any one time, on a queue-by-queue, or topic-by-topic basis. JBoss Messaging then pages messages to and from storage transparently in blocks, allowing queues and subscriptions to grow to very large sizes without any performance degradation as channel size increases.
es_es: JBoss Messaging resuelve este problema pero le permite especificar el número máximo de mensajes que se pueden almacenar en la memoria en cualquier momento cola-por-cola, o tema-por-tema. Luego JBoss Messaging pagina los mensajes hacia y desde el almacenamiento de manera transparente en bloques, permitiéndoles crecer a las colas y a las subscripciones hasta tamaños muy grandes sin ninguna disminución en el rendimiento ya que el tamaño del canal se incrementa.
fr_fr: JBoss Messaging résout ce problème mais vous laisse préciser le nombre maximum de messages qui peuvent être stockés en mémoire en un seul coup, sur une base file d'attente à file d'attente, ou sujet à sujet. JBoss Messaging pagine alors les messages vers ou en provenance des zones de stockage par blocs, permettant ainsi aux files d'attente ou aux abonnements d'évoluer vers des tailles raisonnables sans aucune dégradation de performance au fur et à mesure que la taille de la voie de transmission augmente.
ja_jp: JBoss Messaging はこの問題を解決しますが、キュー 単位で、あるいは トピック 単位で 一度にメモリー内に保存できるメッセージの最大数を指定可能にします。JBoss Messaging は その後、ブロック単位でメッセージをストレージ群の間で透過的にページして、チャンネルサイズが 増大してもキューとサブスクリプションがパフォーマンスの低下を受けることなしに非常に大きな サイズまで拡張できるようにします。
pt_br: O JBoss Messaging resolve este problema, permitindo que você especifique o número máximo de mensagens que podem ser armazenadas na memória apenas de uma só vez, baseando-se na fila-por-fila ou tópico-por-tópico. O JBoss Messaging então chama as mensagens do/ para o armazenamento em blocos, permitindo que as filas e subscrições cresçam em tamanhos grandes sem qualquer degradação do desempenho, na medida em que o tamanho do canal aumenta.
zh_cn: JBoss Messaging 没有解决这个问题，但它可以让你指定可以一次性存储在内存里的每个队列或主题的消息的最大个数。JBoss Messaging 然后以块的形式透明地将这些消息分页，允许队列和订阅非常大而不影响性能。

source: This has been tested with in excess of 10 million 2K messages on very basic hardware and has the potential to scale to much larger number of messages.
es_es: Esto se ha probado con más de 10 millones de mensajes de 2K en hardware muy básico y tiene el potencial de escalar a un número de mensajes mucho más grande.
fr_fr: Le système a été testé avec plus de 10 millions de messages de 2K sur du matériel de base, avec potentiellement de la place pour un bien plus grand volume de messages.
ja_jp: これは、非常に基本的なハードウェア上で一千万を越える 2K メッセージで検証されて おり、ずっとより多くのメッセージまで拡張する可能性を持っています。
pt_br: Isto foi testado com o excesso de 10 milhões 2K de mensagens em um hardware bastante básico, e possui o potencial de escalar um número muito maior de mensagens.
zh_cn: 这已经在基本的硬件上使用超过一千万零两千条消息进行了测试，且有可能扩展至更大的数目。

source: The individual parameters are:
es_es: Los parámetros individuales son:
fr_fr: Les paramètres individuels sont:
ja_jp: 個別のパラメータは以下のようになります:
pt_br: Os parâmetros individuais são:
zh_cn: 其各个参数为：
