Repository: bobmcwhirter/jboss-messaging
Catalog: docs/EAP_4_3/JBoss_Messaging_User_Guide/*/Configuration.po
Languages: es_es, fr_fr, ja_jp, pt_br, zh_cn

source: JBoss Messaging also ships with pre-made Persistence Manager configurations for MySQL, Oracle, PostgreSQL, Sybase and MS SQL Server. The example <filename>mysql-persistence-service.xml</filename>, <filename>ndb-persistence-service.xml</filename>, <filename>oracle-persistence-service.xml</filename>, <filename>postgres-persistence-service.xml</filename> and <filename>sybase-persistence-service.xml</filename> and <filename>mssql-persistence-service.xml</filename> configuration files are available in the <filename>examples/config</filename> directory of the release bundle.
es_es: JBoss Messaging también se envía junto con configuraciones pre-hechas del administrador de persitencia para MySQL, Oracle, PostgreSQL, Sybase y el servidor MS SQL. Los archivos de configuración de ejemplo <filename>mysql-persistence-service.xml</filename>, <filename>ndb-persistence-service.xml</filename>, <filename>oracle-persistence-service.xml</filename>, <filename>postgres-persistence-service.xml</filename> y <filename>sybase-persistence-service.xml</filename> y <filename>mssql-persistence-service.xml</filename> se encuentran disponibles en el directorio <filename>examples/config</filename> del grupo del lanzamiento.
fr_fr: JBoss Messaging est également présenté avec les configurations de pre-made Persistence Manager pour MySQL, Oracle, PostgreSQL, Sybase et le serveur MS SQL. Les exemples de fichiers de configuration <filename>mysql-persistence-service.xml</filename>, <filename>ndb-persistence-service.xml</filename>, <filename>oracle-persistence-service.xml</filename>, <filename>postgres-persistence-service.xml</filename> et <filename>sybase-persistence-service.xml</filename> et <filename>mssql-persistence-service.xml</filename> sont disponibles dans le répertoire <filename>examples/config</filename> du kit de mise à jour.
ja_jp: JBoss Messaging は MySQL, Oracle, PostgreSQL, Sybase 及び MS SQL サーバー用に 事前処理してある Persistence Manager 設定を収納した状態で配布されています。 サンプルの <filename>mysql-persistence-service.xml</filename>, <filename>ndb-persistence-service.xml</filename>, <filename>oracle-persistence-service.xml</filename>, <filename>postgres-persistence-service.xml</filename> と <filename>sybase-persistence-service.xml</filename> 及び <filename>mssql-persistence-service.xml</filename> の設定ファイルはリリースバンドル内の <filename>examples/config</filename> ディレクトリにあります。
pt_br: O JBoss Messaging também lança as configurações de Gerenciador Persistente pré-feitas para MySQL, Oracle, PostgreSQL, Sybase e MS SQL Server. O exemplo de arquivos de configuração <filename>mysql-persistence-service.xml</filename>, <filename>ndb-persistence-service.xml</filename>, <filename>oracle-persistence-service.xml</filename>, <filename>postgres-persistence-service.xml</filename> e <filename>sybase-persistence-service.xml</filename> e <filename>mssql-persistence-service.xml</filename> estão disponíveis no diretório <filename>examples/config</filename> do conjunto de liberação.
zh_cn: JBoss Messaging 也附带用于 MySQL、Oracle、PostgreSQL、Sybase 和 MS SQL Server 的 Persistence Manager 配置。示例的 <filename>mysql-persistence-service.xml</filename>、<filename>ndb-persistence-service.xml</filename>、<filename>oracle-persistence-service.xml</filename>、<filename>postgres-persistence-service.xml</filename>、 <filename>sybase-persistence-service.xml</filename> 和 <filename>mssql-persistence-service.xml</filename> 文件位于 <filename>examples/config</filename> 目录之下。

source: Users are encouraged to contribute their own configuration files where we will thoroughly test them before certifying them for suppported use with JBoss Messaging. The JDBC Persistence Manager has been designed to use standard SQL for the DML so writing a JDBC Persistence Manager configuration for another database is usually only a fairly simple matter of changing DDL in the configuration which is likely to be different for different databases.
es_es: Se anima a los usuarios a que contribuyan con sus propios archivos de configuración, los cuales se probarán extensivamente antes de certificarlos para uso soportado con JBoss Messaging. El administrador de persistencia JDBC ha sido diseñado para utilizar SQL estándar para el DML así que el escribir una configuración del administrador de persistencia JDBC para otra base de datos usualmente sólo es cuestión de cambiar DDL en la configuración, la cual posiblemente será diferente para bases de datos diferentes.
fr_fr: Les utilisateurs sont encouragés à contribuer à leurs propres fichiers de configuration pour lesquels nous les testerons de près avant de les certifier pour une utilisation prise en charge par JBoss Messaging. Le JDBC Persistence Manager a été conçu pour utilisation standard SQL avec DML, donc la rédaction d'une configuration JDBC Persistence Manager pour une autre base de données est normalement juste une question de changement de DDL dans la configuration, qui est susceptible de varier en fonction des bases de données.
ja_jp: ユーザーには自身の設定ファイルを貢献して頂くように奨励します。それらの 設定ファイルは弊社で徹底的にテストを実施してから JBoss Messaging での サポート可能な使用の為に認証をすることになります。JDBC Persistence Manager は DML 用の標準の SQL を使用するように設計されています。そのため、他のデータベース用に JDBC Persistence Manager 設定を書くことは、一般的に設定内で DDL を変更するだけの 簡単なことであり、異なるデータベース用には異なる設定となるだけです。
pt_br: Os usuários são incentivados a contribuir os próprios arquivos de configuração onde nós iremos testá-los totalmente antes de certificá-los para o uso suportado com o JBoss Messaging. O Gerenciador de Persistência JDBC foi desenhado para o uso do SQL padrão para o DML. Desta forma, a gravação de uma configuração de Gerenciador de Persistência JDBC para outro banco de dados é apenas um assunto bem simples de mudança de DDL na configuração que está sujeita a diferenciar-se dos diferentes bancos de dados.
zh_cn: 我们鼓励用户贡献自己的配置文件，我们将在认证之前进行详尽测试。JDBC Persistence Manager 被设计成对 DML 使用标准的 SQL ，所以为其他数据库编写 JDBC Persistence Manager 配置通常只需要修改其中的 DDL（对于不同的数据库，这些语句很可能有差别）就可以了。

source: JBoss Messaging also ships with a 'Null Persistence Manager' config - this can be used when you don't want any persistence at all.
es_es: JBoss Messaging también se envía con una configuración 'Null Persistence Manager'- esta se puede utilizar cuando no quiere nada de persistencia.
fr_fr: JBoss Messaging est également présenté avec une config 'Null Persistence Manager' - qui peut être utilisée quand vous ne souhaitez pas de persistance dutout.
ja_jp: JBoss Messaging は Null Persistence Manager 設定も収納して配布されています。これは、 永続化を全く使用したくない時に使用できます。
pt_br: O JBoss Messaging também lança um 'Null Persistence Manager' config - isto pode ser usado quando você não desejar qualquer persistência se quer.
zh_cn: JBoss Messaging 也带有一个 'Null Persistence Manager' 配置 － 它可以在你根本不需要任何持久化时使用。

source: The default Hypersonic persistence configuration file is listed below:
es_es: El archivo predeterminado de configuración de persistencia de Hypersonic se lista a continuación:
fr_fr: Le fichier de configuration de persistance Hypersonic par défaut est détaillé ci-dessous:
ja_jp: デフォルトの Hypersonic 永続化設定ファイルは以下に一覧表示しています:
pt_br: O arquivo de configuração de persistência Hypersonic padrão é listado abaixo:
zh_cn: 下面是缺省的 Hypersonic persistence 配置文件：

source: MBean attributes of the PersistenceManager MBean
es_es: Atributos MBean del MBean PersistenceManager
fr_fr: Les attributs MBean du PersistenceManager MBean
ja_jp: PersistenceManager MBean の MBean 属性
pt_br: Os atributos MBean do PersistenceManager MBean
zh_cn: PersistenceManager MBean 的 MBean 属性

source: Set this to <literal>true</literal> if you wish the Persistence Manager to attempt to create the tables (and indexes) when it starts. If the tables (or indexes) already exist a <literal>SQLException</literal> will be thrown by the JDBC driver and ignored by the Persistence Manager, allowing it to continue.
es_es: Configure esto como <literal>true</literal> si quiere que el administrador de persistencia intente crear las tablas (e índices) cuando inicia. Si las tablas (o índices) ya existen el controlador JDBC presentará una <literal>SQLException</literal> y el administrador de persistencia lo ignorará, permitiéndole continuar.
fr_fr: Configurez le à <literal>true</literal> (vrai) si vous souhaitez que le Persistence Manager tente de créer des tables ( et des index) au démarrage. Si les tables (ou les index) existent déjà, le pilote JDBC enverra une <literal>SQLException</literal> qui sera ignorée par le Persistence Manager, lui permettant de continuer.
ja_jp: Persistence Manager が起動時点でテーブル（及びインデックス）の作成を 試みるようにしたい場合は、これを <literal>true</literal> にセットします。 テーブル（又はインデックス）が既に存在する場合は、JDBC ドライバーによって <literal>SQLException</literal> が送出され、Persistence Manager によって 無視されます。そのため継続が可能になります。
pt_br: Caso você deseje que o Gerenciador de Persistência realize a tentativa de criar tabelas (ou indexes) quando o mesmo estiver inicializando, configure isto para verdadeiro. Caso as tabelas (ou indexes) já existirem, um <literal>SQLException</literal> será lançado pelo driver JDBC e ignorado pelo Gerenciador de Persistência, permitido que isto continue.
zh_cn: 如果你希望 Persistence Manager 在启动时创建表（以及索引），请将其设置为 <literal>true</literal>。如果这些表（以及索引）已经存在，JDBC 驱动将抛出一个 <literal>SQLException</literal>，Persistence Manager 会忽略这个异常并继续运行。

source: Set this to <literal>true</literal> if the database supports JDBC batch updates. The JDBC Persistence Manager will then group multiple database updates in batches to aid performance.
es_es: Configure esto como <literal>true</literal> si la base de datos soporta actualizaciones en grupo JDBC. El administrador de persistencia JDBC agrupará múltiples actualizaciones de bases de datos en grupo para mejorar el rendimiento.
fr_fr: Paramétrer le à <literal>true</literal> (vrai) si la base de données supporte les mises à jour des lots JDBC. JDBC Persistence Manager groupera alors les mises à jour des bases de données multiples du groupe en lots pour améliorer la performance.
ja_jp: データベースが JDBC バッチ更新をサポートする場合は、これを <literal>true</literal> に セットします。そうすると、JDBC Persistence Manager は複数のバッチ更新を バッチにグループ化してパフォーマンスを支援します。
pt_br: Configure isto para <literal>true</literal>, caso o database suportar as atualizações em lote JDBC. O Gerenciador de Persistência irá então agrupar as atualizações do database múltiplo em lotes, para ajudar o desempenho.
zh_cn: 如果数据库支持 JDBC 批量更新，请设置它为 <literal>true</literal>。JDBC Persistence Manager 将对批量的数据库更新进行分组来提供性能。

source: By default the value of <literal>UsingBatchUpdates</literal> attribute is set to <literal>false</literal>
es_es: Por defecto el valor del atributo <literal>UsingBatchUpdates</literal> está configurado como <literal>false</literal>
fr_fr: La valeur par défaut de l'attribut <literal>UsingBatchUpdates</literal> est configurée à <literal>false</literal> (faux)
ja_jp: <literal>UsingBatchUpdates</literal> 属性のデフォルト値は <literal>false</literal> にセットされています。
pt_br: O valor do atributo <literal>UsingBatchUpdates</literal> é configurado para <literal>false</literal>, pelo padrão.
zh_cn: <literal>UsingBatchUpdates</literal> 属性的缺省值是 <literal>false</literal>。

source: Set this to <literal>true</literal> if you want messages to be store and read using a JDBC binary stream rather than using getBytes(), setBytes(). Some database has limits on the maximum number of bytes that can be get/set using getBytes()/setBytes().
es_es: Configure esto como <literal>true</literal> si quiere que los mensajes se almacenen y se lean utilizando un stream binario JDBC en vez de usar getBytes(), setBytes(). Algunas de las bases de datos tienen límites en el número máximo de bytes que se pueden obtener/configurar utilizando getBytes()/setBytes().
fr_fr: Configurer à <literal>true</literal> (vrai) si vous souhaitez que les messages soient stockés et lus grâce au stream JDBC binaire plutôt que par getBytes(), setBytes(). Certaines bases de données sont limitées à un nombre maximum d'octets qui peuvent être obtenus/fixés (get/set) en utilisant getBytes()/setBytes().
ja_jp: メッセージが、getBytes(), setBytes() の使用ではなく、JDBC バイナリストリームを 使用して保存され読み込まれるようにしたい場合は、これを <literal>true</literal> に セットします。一部のデータベースは、getBytes()/setBytes() を使用した get/set に 於いて、バイトの最大数に制約を持っています。
pt_br: Configure isto para <literal>true</literal>, caso você deseje que as mensagens sejam armazenadas e lidas usando o fluxo binário JDBC, ao invés de usar getBytes(), setBytes(). Alguns databases possuem limites no número máximo de bites que podem ser obtidos/configurados usando getBytes()/setBytes().
zh_cn: 如果你希望用 JDBC 二进制流而不是 getBytes()、setBytes() 存储和读取消息，请设置它为 <literal>true</literal>。有些数据库对用 getBytes()/setBytes() 读取/写的字节数有限制。

source: By default the value of <literal>UsingBinaryStream</literal> attribute is set to <literal>true</literal>
es_es: Por defecto el valor del atributo <literal>UsingBinaryStream</literal> está establecido como <literal>true</literal>
fr_fr: La valeur par défaut de l'attribut <literal>UsingBinaryStream</literal> est <literal>true</literal>(vrai)
ja_jp: <literal>UsingBinaryStream</literal> 属性のデフォルト値は <literal>true</literal> にセットされています。
pt_br: O valor do atributo <literal>UsingBinaryStream</literal> é configurado para <literal>true</literal>, pelo padrão.
zh_cn: <literal>UsingBinaryStream</literal> 属性的缺省值是 <literal>true</literal>。

source: Certain version of Sybase are known to truncate blobs if they have trailing zeros. To prevent this if this attribute is set to <literal>true</literal> then a trailing non zero byte will be added and removed to each blob before and after persistence to prevent the database from truncating it. Currently this is only known to be necessary for Sybase.
es_es: Se sabe que ciertas versiones de Sybase truncan blobs si tienen un rastro de ceros. Para prevenir esto si este atributo se configura como <literal>true</literal> entonces se añadirá un byte sin rastro de ceros y se removera de cada blob antes y después de la persistencia para prevenir que la base de datos se trunque. Actualmente se sabe que esto es sólo necesario para Sybase.
fr_fr: Certaines versions de Sybase sont connues pour tronquer des BLOB (objets binaires de grande taille) s'ils se terminent par des zéros (trailing zero). Pour éviter cela, si cet attribut est paramétré à <literal>true</literal> (vrai), alors un octet sera ajouté, puis retiré de chaque BLOB avant et après la persistance afin d'éviter que la base de données ne le tronque. Actuellement, ce n'est utile que pour Sybase.
ja_jp: Sybase の特定のバージョンは、連続するゼロがある場合に blob を切り捨てることが 知られています。この属性が <literal>true</literal> に設定されている場合に、 この問題を回避するには、永続化の前と後にそれぞれの blob に対して連続するゼロ以外のバイトを 追加して、削除するとデータベースがそれを切り捨てることを防止できます。現在これが唯一 Sybase に必要な事項として知られています。
pt_br: Certas versões do Sybase são conhecidas por truncar blobs (objetos grandes binários), caso eles precedam zeros. Para prevenir isto, caso este atributo seja configurado para <literal>true</literal>, então uma precedência de byte diferente de zero será adicionada e removida para cada blob, antes e depois da persistência prevenindo, desta forma, o banco de dados de truncá-lo. Atualmente, isto é apenas conhecido por ser necessário ao Sybase.
zh_cn: Sybase 的某些版本会把尾部的零截为圆点。要防止这种情况，这个属性应该设置为 <literal>true</literal>，这样尾部的非零字节将在持久化之前和之后添加和删除以防止数据库删除它们。目前这仅对于 Sybase 是必需的。

source: By default the value of <literal>UsingTrailingByte</literal> attribute is set to <literal>false</literal>
es_es: Por defecto el valor del atributo <literal>UsingTrailingByte</literal> está configurado como <literal>false</literal>
fr_fr: La valeur par défaut de l'attribut <literal>UsingTrailingByte</literal> est configurée à <literal>false</literal> (faux).
ja_jp: <literal>UsingTrailingByte</literal> 属性の値はデフォルトで <literal>false</literal> に セットされています。
pt_br: O valor do atributo <literal>UsingTrailingByte</literal> é configurado para <literal>false</literal>, pelo padrão.
zh_cn: <literal>UsingTrailingByte</literal> 属性的缺省值是 <literal>false</literal>。

source: Oracle (and possibly other databases) is known to not allow BLOBs to be inserted using a INSERT INTO ... SELECT FROM statement, and requires a two stage conditional insert of messages. If this value is false then such a two stage insert will be used.
es_es: Se sabe que Oracle (y posiblemente otras bases de datos) no permiten insertar BLOBs utilizando una declaración INSERT INTO ... SELECT FROM, y requiere un insert condicional de dos etapas de mensajes. Si este valor es falso entonces se utiliza dicho insert de dos etapas.
fr_fr: Oracle (et d'autres bases de données probablement) est fameux pour ne pas autoriser les BLOB à être insérés en utilisant un énoncé INSERT INTO ... SELECT FROM et l'insertion de messages doit procéder en deux étapes conditionnelles. SI cette valeur est 'false' (faux), alors on utilisera cette insertion de messages en deux étapes.
ja_jp: Oracle (及びたぶん他のデータベース) は INSERT INTO ... SELECT FROM ステートメントを 使用した BLOB の挿入を許可しないこと、そしてそれがメッセージの２つのステージの条件的 挿入を要求することが知れれています。この値が 「false」の場合は、そのような２ステージ挿入が 使用されます。
pt_br: O Oracle (e possivelmente outro banco de dados) é conhecido por não permitir queBLOBs sejam inseridos usando a expressão INSERT INTO ... SELECT FROM, e solicitando a inserção condicional de estado dois das mensagens. Caso o valor seja falso, então a inserção de estágio dois será utilizada.
zh_cn: Oracle（可能还有其他数据库）不允许用 INSERT INTO ... SELECT FROM 语句插入 BLOB，且要求两阶段插入消息。如果这个值为 false，那么将使用两阶段的插入。

source: By default the value of <literal>SupportsBlobOnSelect</literal> attribute is set to <literal>true</literal>
es_es: Por defecto el valor del atributo <literal>SupportsBlobOnSelect</literal> está establecido como <literal>true</literal>
fr_fr: Par défaut, la valeur de l'attribut <literal>UsingTrailingByte</literal> est configurée à <literal>true</literal> (vrai).
ja_jp: <literal>SupportsBlobOnSelect</literal> 属性の値はデフォルトで <literal>true</literal> にセットされています。
pt_br: O valor do atributo <literal>SupportsBlobOnSelect</literal> é configurado para <literal>true</literal>, pelo padrão.
zh_cn: <literal>SupportsBlobOnSelect</literal> 属性缺省值是 <literal>true</literal>。

source: When loading messages the persistence manager will generate prepared statements with many parameters. This value tells the persistence manager what the absolute maximum number of parameters are allowable per prepared statement.
es_es: Cuando se cargan mensajes el administrador de persistencia generará declaraciones preparadas con muchos parámetros. Este valor le dice al administrador de persistencia el número máximo absoluto de parámetros que se permiten por declaración preparada.
fr_fr: Lorsque vous chargez les messages, le gestionnaire de persistances va générer des énoncés pourvus de nombreux paramètres. Cette valeur indique au gestionnaire de persistances le nombre maximum absolu de paramètres permis par énoncé préparé.
ja_jp: メッセージをロードしている時点に、Persistence Manager は多くのパラメータを持った 準備されたステートメントを生成します。この値は、Persistence Manager に対して 準備されたステートメント毎に許可できるパラメータの絶対最大数を伝えます。
pt_br: Quando carregando mensagens, o gerenciador de persistência fornecerá expressões preparadas com muitos parâmetros. Este valor informa ao gerenciador de persistência qual o número máximo absoluto de parâmetros que são permitidos por expressões preparadas.
zh_cn: 当加载消息时，Persistence manager 将生成带有很多参数的 prepared 语句。这个值通知 Persistence manager 每个 prepared 语句所允许的参数的最大个数。

source: By default the value of <literal>MaxParams</literal> attribute is set to <literal>100</literal>
es_es: Por defecto el valor del atributo <literal>MaxParams</literal> está configurado como <literal>100</literal>
fr_fr: Par défaut, la valeur de l'attribut <literal>MaxParams</literal> est fixée à <literal>100</literal>
ja_jp: <literal>MaxParams</literal> 属性の値はデフォルトで <literal>100</literal> にセットされています。
pt_br: O valor do atributo <literal>MaxParams</literal> é configurado para <literal>100</literal>, por padrão.
zh_cn: <literal>MaxParams</literal> 属性的缺省值是<literal>100</literal>。

source: When running in a clustered database environment it is possible that some databases, MySQL for instance, can fail during the commit of a database transaction. If the database node dies while committing then the final state of the transaction is unknown. If the attribute <literal>UseNDBFailoverStrategy</literal> is set to true and the above happens then the SQL statement will be re-executed. However any further error is ignored because an assumption is made that the error is due to the previous transaction being committed successfully.
es_es: Al ejecutar en un entorno de base de datos en clúster es posible que algunas de las bases de datos, por ejemplo MySQL, fallen al guardar los cambios de una transacción de la base de datos. Si el nodo de la base de datos muere al guardar los cambios entonces el estado final de la transacción es desconocido. Si el atributo <literal>UseNDBFailoverStrategy</literal> se configura como verdadero y pasa lo que mencionamos antes entonces la declaración SQL será re-ejecutada. Sin embargo, cualquier otro error se ignora ya que se asume que el error se debe a que la transacción anterior se ha guardado con éxito.
fr_fr: Lorsqu'on exécute un environnement de bases de données groupées, il est possible que certaines bases de données, comme MySQL par exemple, puissent échouer pendant la phase de validation d'une transaction de base de données. Si le noeud d'une base de données meurt en phase de validation, alors l'état final de la transaction est inconnu. Si l'attribut <literal>UseNDBFailoverStrategy</literal> est paramétré à 'true' et que ce qui est mentionné ci-dessus a lieu, alors l'énoncé SQL sera re-exécuté. Cependant, toute erreur supplémentaire sera ignorée car on assume que l'erreur provient de la transaction précédente qui a été validée avec succès.
ja_jp: クラスター化したデータベース環境で実行している場合、例えば MySQL などの 一部のデータベースはデータベースのトランザクションのコミット中に停止する 可能性があります。コミット中にデータベースノードが死んでしまうとその トランザクションの最終状態は不明になります。属性 <literal>UseNDBFailoverStrategy</literal> が 「true」にセットしてある場合に上記の状態が発生すると、SQL ステートメントは再度実行されます。しかし、 これ以降のエラーは、以前のトランザクションが正しくコミットされている為だとの想定の理由で無視される ことになります。
pt_br: Quando rodando um ambiente de banco de dados com cluster, é possível que alguns bancos de dados, por exemplo: o MySQL, possam falhar durante a confirmação de uma transação de banco de dados. Caso o nó do banco de dados encerrar enquanto realizando a confirmação, então o estado final da transação será desconhecida. Caso o atributo <literal>UseNDBFailoverStrategy</literal> seja configurado para verdadeiro e ocorrer o descrito acima, então a expressão SQL será re-executada. No entanto, qualquer erro futuro será ignorado uma vez que assume-se que aquele erro é devido à transação anterior ter sido confirmada com êxito.
zh_cn: 当在群集的数据库环境里运行时，某些数据库如 MySQL，可能在提交数据库事务时失败。如果在提交阶段数据库节点停止运行了，那么就无法获知该事务的最后状态。如果设置了 <literal>UseNDBFailoverStrategy</literal> 为 true，那么相关 SQL 语句将被重新执行。然而，任何进一步的错误将被忽略，这是因为我们假设这个错误是由于前面成功提交的事务所引起的。

source: By default the value of the attribute <literal>UseNDBFailoverStrategy</literal> is set to <literal>false.</literal>
es_es: Por defecto el valor del atributo <literal>UseNDBFailoverStrategy</literal> está configurado como <literal>false.</literal>
fr_fr: Par défaut, la valeur de l'attribut <literal>UseNDBFailoverStrategy</literal> est paramétrée <literal>false</literal> (faux)
ja_jp: <literal>UseNDBFailoverStrategy</literal> 属性の値はデフォルトで <literal>false.</literal> にセットされています。
pt_br: O valor do atributo <literal>UseNDBFailoverStrategy</literal> é configurado para <literal>false</literal>, pelo padrão.
zh_cn: <literal>UseNDBFailoverStrategy</literal> 的缺省值是 <literal>false</literal>。

source: Configuring the JMS user manager
es_es: Configuración del administrador de usuarios de JMS
fr_fr: Configurer le gestionnaire de l'utilisateur JMS
ja_jp: JMS ユーザーマネージャの設定
pt_br: Configuração do gerenciador do usuário JMS
zh_cn: 配置 JMS User Manager
