Repository: bobmcwhirter/jboss-messaging
Catalog: docs/EAP_4_3/JBoss_Messaging_User_Guide/*/Configuration.po
Languages: es_es, fr_fr, ja_jp, pt_br, zh_cn

source: This is the name of the default DLQ (Dead Letter Queue) the server peer will use for destinations. The DLQ can be overridden on a per destination basis - see the destination MBean configuration for more details. A DLQ is a special destination where messages are sent when the server has attempted to deliver them unsuccessfully more than a certain number of times. If the DLQ is not specified at all then the message will be removed after the maximum number of delivery attempts. The maximum number of delivery attempts can be specified using the attribute DefaultMaxDeliveryAttempts for a global default or individually on a per destination basis.
es_es: Este es el nombre del DLQ (Dead Letter Queue) predeterminado que el servidor compañero utilizará para los destinos. El DLQ se puede sobreescribir destino por destino - consulte la configuración MBean de destino para obtener más detalles. Un DLQ es un destino especial a donde se envían los mensajes cuando el servidor ha intentado entregarlos sin tener éxito más de cierto número de veces. Si no se especifica el QLD entonces el mensaje se borrará después del número máximo de intentos de entrega. El número máximo de intentos de entrega se puede especificar utilizando el atributo DefaultMaxDeliveryAttempts para un valor predeterminado global o individualmente destino por destino.
fr_fr: Il s'agit du nom par défaut DLQ (Dead Letter Queue) que les Server Peer va utiliser pour les destinations Le DLQ peut être remplacé sur la base de la destination - voir configuration du MBean de destination pour davantage d'informations. Un DLQ est une destination spéciale où les messages sont envoyés quand le serveur a déjà tenté de les envoyer à un certain nombre de reprises. Si le DQL n'est pas précisé dutout, alors tous les messages seront retirés après le nombre maximum de tentatives. Le nombre maximum de tentatives peut être spécifié en utilisant l'attribut DefaultMaxDeliveryAttempts pour un nombre par défaut général ou individuellement sur la base de la destination.
ja_jp: これは、サーバーピアが送り先 用に使用するデフォルトの DLQ (Dead Letter Queue) の名前です。 DLQ は 送り先 単位で上書きができます。その詳細については、Destination MBean の設定を参照して 下さい。DLQ は特殊な 送り先 であり、そこではサーバーが特定の回数以上に配送試行に失敗した時に メッセージが送信されます。DLQ が全く指定されていない場合は、最大回数の配送試行がなされた後で メッセージは削除されます。この配送試行の最大回数は、グローバルデフォルト用には 属性 DefaultMaxDeliveryAttempts を使用して指定できて、又は 送り先単位では個別に指定できます。
pt_br: Este é o nome do padrão DLQ (Dead Letter Queue) que o servidor peer usará para destinações. O DLQ pode ser substituído baseando-se na destinação - consulte a configuração MBean de destinação para maiores detalhes. A DLQ é uma destinação especial onde mensagens estão sendo enviadas quando o servidor tiver feito a tentativa de entregá-las sem êxito, por mais de um número determinado de vezes. Caso o DLQ não seja especificado, então a mensagem será removida após o número máximo de tentativas de entrega. O número máximo de tentativas de entrega pode ser especificada usando o atributo DefaultMaxDeliveryAttempts para um padrão global ou individualmente baseando-se na destinação.
zh_cn: 这是 Server Peer 用于目的地的缺省 DLQ（Dead Letter Queue）。每个目的地的 DLQ 可以被覆盖 － 更多细节请参考目的地 MBean 的配置。DLQ 是一个特殊的目的地，当服务器递送信息连续失败指定的次数之后，这些信息将被发送到这里。如果根本就没有指定 DLQ，那么这些消息在进行最多次数的递送尝试后将被删除。递送的最多次数可以用属性 DefaultMaxDeliveryAttempts 指定，它可以是全局的缺省属性也可以基于每个目的地进行设置。

source: The default for the maximum number of times delivery of a message will be attempted before sending the message to the DLQ, if configured.
es_es: El valor predeterminado para el número máximo de veces que se intentará entregar un mensaje antes de enviar el mensaje al DLQ, si se configura.
fr_fr: Le nombre maximum de tentatives d'envoi d'un message par défaut avant que ce message soit envoyé au DQL, si configuré ainsi.
ja_jp: メッセージ配信のデフォルト最大回数を試みた後に、設定されている場合、 メッセージを DLQ に送信します。
pt_br: Será feita uma tentativa do padrão para o número máximo de vezes de entrega de uma mensagem, antes do envio da mensagem ao DLQ, caso configurado.
zh_cn: 如果被设置的话，它表示消息在被发送到 DLQ 之前所尝试的最多次数。

source: The default value is <literal>10</literal>.
es_es: El valor predeterminado es <literal>10</literal>.
fr_fr: La valeur par défaut est <literal>10</literal>.
ja_jp: デフォルト値は <literal>10</literal> です。
pt_br: O valor do padrão é <literal>10</literal>.
zh_cn: 它的缺省值是 <literal>10</literal>。

source: This value can also be overridden on a per destination basis.
es_es: Este valor también se puede sobreescribir destino por destino.
fr_fr: Cette valeur peut également être remplacée sur la base de la destination.
ja_jp: この値は、送り先 毎に上書きできます。
pt_br: O valor pode também ser substituído baseando-se na destinação.
zh_cn: 这个值也可以基于每个目的地进行覆盖。

source: This is the name of the default expiry queue the server peer will use for destinations. The expiry can be overridden on a per destination basis - see the destination MBean configuration for more details. An expiry queue is a special destination where messages are sent when they have expired. Message expiry is determined by the value of Message::getJMSExpiration() If the expiry queue is not specified at all then the message will be removed after it is expired.
es_es: Este es el nombre de la cola de expiración predeterminada que el servidor compañero utilizará para los destinos. La expiración se puede sobreescribir destino por destino - consulte la configuración del MBean de destino para obtener mayores detalles. Una cola de expiración es un destino especial a donde se envían los mensajes cuando han expirado. La expiración de un mensaje está determinada por el valor de Message::getJMSExpiration() Si la cola de expiración no se especifica entonces el mensaje se borrará después de que ha expirado.
fr_fr: Il s'agit du nom de la file d'attente d'expiration par défaut que le Server Peer va utiliser pour les destinations. La valeur d'expiration peut être remplacée sur la base de la destination - voir la configuration du MBean de destination pour davantage d'informations. Une file d'attente d'expiration est une destination spéciale où l'on envoie les messages lorsqu'ils ont expirés. L'expiration des messages est déterminée par la valeur de Message::getJMSExpiration(). Si la file d'attente n'est pas spécifiée dutout, alors le message sera retiré après expiration.
ja_jp: これは、サーバーピアが 送り先 の為に使用するデフォルトの期限キューの名前です。 期限は送り先別基準で書き換えることができます。詳細は Destination MBean 設定を ご覧下さい。期限キュー は期限となった時にメッセージが送信される特定の 送り先 です。メッセージ期限は、Message の値：getJMSExpiration() により 決定されます。期限キュー が全く指定されていないとメッセージは期限になった 時点で削除されます。
pt_br: Este é o nome da fila de expiração padrão que o servidor peer usará para destinações. A expiração pode ser substituída baseando-se na destinação - consulte a configuração MBean de destinação para maiores detalhes. Uma fila de expiração é uma destinação especial onde mensagens são enviadas quando elas tiveram expirado. A expiração de uma mensagem é determinada pelo valor da Message::getJMSExpiration(). Caso a fila de expiração não seja especificada, então a mensagem será removida após ser expirada.
zh_cn: 这是 Server Peer 用于目的地的缺省 Expiry Queue 的名称。过期时间可以基于每个目的地进行覆盖 － 更多细节请参考目的地的 MBean 配置。Expiry Queue 是一个特殊的目的地，当消息过期时将被发送到这里。消息是否过期是由 Message::getJMSExpiration() 的值决定的，如果根本没有指定 Expiry Queue，那么消息在过期后将被删除。

source: When redelivering a message after failure of previous delivery it is often beneficial to introduce a delay perform redelivery in order to prevent thrashing of delivery-failure, delivery-failure etc
es_es: Al volver a entregar un mensaje después de una falla en la entrega anterior con frecuencia es bueno introducir una re-entrega de retraso con el fin de prevenir una serie de falla-de-entrega, falla-de-entrega, etc.
fr_fr: Lorsque l'on renvoie un message suite à un échec, il est souvent utile d'introduire délai de renvoi pour de message afin d'éviter les problèmes de delivery-failure (envoi-échec) etc
ja_jp: 前回の配送が失敗した後にメッセージを再配送するとき、実行遅延式再配送 （delay perform redelivery）を採用して配送失敗の繰り返しの無惨を 防止することが良策だと言えます。
pt_br: Quando retornando a mensagem após a falha da entrega anterior, recomenda-se introduzir o retorno de desempenho prolongado com a finalidade de se prevenir lixo de falha de entrega, falha de entrega, etc.
zh_cn: 在前一次递送失败后进行重新递送前，采用一定的延迟是有益处的，这是为了阻止连续的递送失败。

source: The default value is <literal>0</literal> which means there will be no delay.
es_es: El valor predeterminado es <literal>0</literal> lo cual significa que no habrá retraso.
fr_fr: Si la valeur par défaut est <literal>0</literal> il n'y aura pas de délai.
ja_jp: デフォルト値は <literal>0</literal> です。これは遅延がないと言う意味です。
pt_br: O valor do padrão é <literal>0</literal>, o que significa que não haverá demora.
zh_cn: 它的缺省值是 <literal>0</literal>，表示没有延迟。

source: Change this if your application could benefit with a delay before redelivery. This value can also be overridden on a per destination basis.
es_es: Cambie esto si su aplicación se puede beneficiar con un retraso antes de la re-entrega. Este valor se puede sobreescribir destino por destino.
fr_fr: Changer ce paramètre si votre application peut bénéficier du délai avant renvoi. Cette valeur peut également être remplacée sur la base de la destination.
ja_jp: 使用中のアプリケーションが、再配信の前に少しの遅延により利便性を得る場合は、 これを変更します。この値も送り先単位基準で書き換えることができます。
pt_br: Altere isto, caso seu aplicativo possa ser beneficiado com a demora, antes do retorno. Este valor pode ser também substituído baseando-se na destinação.
zh_cn: 修改这个值将使你的应用程序受益于重新递送前的延迟。这个值也可以基于每个目的地进行覆盖。

source: Periodically the server will query each queue to gets its statistics. This is the period.
es_es: Preiódicamente el servidor le pedirá a cada cola sus estadísticas. Este es el periodo.
fr_fr: Périodiquement, le serveur interrogera chaque queue pour obtenir ses statistiques. Voici la période.
ja_jp: サーバーは定期的に各 キューにクエリを出してその統計を取得します。これが period (間隔）です。
pt_br: O servidor consultará cada fila para obter suas estatísticas periodicamente. Este é o período.
zh_cn: 服务器将定期低查询每个队列来获取统计信息。这个值表示对应的时间间隔。

source: The default value is <literal>10000</literal> milliseconds.
es_es: El valor predeterminado es <literal>10000</literal> millisegundos.
fr_fr: La valeur par défaut de cette période est de <literal>10000</literal> millesecondes.
ja_jp: デフォルト値は <literal>10000</literal> ミリ秒です。
pt_br: O valor do padrão é <literal>10000</literal> milésimos de segundos.
zh_cn: 它的缺省值是 <literal>10000</literal> 毫秒。

source: The maximum number of milliseconds the client will wait for failover to start on the server side when a problem is detected.
es_es: El número máximo de milisegundos que el cliente esperará para que inicie la conmutación en caso de fallo en el lado del servidor cuando se detecta un problema.
fr_fr: Le nombre maximum de millesecondes que le client devra attendre pour démarrer une reprise du serveur suite à la détection d'un problème.
ja_jp: 問題が検知された時にサーバーサイドでフェイルオーバーが開始するのをクライアントが 待つ最大限ミリ秒です。
pt_br: O número máximo de milésimos de segundos que o cliente esperará pelo failover para iniciar ao lado do servidor, quando o problema for detectado.
zh_cn: 当检测到问题时，客户将等待服务器端启动失效切换的最长时间（毫秒）。

source: The default value is <literal>60000</literal> (one minute).
es_es: El valor predeterminado es <literal>60000</literal> (un minuto).
fr_fr: La valeur par défaut est de <literal>60000</literal> (une minute).
ja_jp: デフォルト値は <literal>60000</literal> （１分）です。
pt_br: O valor padrão é <literal>60000</literal> (um minuto).
zh_cn: 它的缺省值是 <literal>60000</literal>（亦即 1 分钟）。

source: The maximum number of milliseconds the client will wait for failover to complete on the server side after it has started.
es_es: El número máximo de milisegundos que el cliente esperará para que complete la conmutación en caso de fallo en el lado del servidor después de que ha iniciado.
fr_fr: Le nombre maximum de millesecondes qu'un client devra attendre pour une reprise du serveur après son démarrage.
ja_jp: 開始した後にサーバー側でクライアントがフェイルオーバーの完了を待つ最長期間の ミリ秒数です。
pt_br: O número máximo de milésimos de segundos que o cliente esperará pelo failover para completar ao lado do servidor, após isto ter inicializado.
zh_cn: 当失效切换已经启动时，客户将等待服务器端完成失效切换的最长时间（毫秒）。

source: The default value is <literal>300000</literal> (five minutes).
es_es: El valor predeterminado es <literal>300000</literal> (cinco minutos).
fr_fr: La valeur par défaut est de <literal>300000</literal> (cinq minutes).
ja_jp: デフォルト値は <literal>300000</literal> （５分）です。
pt_br: O valor padrão é <literal>300000</literal> (cinco minutos).
zh_cn: 它的缺省值是 <literal>300000</literal>（亦即 5 分钟）。

source: JBoss Messaging provides a message counter history which shows the number of messages arriving on each queue of a certain number of days. This attribute represents the maximum number of days for which to store message counter history. It can be overridden on a per destination basis.
es_es: JBoss Messaging proporciona un historial de conteo de mensajes, el cual muestra el número de mensajes que llegan a cada cola de cierto número de dias. Este atributo representa el número máximo de días que se debe almacenar el historial de conteo de mensajes. Se puede sobreescribir destino por destino.
ja_jp: JBoss Messaging は、任意の日数の間にそれぞれの キュー に到着するメッセージの数量を 示すメッセージカウンターの履歴を提供します。この属性はメッセージカウンターの履歴を保存する最大限の日数を示します。送り先単位基準で書き換えできます。
pt_br: O JBoss Messaging fornece a história do contador de mensagens, do qual apresenta o número de mensagens chegando a cada fila de um certo número de dias. Este atributo representa o número máximo de dias para armazenar a história do contador de mensagem. Isto pode ser substituído baseando-se na destinação.
zh_cn: JBoss Messaging 提供消息计数器的历史记录，它显示一段时间内到达每个队列的消息数量。这个属性代表消息计数器历史存储的最多天数。这个属性可以基于目的地进行覆盖。

source: The name of the connection factory to use for pulling messages between nodes.
es_es: El nombre de la fábrica de conexiones a utilizar para sacar mensajes entre nodos.
fr_fr: Le nom de l'usine de connexion utilisée pour extraire les messages entre les noeuds.
ja_jp: ノード間でメッセージを引き出すのに使用する接続ファクトリの名前です。
pt_br: O nome da criação da conexão de uso para atrair mensagens entre nós.
zh_cn: 用于在节点间传送消息的连接工厂的名称。

source: If you wish to turn off message sucking between queues altogether, but retain failover, then you can ommit this attribute altogether.
es_es: Si desea apagar el succionado de mensajes entre colas, pero desea retener la conmutación en caso de fallo entonces puede omitir todo este atributo.
fr_fr: Si vous souhaitez mettre fin à l'accumulation de messages entre les queues, mais que vous souhaitez conserver la reprise suite à une mise en échec, alors vous pouvez omettre cet attribut.
ja_jp: キュー と キュー の間でのメッセージ吸い取りを完全にオフにして、フェイルオーバーを 維持したい場合は、この属性を全面的に除外できます。
pt_br: Caso você deseje apagar a mensagem absorvida entre as filas em geral, mas retendo o failover, você poderá omitir este atributo.
zh_cn: 如果你希望关闭队列间的消息 sucking，但保留失效切换，你可以忽略这个属性。

source: If true, then strict JMS ordering is preserved in the cluster. See the cluster configurations section for more details. Default is false.
es_es: Si es true entonces el ordenamiento JMS estricto se preserva en el clúster. Consulte la sección sobre configuraciones del clúster para obtener mayores detalles. Por defecto es falso.
fr_fr: Si 'vrai', alors l'ordonnancement strict JMS est préservé pour le groupement. Voir la section sur les options de configuration du groupement pour davantage d'informations. La valeur par défaut est 'faux'.
ja_jp: 「true」の場合は、厳格な JMS 順番付けはクラスター内で保存されています。 詳細はクラスター設定のセクションでご覧下さい。デフォルトは「false」です。
pt_br: Caso verdadeira, então a solicitação JMS explícita será preservada. Consulte a seção de configurações de cluster para maiores detalhes. O padrão é falso.
zh_cn: 如果为 true，群集里将应用严格的 JMS 顺序。更多细节请参考群集配置部分的内容。它的缺省值是 false。

source: When failover occurs, already delivered messages will be kept aside, waiting for clients to reconnect. In the case that clients never reconnect (e.g. the client is dead) then eventually these messages will timeout and be added back to the queue. The value is in ms. The default is 5 mins.
es_es: Cuando la conmutación en caso de fallo tiene lugar, los mensajes que ya se han entregado se mantienen aparte, esperando que los clientes se reconecten. Dado el caso en que los clientes nunca se vuelvan a conectar (por ejemplo el cliente está muerto) entonces eventualmente estos mensajes expirarán y se añadirán de regreso a la cola. El valor se da en milisegundos. Por defecto es 4 minutos.
fr_fr: En cas de reprise, les messages qui ont déjà été livrés seront mis de côté, en attendant que les clients ne se reconnectent. Dans le cas où les clients ne se reconnectent jamais (par ex. le client est hors d'usage) alors ces messages seront repris dans la file d'attente après un certain délai. La valeur est en ms. La valeur par défaut est de 5 mins.
ja_jp: フェイルオーバーが発生すると、既に配信済みのメッセージは部外に保存されて、 クライアントの再接続を待ちます。クライアントが再接続を出来ない状況（例： クライアント停止）になると最終的にこれらのメッセージは時間切れとなり、 キュー に戻されます。数値は ms で示します。デフォルトは 5 分 です。
pt_br: Quando o failover ocorrer, as mensagens já entregues serão mantidas à parte, esperando que os clientes re-conectarem. No caso destes clientes não re-conectarem (por exemplo: o cliente estiver dead), estas mensagens, eventualmente, irão sofrer um intervalo e serão adicionadas de volta à fila. O valor é em ms. O padrão é 5 minutos.
zh_cn: 当发生失效切换时，已经递送的消息将被置于一旁，等待客户端的重新连接。如果客户端不在重新连接（如客户端崩溃），那么这些消息最终将超时并放回队列。它以毫秒为单位，缺省值是 5 毫秒。

source: Set this to true to enable message counters when the server starts
es_es: Configúrelo como verdadero para activar los contadores de mensajes cuando el servidor arranca.
fr_fr: Paramétrer à 'true' (vrai) pour activer les compteurs de messages quand le serveur démarre.
ja_jp: サーバー開始時にメッセージカウンターを有効にするには、これを「true」にセットします。
pt_br: Configure isto para verdadeiro para ativar os contadores de mensagem quando o servidor inicializar.
zh_cn: 设置为 true 可以在服务器启动时启用消息计数器。

source: JBoss Messaging internally makes connections between nodes in order to redistribute messages between clustered destinations. These connections are made with the user name of a special reserved user. The password used by that user is specified by this parameter.
es_es: JBoss Messaging internamente realiza conexiones entre nodos con el fin de redistribuir los mensajes entre destinos en clústers. Estas conexiones se realizan con el nombre de usuario de un usuario reservado especial.
fr_fr: JBoss Messaging fait des connections internes entre les noeuds en vue de redistribuer les messages entre les destinations groupées. Ces connexions sont faites par l'intermédiaire du nom d'utilisation d'un utilisateur spécialement réservé. Le mot de passe utilisé par cet utilisateur est précisé par ce paramètre.
ja_jp: JBoss Messaging は内部でノード間の接続を行い、クラスター化した送り先の間で メッセージを再分散できるようにします。これらの接続は特別に予約してあるユーザーの ユーザー名で行われます。そのユーザーに使用されるパスワードはこのパラメータで指定 されます。
pt_br: O JBoss Messaging realiza conexões com a finalidade de re-distribuição de mensagens entre destinações com cluster. Estas conexões são feitas com o nome do usuário, de um usuário reservado especial. A senha usada pelo usuário é especificada por este parâmetro.
zh_cn: JBoss Messaging 在节点间创建内部的连接来在群集目的地间重新分发消息。这些连接使用特殊的保留用户的名称进行创建。这个参数指定该用户使用的密码。

source: This must be specified at install time, or the default password will be used. Any one who then knows the default password will be able to gain access to any destinations on the server. This value MUST be changed at install time.
es_es: Esto se debe especificar en el momento de la instalación o de otra manera se utilizará la contraseña predeterminada. Cualquier persona que conozca la contraseña predeterminada podrá ganar acceso a cualquier destino en el servidor. Este valor se TIENE que cambiar en el momento de la instalación.
fr_fr: Il devra être spécifié pendant l'installation, sinon le mot de passe par défaut sera utilisé. Toute personne qui connaît le mot de passe par défaut sera en mesure d'avoir accès à n'importe quelle destination sur le serveur. La valeur DOIT être changée pendant l'installation.
ja_jp: これはインストール時点で指定される必要があります。そうしないとデフォルトの パスワードが使用されます。その場合、デフォルトのパスワードを知る誰でもが そのサーバーのどの送り先 にでもアクセスを得ることになります。この値は インストール時点に変更しなければなりません。
pt_br: Isto deve ser especificado no período de instalação, do contrário a senha padrão será utilizada. Qualquer pessoa que possui conhecimento da senha padrão, estará apta a acessar qualquer destinação no servidor. O valor DEVE ser modificado no período de instalação.
zh_cn: 这必须在安装时指定，否则缺省密码将被使用。任何知道缺省密码的人都可以访问服务器上的任何目的地。这个值必须在安装时进行修改。

source: Set to true if you want strict JMS TCK semantiocs
es_es: Configúrelo como verdadero si quiere una semántica JMS TCK estricta
fr_fr: Paramétrer à 'true' (vrai) si vous souhaitez une sémantique JMS TCK stricte
ja_jp: 厳密な JMS TCK セマンティクスを使用する場合は「true」にセットします。
pt_br: Configure para verdadeiro caso você queira semânticas JMS TCK explícitas.
zh_cn: 如果你想应用严格的 JMS TCK 模式，将其设置为 true。

source: Destinations
es_es: Destinos
ja_jp: 送り先（Destination）
pt_br: Destinações

source: Returns a list of the destinations (queues and topics) currently deployed.
es_es: Retorna una lista de los destinos (colas y temas) actualmente desplegados.
fr_fr: Retourne une liste de destinations (listes d'attente et sujets) couramment déployée.
ja_jp: 現在デプロイされている送り先（キュー と トピック）の一覧を返します。
pt_br: Retorna a lista de destinações (filas e tópicos) atualmente implementadas.
zh_cn: 返回目前部署的目的地（队列和主题）列表。

source: JBoss Messaging provides a message counter for each queue.
es_es: JBoss Messaging proporciona un contador de mensajes para cada cola.
fr_fr: JBoss Messaging propose un système de comptage des messages pour chaque queue.
ja_jp: JBoss Messaging は各キューの為のメッセージカウンターを提供します。
pt_br: O JBoss Messaging fornece um contador de mensagem para cada fila.
zh_cn: JBoss Messaging 为每个队列提供了一个消息计数器。

source: JBoss Messaging provides statistics for each message counter for each queue.
es_es: JBoss Messaging proporciona estadísticas para cada contador de mensajes para cada cola.
fr_fr: JBoss Messaging propose des statistiques pour le comptage des messages de chaque queue.
ja_jp: JBoss Messaging 各キュー 用のそれぞれのメッセージカウンターの統計を提供します。
pt_br: O JBoss Messaging fornece estatísticas para cada contador de mensagens de cada fila.
zh_cn: JBoss Messaging 也为每个队列的每个消息计数器提供统计信息。

source: Set to false to prevent server side failover occurring in a cluster when a node crashes.
es_es: Configúrelo como falso para prevenir la conmutación en caso de fallo del lado del servidor en un clúster cuando un nodo se cuelga.
fr_fr: Paramétrer à 'faux' pour éviter un échec du côté du serveur au niveau d'un groupement en cas de plantage d'un noeud.
ja_jp: 「false」にセットすると、ノードがクラッシュした時にクラスター内で発生するサーバー サイドのフェイルオーバーを阻止することができます。
pt_br: Configure isto para falso para prevenir que ocorra failover ao lado do servidor num cluster, quando o nó falhar.
zh_cn: 如设置为 false，当节点崩溃时会阻止群集里服务器端的失效切换。

source: This is the persistence manager that the ServerPeer uses. You will not normally need to change this attribute.
es_es: Este es el administrador de persistencia que el ServerPeer utiliza. Normalmente no es necesario que cambie este atributo.
fr_fr: Il s'agit du gestionnaire de persistance que ServerPeer utilise. Vous n'aurez normalement pas besoin de changer cet attribut.
ja_jp: これは、ServerPeer が使用する永続化マネージャです。この属性は通常、変更する必要は ありません。
pt_br: Este é o gerenciador de persistência que o ServerPeer utiliza. Você não irá normalmente precisar modificar este atributo.
zh_cn: 这是 ServerPeer 使用的 persistence manager。你通常不需要修改这个属性。
