Repository: bobmcwhirter/jboss-messaging
Catalog: docs/EAP_4_3/JBoss_Messaging_User_Guide/*/Configuration.po
Languages: es_es, fr_fr, ja_jp, pt_br, zh_cn

source: This is the JMS user manager that the ServerPeer uses. You will not normally need to change this attribute.
es_es: Este es el administrador del usuario JMS que el ServerPeer utiliza. Normalmente no es necesario cambiar este atributo.
fr_fr: Il s'agit du gestionnaire de l'utilisateur JMS que le ServerPeer utilise. Vous n'aurez normalement pas besoin de changer cet attribut.
ja_jp: これは、ServerPeer ユーザーが使用する JMS ユーザーマネージャです。 通常は、この属性を変更する必要はありません。
pt_br: Este é o gerenciador do usuário que o ServerPeer utiliza. Normalmente, você não precisará modificar este atributo.
zh_cn: 这是 ServerPeer 使用的 JMS user manager。你通常不需要修改这个属性。

source: MBean operations of the ServerPeer MBean.
es_es: Operaciones MBean del ServerPeer MBean.
fr_fr: Opérations MBean du ServerPeer MBean.
ja_jp: ServerPeer MBean の MBean オペレーションです。
pt_br: Operações MBean do ServerPeer MBean.
zh_cn: ServerPeer MBean 的 MBean 操作。

source: This operation lets you programmatically deploy a queue.
es_es: Esta operación le permite implementar programáticamente una cola.
fr_fr: Cette opération vous laisse déployer une file d'attente par programme.
ja_jp: このオペレーションにより キューをプログラムでデプロイできるようになります。
pt_br: Esta operação permite você implementar uma fila de forma programática.
zh_cn: 这个操作可让你在程序里部署队列。

source: There are two overloaded versions of this operation
es_es: Hay dos versiones sobrecargadas de esta operación.
fr_fr: Il existe deux versions de cette opération qui sont surchargées
ja_jp: このオペレーションには２つの追加ロードのバージョンがあります。
pt_br: Existem duas versões sobrecarregadas desta operação.
zh_cn: 这个操作有两个重载的版本

source: If the queue already exists but is undeployed it is deployed. Otherwise it is created and deployed.
es_es: Si la cola ya existe pero no se ha implementado entonces se implementa. De otra manera se crea y se implementa.
fr_fr: Si la file d'attente existe déjà, mais qu'elle n'est pas déployée, alors cette opération est déployée, sinon elle est créée et déployée.
ja_jp: キュー が既に存在してまだデプロイされていない場合、デプロイされます。存在しない場合は 作成されてデプロイされます。
pt_br: Caso a fila já existir mas estiver desimplementada, ela será implementada. Do contrário, ela será criada e implementada.
zh_cn: 如果队列存在但已卸载，它将被部署。否则队列将被创建并部署。

source: The <literal>name</literal> parameter represents the name of the destination to deploy.
es_es: El parámetro <literal>name</literal> representa el nombre del destino a desplegar.
fr_fr: Le paramètre du <literal>nom</literal> représente le nom de la destination à déployer.
ja_jp: <literal>name</literal> パラメータはデプロイする送り先 の名前を表示します。
pt_br: O parâmetro <literal>name</literal> representa o nome da destinação para implementação.
zh_cn: <literal>name</literal> 参数代表要部署的目的地的名称。

source: The <literal>jndiName</literal> parameter (optional) represents the full jndi name where to bind the destination. If this is not specified then the destination will be bound in &lt;DefaultQueueJNDIContext&gt;/&lt;name&gt;.
es_es: El parámetro <literal>jndiName</literal> (opcional) representa el nombre jndi completo a donde vincular el destino. Si no se especifica entonces el destino se vinculará en &lt;DefaultQueueJNDIContext&gt;/&lt;name&gt;.
fr_fr: Le paramètre <literal>jndiName</literal> (optionnel) représente le nom complet jndi à relier à la destination. Si ce nom n'est pas spécifié, alors la destination devra être reliée à &lt;DefaultQueueJNDIContext&gt;/&lt;name&gt;.
ja_jp: <literal>jndiName</literal> パラメータ（オプション）は、送り先 を バインドする場所の完全な jndi の名前です。これが指定されていないと、 送り先は &lt;DefaultQueueJNDIContext&gt;/&lt;name&gt; 内で バインドされます。
pt_br: O parâmetro (opcional) <literal>jndiName</literal> representa o nome jndi completo para vincular a destinação. Caso isto não seja especificado, então a destinação será vinculada em &lt;DefaultQueueJNDIContext&gt;/&lt;name&gt;.
zh_cn: <literal>jndiName</literal> 参数（可选）代表目的地绑定的 JNDI 全名。如果没有被指定，那么这个目的地将绑定在 &lt;DefaultQueueJNDIContext&gt;/&lt;name&gt;。

source: The first version of this operation deploys the destination with the default paging parameters. The second overloaded version deploys the destination with the specified paging parameters. See the section on configuring destinations for a discussion of what the paging parameters mean.
es_es: La primera versión de esta operación implementa el destino con los parámetros de paginación predeterminados. La segunda versión sobrecargada despliega el destino con los parámetros de paginación especificados. Consulte la sección sobre como configurar destinos y allí encontrará una discusión sobre lo que los parámetros de paginación significan.
fr_fr: La première version de cette opération déploie la destination avec les paramètres de pagination par défaut. La deuxième version déploie la destination associée à des paramètres de pagination spécifiques. Voir la section sur la configuration des destinations pour une discussion sur la signification des paramètres de pagination.
ja_jp: このオペレーションの最初のバージョンはデフォルトのページングパラメータを持った 送り先をデプロイします。２番目のオーバーロードのバージョンは指定した ページングパラメータを持つ 送り先 をデプロイします。ページングパラメータの 意味に関する説明については送り先の設定のセクションを参照してください。
pt_br: A primeira versão desta operação implementa a destinação com os parâmetros de paginação padrão. A segunda versão sobrecarregada implementa a destinação com os parâmetros de paginação especificados. Veja a seção sobre a configuração de destinações, para um melhor entendimento dos parâmetros de paginação.
zh_cn: 这个操作的第一个版本用缺省的页面参数部署目的地。第二个重载的版本用指定的页面参数部署目的地。关于页面参数的定义，请参考目的地配置部分的内容。

source: This operation lets you programmatically undeploy a queue.
es_es: Esta operación le permite desimplementar programáticamente una cola.
fr_fr: Cette opération vous laisse désactiver le déploiement d'une file d'attente.
ja_jp: このオペレーションによりキューをプログラムでデプロイ解除できるようになります。
pt_br: Esta operação permite você desimplementar uma fila de forma programática.
zh_cn: 这个操作让你可以在程序里卸载队列。

source: The queue is undeployed but is NOT removed from persistent storage.
es_es: Esta cola está desimplementada pero no se remueve del almacenamiento persistente.
fr_fr: Le déploiement de la file d'attente est désactivé, mais n'est PAS retiré de la zone de stockage persistante.
ja_jp: キュー はデプロイ解除になりますが、永続化ストレージからは排除されません。
pt_br: A fila é desimplementada, mas NÃO é removida a partir do armazenamento de persistência.
zh_cn: 这个队列将被卸载但不会从持久性存储里删除。

source: This operation returns <literal>true</literal> if the queue was successfull undeployed, otherwise it returns <literal>false</literal>.
es_es: Esta operación retorna <literal>true</literal> si la cola fue desimplementada exitósamente. De otra manera retorna <literal>false</literal>.
ja_jp: このオペレーションは、キューが正しくデプロイ解除されると <literal>true</literal> を返します。解除されない場合は、<literal>false</literal> を返します。
pt_br: A operação retorna para <literal>true</literal> caso a fila seja desimplementada com êxito. Do contrário ela retornará para <literal>false</literal>.
zh_cn: 如果队列被成功卸载，那么这个操作返回 <literal>true</literal>。否则返回 <literal>false</literal>。

source: This operation lets you programmatically destroy a queue.
es_es: Esta operación le permite destruir una cola programáticamente.
fr_fr: Cette opération vous laisse détruire une file d'attente par programme.
ja_jp: このオペレーションは、プログラムで キューを破壊するようにします。
pt_br: Esta operação permite você extinguir de forma programática a fila.
zh_cn: 这个操作可让你在程序里销毁队列。

source: The queue is undeployed and then all its data is destroyed from the database.
es_es: La cola es desimplementada y luego todos sus datos se destruyen de la base de datos.
fr_fr: Le déploiement de la file d'attente est désactivé et toutes ses données sont détruites dans la base de données.
ja_jp: キューはデプロイ解除となり、その後全てのデータはデータベースから破壊されます。
pt_br: A fila é desimplementada e então todos os próprios dados são extinguidos, a partir do banco de dados.
zh_cn: 队列被卸载，然后所有的数据将从数据库里销毁。

source: Be careful when using this method since it will delete all data for the queue.
es_es: Tenga cuidado al utilizar este método ya que borrará todos los datos para la cola.
fr_fr: Soyez vigilants lorsque vous utilisez cette méthode car cela va entraîner la suppression de toutes les données de la file d'attente.
ja_jp: この方法を使用する場合、キューの全てのデータが削除されますので注意が 必要です。
pt_br: Tenha bastante cautela quando utilizando este método, uma vez que ele deletará todos os dados da fila.
zh_cn: 在使用这个方法要小心，因为它将删除队列的所有数据。

source: This operation returns <literal>true</literal> if the queue was successfully destroyed. otherwise it returns <literal>false</literal>.
es_es: Esta operación retorna <literal>true</literal> si la cola se destruyó éxitosamente. De otra manera retorna <literal>false</literal>.
fr_fr: Cette opération retourne <literal>true</literal> (vrai) si la file d'attente a bien été détruite, sinon cette opération retourne <literal>false</literal> (faux).
ja_jp: このオペレーションは、キュー が正しくデプロイされると <literal>true</literal> を 返します。デプロイされないと <literal>false</literal> を返します。
pt_br: Esta operação retorna para <literal>true</literal>, caso a fila tenha sido extinguida com sucesso. Do contrário, ela retornará para <literal>false</literal>.
zh_cn: 如果队列被成功销毁，这个操作返回 <literal>true</literal>。否则返回 <literal>false</literal>。

source: This operation lets you programmatically deploy a topic.
es_es: Esta operación le permite desplegar programáticamente un tema.
fr_fr: Cette opération vous laisse déployer un sujet par programme.
ja_jp: このオペレーションはプログラムでトピックをデプロイするようにします。
pt_br: Esta operação permite você implementar de forma programática o tópico.
zh_cn: 这个操作让你在程序里部署主题。

source: There are two overloaded versions of this operation.
es_es: Hay dos versiones sobrecargadas de esta operación.
fr_fr: Il existe deux versions surchargées de cette opération.
ja_jp: このオペレーションには２つのオーバーロードバージョンがあります。
pt_br: Existem duas versões sobrecarregadas desta operação.
zh_cn: 这个操作有两个重载的版本。

source: If the topic already exists but is undeployed it is deployed. Otherwise it is created and deployed.
es_es: Si el tema ya existe pero no se ha implementado entonces se implementa. De otra forma se crea y se implementa.
fr_fr: Si le sujet existe déjà mais qu'il n'est pas déployé, alors cette opération est déployée, sinon elle est créée et déployée.
ja_jp: トピックが既に存在していてデプロイ解除になっていると、それはデプロイされます。 存在しない場合は、作成されてデプロイされます。
pt_br: Caso o tópico já existir mas estiver desimplementado, ele será implementado. Do contrário, ele será criado e implementado.
zh_cn: 如果主题已存在但未卸载，那么它将被部署。否则它将被创建并部署。

source: The <literal>jndiName</literal> parameter (optional) represents the full jndi name where to bind the destination. If this is not specified then the destination will be bound in &lt;DefaultTopicJNDIContext&gt;/&lt;name&gt;.
es_es: El parámetro <literal>jndiName</literal> (opcional) representa el nombre jndi completo a donde vincular el destino. Si esto no se especifica entonces el destino se vincula en &lt;DefaultTopicJNDIContext&gt;/&lt;name&gt;.
fr_fr: Le paramètre <literal>jndiName</literal> (optionnel) représente le nom jndi complet où relier la destination. S'il n'est pas spécifié, alors la destination sera reliée à &lt;DefaultTopicJNDIContext&gt;/&lt;name&gt;.
ja_jp: <literal>jndiName</literal> パラメータ（オプション）は送り先をバインドする場所の 完全な jndi の名前です。これが指定されていないと、送り先 は &lt;DefaultTopicJNDIContext&gt;/&lt;name&gt; 内にバインドされます。
pt_br: O parâmetro (opcional) <literal>jndiName</literal> representa o nome jndi completo pelo qual vincula a destinação. Caso isto não seja especificado, então a destinação será vinculada em &lt;DefaultTopicJNDIContext&gt;/&lt;name&gt;.
zh_cn: <literal>jndiName</literal> 参数（可选）代表绑定目的地的 JNDI 全名。如果它没有被指定，那么这个目的地将绑定在 &lt;DefaultTopicJNDIContext&gt;/&lt;name&gt;。

source: This operation lets you programmatically undeploy a topic.
es_es: Esta operación le permite desimplementar programáticamente un tema.
fr_fr: Cette opération vous laisse désactiver le déploiement d'un sujet par programme.
ja_jp: このオペレーションは プログラムでトピックをデプロイ解除するようにします。
pt_br: Esta operação permite você desimplementar de forma programática um tópico.
zh_cn: 这个操作让你可以在程序里卸载主题。

source: This operation returns <literal>true</literal> if the topic was successfully undeployed. otherwise it returns <literal>false</literal>.
es_es: Esta operación retorna <literal>true</literal> si el tema de desimplementó con éxito. De otra manera retorna <literal>false</literal>.
fr_fr: Cette opération retourne <literal>true</literal> (vrai) si le sujet n'était pas déployé correctement, sinon cette opération retourne <literal>false</literal> (faux).
ja_jp: このオペレーションは、トピックが正しくデプロイ解除されると <literal>true</literal> を 返して、解除されないと <literal>false</literal> を返します。
pt_br: Esta operação retorna para <literal>true</literal>, caso o tópico tenha sido desimplementado com êxito. Do contrário, ele retornará para <literal>false</literal>.
zh_cn: 如果主题被成功卸载，这个操作返回 <literal>true</literal>。否则返回 <literal>false</literal>。

source: This operation lets you programmatically destroy a topic.
es_es: Esta operación le permite destruir programáticamente un tema.
fr_fr: Cette opération vous laisse détruire un sujet par programme.
ja_jp: このオペレーションはプログラムでトピックを破壊するようにします。
pt_br: Esta operação permite você extinguir de forma programática um tópico.
zh_cn: 这个操作可让你在程序里部署主题。

source: The topic is undeployed and then all its data is destroyed from the database.
es_es: El tema se desimplementa y luego todos los datos se destruyen de la base de datos.
fr_fr: Le déploiement d'un sujet est désactivé et toutes ses données sont détruites dans la base de données.
ja_jp: トピックはデプロイ解除になり、その後その全てのデータはデータベースから破壊されます。
pt_br: Este tópico é desimplementado e então todos os seus próprios dados, a partir do banco de dados.
zh_cn: 主题被卸载，然后它的所有数据都会从数据库里销毁。

source: Be careful when using this method since it will delete all data for the topic.
es_es: Tenga cuidado al utilizar este método ya que borrará todos los datos para el tema.
fr_fr: Soyez vigilants lorsque vous utiliserez cette méthode car toutes les données relatives au sujet seront supprimées.
ja_jp: この方法を使用する場合、トピックの全てのデータが削除されるため注意が 必要です。
pt_br: Tenha muito cuidado quando utilizando este método, uma vez que isto deletará todos os dados, a partir do tópico.
zh_cn: 请小心使用这个方法，因为它将删除主题的所有数据。

source: This operation returns <literal>true</literal> if the topic was successfully destroyed. otherwise it returns <literal>false</literal>.
es_es: Esta operación retorna <literal>true</literal> si el tema fue destruido exitósamente. De otra forma retorna <literal>false</literal>.
fr_fr: Cette opération retourne <literal>true</literal> (vrai) si le sujet est détruit, sinon cette opération retourne <literal>false</literal> (faux).
ja_jp: このオペレーションは、トピックが正しく破壊されると <literal>true</literal> を 返して、破壊されないと <literal>false</literal> を返します。
pt_br: Esta operação retorna para <literal>true</literal>, caso o tópico tenha sido extinguido com êxito. Do contrário, ele retornará para <literal>false</literal>.
zh_cn: 如果主题被成功销毁，这个操作返回 <literal>true</literal>，否则返回 <literal>false</literal>。

source: This operation returns message counters in an easy to display HTML format.
es_es: Esta operación retorna contadores de mensajes en un formato HTML fácil de presentar.
fr_fr: Cette opération retourne les compteurs de messages dans un format HTML facile à afficher.
ja_jp: このオペレーションはメッセージカウンターを表示し易い HTML 形式で 返します。
pt_br: Esta operação retorna os contadores de mensagem para exibição simples do formato HTML.
zh_cn: 这个操作返回 HTML 格式的消息计数器。

source: This operation resets all message counters to zero.
es_es: Esta operación reestablece todos los contadores de mensajes a cero.
fr_fr: Cette opération restaure les compteurs de messages à zéro.
ja_jp: このオペレーションは全てのメッセージカウンターをゼロに リセットします。
pt_br: Esta operação configura novamente todos os contadores de mensagem para zero.
zh_cn: 这个操作将所有消息计数器清零。

source: This operation resets all message counter histories to zero.
es_es: Esta operación reestablece todo el historial del contador de mensajes a cero.
fr_fr: Cette opération restaure tous les historiques de compteurs de messages à zéro.
ja_jp: このオペレーションは全てのメッセージカウンター履歴をゼロに リセットします。
pt_br: Esta operação configura novamente todas as histórias de contadores de mensagens para zero.
zh_cn: 这个操作将所有消息计数器历史清零。

source: This operation enables all message counters for all destinations. Message counters are disabled by default.
es_es: Esta operación activa todos los contadores de mensajes para todos los destinos. Los contadores de mensajes están desactivados por defecto.
fr_fr: Cette opération active tous les compteurs de messages pour toutes des destinations. Les compteurs de messages sont désactivés par défaut.
ja_jp: このオペレーションは全ての送り先用に全てのメッセージカウンターを有効にします。メッセージ カウンターはデフォルトで無効になっています。
pt_br: Esta operação ativa todos os contadores de mensagem para todas as destinações. Os contadores de mensagens estão desativados pelo padrão.
zh_cn: 这个操作为所有目的地启用消息计数器。消息计数器缺省是禁用的。

source: This operation disables all message counters for all destinations. Message counters are disabled by default.
es_es: Esta operación desactiva todos los contadores de mensajes para todos los destinos. Los contadores de mensajes están desactivados por defecto.
fr_fr: Cette opération désactive tous les compteurs de messages pour toutes les destinations. Les compteurs de message sont désactivés par défaut.
ja_jp: このオペレーションは、全ての 送り先用に全てのメッセージカウンターを無効にします。 メッセージカウンターはデフォルトで無効になっています。
pt_br: Esta operação desativa todos os contadores de mensagem para todas as destinações. Os contadores de mensagens são desativados pelo padrão.
zh_cn: 这个操作禁用所有目的地的消息计数器。消息计数器缺省是禁用的。

source: Retrieves a list of the Xids for all transactions currently in a prepared state on the node.
es_es: Recupera una lista de los Xids para todas las transacciones actualmente en un estado preparado en el nodo.
fr_fr: Récupère une liste des Xids pour toutes les transactions actuellement dans un état 'préparé' (prepared) dans le noeud.
ja_jp: 現在ノードで準備完了の状態にある全てのトランザクション用の Xid の一覧を 取り込みます。
pt_br: Resgata a lista de Xids para todas as transações correntes num estado preparado do nó.
zh_cn: 获取节点上当前处于 prepared 状态的所有事务的 XID 列表。

source: Retrieves a list of the Xids for all transactions currently in a prepared state on the node in an easy to display HTML format.
es_es: Recupera una lista de los Xids para todas las transacciones actualmente en un estado preparado en el nodo en un formato HTML de fácil presentación.
fr_fr: Récupère une liste des Xids pour toutes les transactions actuellement dans un état 'préparé' (prepared state) sur le noeud dans un format HTML facile à afficher.
ja_jp: 現在ノードで準備完了の状態にある全てのトランザクション用の Xid の一覧を 表示が簡単な HTML 形式で取り込みます。
pt_br: Resgata a lista de Xids para todas as transações atuais, num estado preparado do nó, exibindo de maneira simples o formato HTML.
zh_cn: 获取节点上当前处于 prepared 状态的所有事务的 XID 列表，并以 HTML 形式显示。

source: Changing the Database
es_es: Cambio de la base de datos
fr_fr: Modifier la Base de données
ja_jp: データベースの変更
pt_br: Modificação do Banco de Dados
zh_cn: 修改数据库
