Repository: bobmcwhirter/jboss-messaging
Catalog: docs/EAP_4_3/JBoss_Messaging_User_Guide/*/Configuration.po
Languages: es_es, fr_fr, ja_jp, pt_br, zh_cn

source: If duplicate detection (See <literal>DetectDuplicates</literal>) is enabled, then the server will remember the last <literal>n</literal> message ids sent. This will prevent sending duplicate messages after a failover has occurred. The value of <literal>n</literal> is determined by this attribute.
es_es: Si se activa la detección duplicada (consulte <literal>DetectDuplicates</literal>) entonces el servidor recordará los últimos <literal>n</literal> ids de mensaje enviados. Esto evitará el enviar duplicas de mensajes después de que ha tenido lugar una conmutación en caso de fallo. El valor de <literal>n</literal> está determinado por este atributo.
fr_fr: Si on active la détection de duplicata (voir <literal>DetectDuplicates</literal>), alors le serveur mémorisera les derniers <literal>n</literal> messages ids. Ceci permettra d'éviter d'envoyer des messages en duplicata suite à une mise en échec. La valeur de <literal>n</literal> est déterminée par l'attribut.
ja_jp: 重複検出（<literal>DetectDuplicates</literal> 参照）が有効になっている場合、 サーバーは送信された最後の <literal>n</literal> メッセージアイデンティティを記憶して います。これが、フェイルオーバー発生以降に重複メッセージの送信を防止します。 <literal>n</literal> の値はこの属性で決定されます。
pt_br: Caso uma detecção duplificada seja ativada (consulte <literal>DetectDuplicates</literal>), então o servidor irá relembrar as últimas ids de mensagem <literal>n</literal>. Isto impedirá o envio de mensagens duplicadas após o failover ter ocorrido. O valor do <literal>n</literal> é determinado por este atributo.
zh_cn: 如果启用了对重复消息的检测（请参考 <literal>DetectDuplicates</literal>），那么服务器将记住最后发送的 <literal>n</literal> 条消息的 ID。这将阻止发生故障后发送重复的消息。<literal>n</literal> 由这个属性指定。

source: By default the value of the <literal>IDCacheSize</literal> attribute is set to <literal>500.</literal>
es_es: Por defecto el valor del atributo <literal>IDCacheSize</literal> está configurado como <literal>500.</literal>
fr_fr: Par défaut, la valeur de l'attribut de <literal>IDCacheSize</literal> est fixée à <literal>500.</literal>
ja_jp: <literal>IDCacheSize</literal>属性の値は、デフォルトで <literal>500.</literal> に セットされています。
pt_br: O valor do atributo <literal>IDCacheSize</literal> é configurado para <literal>500</literal>, pelo padrão.
zh_cn: <literal>IDCacheSize</literal> 属性的缺省值为 <literal>500</literal>。

source: The name of the post office.
es_es: El nombre de la oficina postal.
fr_fr: Le nom de l'attribut Post office.
ja_jp: ポストオフィスの名前です。
pt_br: O nome do correio.
zh_cn: 邮局的名称。

source: This returns set containing the node ids of all the nodes in the cluster.
es_es: Este grupo de retornos que contiene los ids de nodos de todos los nodos en el clúster.
fr_fr: Cela a pour effet de retourner l'ensemble des ids de tous les noeuds présents dans le groupement.
ja_jp: これは、クラスター内の全てのノードのノードアイデンティティを含むセットを 返します。
pt_br: Isto retorna a configuração contendo as ids do nó de todos os nós num cluster.
zh_cn: 它返回包含群集里所有节点的 ID 的集合。

source: All post offices in the cluster with the same group name will form a cluster together. Make sure the group name matches with all the nodes in the cluster you want to form a cluster with.
es_es: Todas las oficinas postales en el clúster con el mismo nombre de grupo formarán un clúster. Asegúrese de que el nombre de grupo coincide con todos los nodos en el clúster con los que quiere formar un clúster.
fr_fr: Tous les attributs Post office présents dans le groupement possédant le même nom de groupe formeront un groupement par lui-même. Veillez bien à ce que le nom du groupe corresponde bien à tous les noeuds présents dans le groupement à partir duquel vous souhaitez créer un groupement.
ja_jp: 同じグループ名を使用するクラスター内の全てのポストオフィスは一緒にそれ自身の１つのクラスターを 組織します。そのグループ名が、新クラスターを組織するメンバーとなる全てのノードと 一致することを確認して下さい。
pt_br: Todos os correios num cluster com o mesmo nome de grupo formarão um cluster juntos. Tenha certeza que o nome do grupo combina com todos os outros nós no cluster em que você deseje formar.
zh_cn: 群集里的所有具有相同组名的邮局将组成一个群集。请确保组名匹配你希望组成群集的所有节点。

source: If true the post office will take part in a cluster to form distributed queues and topics. If false then it will not participate in the cluster. If false, then all the cluster related attributes will be ignored.
es_es: Si es verdadero la oficina postal tomará parte en un clúster para formar temas y colas distribuidas. Si es falso entonces no participará en el clúster. Si es falso entonces todos los atributos relacionados con el clúster se ignorarán.
fr_fr: Si 'vrai' Post office participera à un groupement pour former des files d'attente et des sujets distribués. Si 'faux', alors Post office ne participera pas à un groupement. Si 'faux', alors tous les attributs liés à un groupement seront ignorés.
ja_jp: 「true」の場合は、ポストオフィスは分散型の キュー と トピック を組織するために クラスター内で役割を果たします。「false」の場合は、ポストオフィスはクラスターに 参加しません。「false」の場合には、全てのクラスター関連の属性が無視されます。
pt_br: O correio fará parte de um cluster para formar filas e tópicos distribuídos, se for verdadeiro. Caso seja falso, isto não participará num cluster. Adicionado a isto, caso seja falso, todos os atributos de cluster relacionados serão ignorados.
zh_cn: 如果为 true，邮局将参与群集来组成分布式的队列和主题。如果为 false 则不参与群集，且所有和群集相关的属性都会被忽略。

source: The maximum time to wait when waiting for the group state to arrive when a node joins a pre-existing cluster.
es_es: El tiempo máximo de espera al esperar la llegada del estado del grupo cuando un nodo se une a un clúster que existía previamente.
fr_fr: La période maximum d'attente pour l'arrivée d'un état de groupe quand un noeud rejoint un groupement pré-existant.
ja_jp: ノードが以前から存在するクラスターに参加する時にグループ状態が到着するのを待つ時の 最大待機 時間です。
pt_br: O tempo máximo de espera quando aguardando pela chegada do estado do grupo, uma vez que um nó junta-se a um cluster pré-existente.
zh_cn: 当某个节点加入现有的群集时，在组状态到达前等待的最长时间。

source: The default value is <literal>5000</literal> milliseconds.
es_es: El valor predeterminado es <literal>5000</literal> milisegundos.
fr_fr: La valeur par défaut est de <literal>5000</literal> millésecondes.
ja_jp: デフォルト値は <literal>5000</literal> ミリ秒です。
pt_br: O valor do padrão é <literal>5000</literal> milésimos de segundos.
zh_cn: 它的缺省值为 <literal>5000</literal> 毫秒。

source: The maximum time to wait for a reply casting message synchronously.
es_es: El tiempo máximo en espera de un mensaje casting de respuesta sincrónicamente.
fr_fr: La période d'attente maximum pour un message casting réponse synchrone.
ja_jp: 同期的にメッセージをキャストする返信を待つ最大時間です。
pt_br: O período máximo de espera para responder uma mensagem em sincronia.
zh_cn: 同步转换消息回复的最长等待时间。

source: If this attribute is set to <literal>true</literal>, when a server node is shut down cleanly, any connections on the node that is shut down, will failover onto another node.
es_es: Si este atributo se configura como <literal>true</literal>, cuando el nodo de un servidor se apaga de manera limpia, cualquier conexión que se apague en el nodo, realizará una conmutación en caso de fallo a otro nodo.
fr_fr: Si cet attribut est configuré à <literal>true</literal> (vrai), quand un noeud de serveur est fermé correctement, toutes les connexions situées sur le noeud qui est fermé, retomberont sur un autre noeud.
ja_jp: この属性が <literal>true</literal> にセットされている場合、サーバーノードが クリーンにシャットダウンされるとシャットダウンしたそのノード上の接続はいずれも 別のノードにフェイルオーバーします。
pt_br: Caso este atributo seja configurado para <literal>true</literal>, quando o nó do servidor é fechado limpo, qualquer conexão que for encerrada no nó irá realizar o failover sobre outro nó.
zh_cn: 如果这个属性为 <literal>true</literal>，当服务器节点关闭后，任何到这个节点的连接都会切换到另外一个节点上。

source: The default value for this is attribute is <literal>false.</literal>
es_es: El valor predeterminado para este atributo es <literal>false.</literal>
fr_fr: La valeur par défaut de cet attribut est <literal>false.</literal> (faux)
ja_jp: この属性のデフォルト値は <literal>false.</literal> です。
pt_br: O valor do padrão para este atributo é <literal>false.</literal>
zh_cn: 这个属性的缺省值是 <literal>false</literal>。

source: The maximum number of concurrent replication requests to make before blocking for replies to come back. This prevents us overwhelming JGroups. This is rarely a good reason to change this.
es_es: El número máximo de peticiones de replicación concurrentes a realizar antes de que regrese el bloqueo de respuestas. Esto nos previene de JGroups abrumadores. En ocasiones muy raras esta es una buena razón para cambiar esto.
fr_fr: Le nombre maximum de demandes de répliques concurrentes à faire avant de bloquer les réponses. Cela permet de ne pas encombrer JGroups. Il n'est pas recommandé d'effectuer ce changement.
ja_jp: 返信が戻ってくるのをブロックする以前に出す並行レプリケーション要求の最大数。 これが、JGroups を圧倒することを防止します。これを変更する為の稀で 適切な理由です。
pt_br: O número máximo de solicitações de replicações atuais a serem realizadas, antes de bloqueamentos para respostas retornarem. Isto nos previne do impressionante JGroups. Isto é raramente um bom motivo para modificar isto.
zh_cn: 在阻塞回复前，最大的并行复制请求数量。这可以防止 JGroups 的负担过重。我们通常不需要修改它。

source: The default value is <literal>50</literal>
es_es: El valor predeterminado es <literal>50</literal>
fr_fr: La valeur par défaut est <literal>50</literal>
ja_jp: デフォルト値は <literal>50</literal> です。
pt_br: O valor do padrão é <literal>50</literal>.
zh_cn: 它的缺省值是 <literal>50</literal>。

source: JBoss Messaging uses JGroups for all group management. This contains the JGroups stack configuration for the control channel.
es_es: JBoss Messaging utiliza JGroups para toda la administración de grupo. Este contiene la configuración de la pila de JGroups para el canal de control.
fr_fr: JBoss Messaging utilise JGroups pour la gestion de tout le groupe. Cela comprend le kit de configuration JGroups pour le canal de commande.
ja_jp: JBoss Messaging は全てのグループ管理に JGroups を使用します。これには、 コントロールチャンネル用の JGroups スタック設定が含まれています。
pt_br: O JBoss Messaging usa todos os grupos de gerenciamento. Isto contém o configuração de pilha do JGroups para o canal de controle.
zh_cn: JBoss Messaging 将 JGroups 用于所有的组管理。这包含了用于控制频道的 JGroups 栈配置。

source: The control channel is used for sending request/receiving responses from other nodes in the cluster
es_es: El canal de control se utiliza para enviar respuestas de peticiones/recepciones de otros nodos en el clúster.
fr_fr: Le canal de commande est utilisé pour demander/recevoir des réponses en provenance des autres noeuds dans le groupement.
ja_jp: コントロールチャンネルは、クラスター内の他のノードとの要求の送信/返答の受信の 為に使用されます。
pt_br: O canal de controle é usado para envio de solicitação/recebimento de respostas, a partir de outros nós no cluster.
zh_cn: 控制频道（Control Channel）被用来往/从群集里的其他节点发送请求/接收响应。

source: The details of the JGroups configuration won't be discussed here since it is standard JGroups configuration. Detailed information on JGroups can be found in JGroups release documentation or on-line at <ulink url="http://www.jgroups.org">http://www.jgroups.org</ulink> or <ulink url="http://wiki.jboss.org/wiki/Wiki.jsp?page=JGroups">http://wiki.jboss.org/wiki/Wiki.jsp?page=JGroups</ulink>.
es_es: Aquí no vamos a discutir los detalles de la configuración de JGroups ya que es la configuración estándar de JGroups. Puede encontrar información detallada sobre JGroups en la documentación del lanzamiento de JGroups o en línea en <ulink url="http://www.jgroups.org">http://www.jgroups.org</ulink> o <ulink url="http://wiki.jboss.org/wiki/Wiki.jsp?page=JGroups">http://wiki.jboss.org/wiki/Wiki.jsp?page=JGroups</ulink>.
fr_fr: Les détails de la configuration de JGroups ne seront pas discutés ici puisqu'il s'agit d'une configuration JGroups standard. On peut trouver une information détaillée sur JGroups dans la documentation de mise à jour de JGroups ou en ligne à <ulink url="http://www.jgroups.org">http://www.jgroups.org</ulink> or <ulink url="http://wiki.jboss.org/wiki/Wiki.jsp?page=JGroups">http://wiki.jboss.org/wiki/Wiki.jsp?page=JGroups</ulink>.
ja_jp: 標準の JGroups 設定であるため、その詳細はここでは説明していません。JGroups に ついての詳細情報は JGroups リリースのドキュメント、又は オンライン：<ulink url="http://www.jgroups.org">http://www.jgroups.org</ulink> あるいは <ulink url="http://wiki.jboss.org/wiki/Wiki.jsp?page=JGroups">http://wiki.jboss.org/wiki/Wiki.jsp?page=JGroups</ulink> でご覧になれます。
pt_br: Os detalhes da configuração do JGroups não serão examinados aqui, uma vez que isto é uma configuração do JGroups padrão. Informações mais detalhadas a respeito do JGroups podem ser encontradas na documentação de liberação do JGroups ou on-line em <ulink url="http://www.jgroups.org">http://www.jgroups.org</ulink> ou <ulink url="http://wiki.jboss.org/wiki/Wiki.jsp?page=JGroups">http://wiki.jboss.org/wiki/Wiki.jsp?page=JGroups</ulink>.
zh_cn: 既然这只是标准的 JGroups 配置，我们不会在这里讨论其细节。你可以在 JGroups 发行文档 <ulink url="http://www.jgroups.org">http://www.jgroups.org</ulink> 或 <ulink url="http://wiki.jboss.org/wiki/Wiki.jsp?page=JGroups">http://wiki.jboss.org/wiki/Wiki.jsp?page=JGroups</ulink> 里找到 JGroups 的详细信息。

source: JBoss Messaging uses JGroups for all group management. This contains the JGroups stack configuration for the data channel.
es_es: JBoss Messaging utiliza JGroups para toda la administración del grupo. Este contiene la configuración de la pila de JGroups para el canal de datos.
fr_fr: JBoss Messaging utilise JGroups pour toute la gestion du groupe. Cela comprend le kit de configuration JGroup pour la voie de transmission des données.
ja_jp: JBoss Messaging はグループ管理用に JGroups を使用します。これには、 データチャンネルの為の JGroups スタック設定が含まれています。
pt_br: O JBoss Messaging usa o JGroups para todo gerenciamento de grupo. Isto contém a configuração de pilha JGroups para o canal de dados.
zh_cn: JBoss Messaging 将 JGroups 用于所有的组管理。这包含了用于数据频道（Data Channel）的 JGroups 栈配置。

source: The data channel is used for sending sending/receiving messages from other nodes in the cluster and for replicating session data.
es_es: El canal de datos se utiliza para enviar/recibir mensajes de otros nodos en el clúster y para replicar datos de sesión.
fr_fr: La voie de transmission des données utilisée pour recevoir/envoyer les messages à partir d'autres noeuds dans le groupement et pour répliquer les données d'une session.
ja_jp: データチャンネルは、クラスター内の他のノードとのメッセージの送信/受信、及び セッションデータのレプリケーションの為に使用されます。
pt_br: O canal de dados é usado para envio de solicitações/recebimento de mensagens a partir de outros nós no cluster e para replicação dos dados de sessão.
zh_cn: 数据频道（Data Channel）被用来往/从群集里的其他节点发送请求/接收响应以及复制会话数据。

source: Configuring the Persistence Manager
es_es: Configuración del administrador de persistencia
fr_fr: Configurer le gestionnaire de persistance (Persistence Manager)
ja_jp: Persistence Manager の設定
pt_br: Configuração do Gerenciador de Persistência
zh_cn: 配置 Persistence Manager

source: It is the job of the persistence manager to manage all message related persistence.
es_es: Es el trabajo del administrador de persistencia el manejar toda la persistencia relacionada con los mensajes.
fr_fr: C'est le travail du gestionnaire de persistances de gérer tous les messages relatifs à la persistance.
ja_jp: persistence manager の役目は persistence（永続化）に関連した全てのメッセージを 管理することです。
pt_br: É função do gerenciador de persistência gerenciar todas as mensagens de persistência relacionadas.
zh_cn: Persistence Manager 的职责是管理所有和消息相关的持久化。

source: JBoss Messaging ships with a JDBC Persistence Manager used for handling persistence of message data in a relational database accessed via JDBC. The Persistence Manager implementation is pluggable (the Persistence Manager is a Messaging server plug-in), this making possible to provide other implementations for persisting message data in non relational stores, file stores etc.
es_es: JBoss Messaging se envía junto con un administrador de persistencia JDBC utilizado para manejar la persistencia de datos de mensajes en una base de datos relacional accedida a través de JDBC. La implementación del administrador de persistencia es enchufable (el administrador de persistencia es un plug-in del servidor Messaging) y esto hace posible el proporcionar otras implementaciones para persisitir datos de mensajes en almacenamientos no relacionales, almacenamientos de archivos, etc.
fr_fr: JBoss Messaging est présenté avec un gestionnaire de persistances JDBC Persistence Manager, conçu pour gérer la persistance des données des messages dans une base de données relationnelle accessible par JDBC. L'implémentation du Persistence Manager est enfichable (Persistence Manager est un plug-in de serveur de messagerie), permettant ainsi la fourniture d'autres implémentations pour les données de messages persistants dans les supports de sauvegarde non relationnels, archivages de fichiers, etc.
ja_jp: JBoss Messaging は JDBC を介してアクセスされる関係データベースに於いて メッセージデータの永続化を処理するために使用する JDBC Persistence Manager を収納した状態で 配布されています。この Persistence Manager の実装はプラグ可能（Persistence Manager が Messaging サーバープラグインです）で、これが非関係ストアや、ファイルストアなどの中で メッセージデータを永続化するための他の実装の提供を可能にします。
pt_br: O JBoss Messaging lança um Gerenciador de Persistência JDBC usado para manuseio de persistência de mensagens num banco de dados relacional, acessado por meio do JDBC. A implementação de Gerenciador de Persistência é puglável (o Gerenciador de Persistência é um plug-in de servidor Messaging), fazendo possível o fornecimento de outras implementações para dados de mensagem de persistência em armazenamento não-relacionais, armazenamentos de arquivo, etc.
zh_cn: JBoss Messaging 带有一个在通过 JDBC 访问的关系型数据库里处理消息数据的持久化的 JDBC Persistence Manager。这个 Persistence Manager 实现是可插拔的（Persistence Manager 是一个消息服务器的插件），这使得在非关系型数据库里（如文件系统）提供消息数据的持久化成为可能。

source: The configuration of "persistent" services is grouped in a <filename>xxx-persistence-service.xml</filename> file, where xxx corresponds to the database name. By default, Messaging ships with a <filename>hsqldb-persistence-service.xml</filename>, which configures the Messaging server to use the in-VM Hypersonic database instance that comes by default with any JBossAS instance.
es_es: La configuración de servicios "persistentes" está agrupada en un archivo <filename>xxx-persistence-service.xml</filename>, en donde XXX corresponde al nombre de la base de datos. Por defecto, Messaging se envía junto con <filename>hsqldb-persistence-service.xml</filename>, el cual configura el servidor Messaging a utilizar en la instancia de la base de datos Hypersonic en la máquina virtual que viene por defecto con cualquier instancia de JBossAS.
fr_fr: La configuration des services persistants est groupée dans un fichier <filename>xxx-persistence-service.xml</filename>, où xxx correspond au nom de la base de données. Par défaut, Messaging est proposé avec <filename>hsqldb-persistence-service.xml</filename>, qui configure le serveur de Messaging en vue d'utiliser l'instance de la base de données in-VM Hypersonic, qui accompagne n'importe quelle instance JBossAS par défaut.
ja_jp: "persistent"（永続化）サービスの設定は <filename>xxx-persistence-service.xml</filename> ファイル内にグループ化されています。 （ここで xxx はデータベース名に相当します）Messaging はデフォルトで <filename>hsqldb-persistence-service.xml</filename> を収納して配布されています。このファイルは、Messaging サーバーを設定して、いずれかの JBossAS インスタンスと共にデフォルトで配布される in-VM Hypersonic データベースインスタンスを使用できるようにします。
pt_br: A configuração de serviços de "persistência" é agrupada num arquivo <filename>xxx-persistence-service.xml</filename>, onde xxx corresponde ao nome de banco de dados. O Messaging lança, por padrão, o <filename>hsqldb-persistence-service.xml</filename>, que configura o servidor Messaging para uso da instância de banco de dados in-VM Hypersonic, da qual vem com qualquer instância JBossAS por padrão.
zh_cn: "persistent" 服务的配置以 <filename>xxx-persistence-service.xml</filename> 文件的形式分组，其中的 xxx 对应数据库名称。在缺省情况下，JBoss Messaging 附带一个 <filename>hsqldb-persistence-service.xml</filename> 文件，它配置任何 JBossAS 实例缺省使用的 in-VM Hypersonic 数据库。

source: The default Persistence Manager works out of the box with Hypersonic. However, it must be stressed that Hypersonic should not be used in a production environment, mainly due to its limited support for transaction isolation, and its propensity to behave erratically under high load.
es_es: El administrador de persistencia predeterminado funciona tal como viene con Hypersonic. Sin embargo, debemos anotar que Hypersonic no se debe utilizar en un entorno de producción, principalmente debido a su soporte limitado para aislamiento de transacciones y ya que es propenso a comportarse erráticamente cuando tiene bastante carga.
fr_fr: Le gestionnaire de persistances par défaut fonctionne 'out of the box' avec Hypersonic. Malgré tout, Hypersonic ce devrait pas être utilisé dans un environnement de travail, surtout en raison du support limité pour l'isolation des transactions, et à cause de sa tendance à se comporter bizarrement sous les charges de travail importantes.
ja_jp: デフォルトの Persistence Manager は新品状態で Hypersonic を利用して 機能します。しかし、主に、トランザクション隔離のサポートが限られていること、 及び、高負荷の元では異常な動作をする性癖の為に、Hypersonic は実稼働環境では 使用すべきではありません。
pt_br: O Gerenciador de Persistência padrão funciona fora da caixa com Hypersonic. No entanto, deve ser enfatizado que o Hypersonic não deveria ser usado num ambiente de produção, basicamente por seu suporte limitado para a isolação de transação e sua propensão de comportamento instável sob alto carregamento.
zh_cn: Persistence Manager 缺省使用 Hypersonic。然而，我们需要强调的是，Hypersonic 不应该用在产品环境里，这是因为它只有限地支持事务隔离，且在高负荷下表现不稳定。

source: The <ulink url="http://wiki.jboss.org/wiki/Wiki.jsp?page=ConfigJBossMQDB">Critique of Hypersonic</ulink> wiki page outlines some of the well-known issues occuring when using this database.
es_es: La página wiki <ulink url="http://wiki.jboss.org/wiki/Wiki.jsp?page=ConfigJBossMQDB">Critique of Hypersonic</ulink> establece algunos de los puntos delicados más conocidos que tienen lugar al utilizar esta base de datos.
fr_fr: La page wiki <ulink url="http://wiki.jboss.org/wiki/Wiki.jsp?page=ConfigJBossMQDB">Critique of Hypersonic</ulink> souligne certains problèmes bien connus liés à l'utilisation de cette base de données.
ja_jp: <ulink url="http://wiki.jboss.org/wiki/Wiki.jsp?page=ConfigJBossMQDB">Critique of Hypersonic</ulink> wiki ページはこのデータベース使用時に発生する 良く知られた問題の一部について概要を示します。
pt_br: A página da wiki <ulink url="http://wiki.jboss.org/wiki/Wiki.jsp?page=ConfigJBossMQDB">Critique of Hypersonic</ulink> descreve alguns dos problemas conhecidos ocorridos quando utilizando este banco de dados.
zh_cn: <ulink url="http://wiki.jboss.org/wiki/Wiki.jsp?page=ConfigJBossMQDB">Critique of Hypersonic</ulink> wiki 页面概述了使用这个数据库的一些众所周知的问题。
