Repository: bobmcwhirter/jboss-messaging
Catalog: docs/EAP_4_3/JBoss_Messaging_User_Guide/*/Important_Features.po
Languages: de_de, es_es, fr_fr, ja_jp, pt_br, zh_cn

source: JBoss Messaging - A Quick Tour
de_de: JBoss Messaging - Ein kurzer Überblick
es_es: JBoss Messaging - Tour rápido
fr_fr: JBoss Messaging - Tour rapide
ja_jp: JBoss Messaging - クイックツアー
pt_br: Uma rápida viagem ao JBoss Messaging
zh_cn: JBoss Messaging - 快速教程

source: Limitations of JBossMQ
de_de: Beschränkungen von JBossMQ
es_es: Limitaciones de JBossMQ
fr_fr: Limitations de JBossMQ
ja_jp: JBossMQ の制約
pt_br: Limitações do JBossMQ
zh_cn: JBossMQ 的局限性

source: JBossMQ has two fundamental limitations:
de_de: JBossMQ hat zwei fundamentale Einschränkungen:
es_es: JBossMQ tiene dos limitaciones fundamentales:
fr_fr: JBossMQ a deux limitations fondamentales:
ja_jp: JBossMQ は二つの根本的な制約があります。
pt_br: O JBossMQ possui duas limitações fundamentais:
zh_cn: JBossMQ 有两个根本的局限性：

source: JBossMQ is based on SpyderMQ (the open source project) which is a non-clustered broker.
de_de: JBossMQ basiert auf SpyderMQ (dem Open Source Projekt), bei dem es sich um einen nicht-geclusterten Broker handelt.
es_es: JBossMQ se basa en SpyderMQ (el proyecto de código abierto) el cual es un broker sin clústers.
fr_fr: JBossMQ est basé sur SpyderMQ (le projet en source ouverte) qui est un broker non-clusterisé.
ja_jp: JBossMQ は クラスターに対応していないブローカーである SpyderMQ （オープンソースプロジェクト）を ベースにしています。
pt_br: O JBossMQ é baseado no SpyderMQ (o projeto de código aberto) que é um corretor sem cluster.
zh_cn: JBossMQ 基于非群集的 SpyderMQ（一个开源项目）。

source: The threading model and the overall design of the non-clustered broker leads to performance limitations in certain high load usage scenarios.
de_de: Das Threading Modell und das Gesamtdesign des nicht-geclusterten Brokers führt bei manchen "High-Load"-Anwendungsszenarien zu Einschränkungen bei der Performance.
es_es: El modelo de hilos y el diseño en general del broker sin clústers conlleva limitaciones de rendimiento en ciertos escenarios de uso de alta carga.
fr_fr: Le modèle de threading et la conceptualisation du broker non-clusterisé nous mène à des limitations de performance dans certains scénarios d'usage à hauts volumes.
ja_jp: クラスターに対応していないブローカーのスレッディングモデルと全般的な設計は、特定の 高負荷な状況では、パフォーマンスに制約があります。
pt_br: O modelo segmentado e a criação em geral de um corretor sem cluster lidera as limitações de desempenho em certos cenários de uso de carregamento grande.
zh_cn: 它的线程模型和非群集设计在某些高负载情形下会导致性能问题。

source: JBoss Messaging Features
es_es: Características de JBoss Messaging
fr_fr: Fonctions JBoss Messaging
ja_jp: JBoss Messaging の特徴
pt_br: Recursos do JBoss Messaging
zh_cn: JBoss Messaging 的特征

source: JBoss Messaging implements a high-performance and robust messaging core that is designed to support the largest and most heavily utilized Service Oriented Architectures(SOAs), Enterprise Service Buses (ESBs) and other integration needs ranging from the simplest to the highest demand networks.
de_de: JBoss Messaging implementiert einen High Performance und robusten Messaging Kern, der entworfen wurde, um idie größten und am stärksten genutzten Service Oriented Architectures(SOAs), Enterprise Service Buses (ESBs) sowie anderen Integrationsbedarf von den einfachsten bis hin zu den am meisten gefragten Netzwerken zu unterstützen.
es_es: JBoss Messaging implementa un alto rendimiento y un robusto núcleo de mensajes que está diseñado para la arquitectura orientada a servicios (en inglés Service Oriented Architectures o SOAs), ESBs (del inglés Enterprise Service Buses) y otras necesidades de integración que van desde las redes más simples hasta aquellas con mayores demandas.
fr_fr: JBoss Messaging implémente un service de messagerie robuste et de haute performance qui est conçu pour prendre en charge Oriented Architectures(SOAs), Enterprise Service Buses (ESBs) et autres besoins d'intégration allant des demandes de réseaux les plus simples au plus élevées.
ja_jp: JBoss Messaging はハイパフォーマンスで強健なメッセージングコアを実装するもので、 最大規模で最も高負荷な運用を持つ サービス指向アーキテクチャ (SOA)、 エンタープライズサービスバス (ESB)、及びその他、最も単純なものから高度な要求まで 幅広くネットワーク統合要求をサポートするように設計されています。
pt_br: O JBoss Messaging implementa o alto-desempenho e principal mensagem robusta que é criada para suportar as maiores e mais pesadas Arquiteturas de Serviços Orientados - Service Oriented Architectures(SOAs), Enterprise Service Buses (ESBs) e outras integrações necessárias abrangendo desde a mais simples à mais alta demanda das redes.
zh_cn: JBoss Messaging 实现了一个高性能和稳定的消息核心，它的设计目的是为了最大限度地利用面向服务架构（Service Oriented Architectures，SOA）、企业级服务总线（Enterprise Service Buses，ESB）以及其他从最简单到最高要求的网络的集成需要。

source: It will allow you to smoothly distribute your application load across your cluster, intelligently balancing and utilizing each node's CPU cycles. It comes with no single point of failure and no single point of bottleneck, sophisticated and fully configurable message expiration handling and XA transaction recovery. Thus providing a highly scalable and performant clustering implementation. It includes a JMS front-end to deliver messaging in a standards-based format as well as being designed to be able to support other messaging protocols in the future.
de_de: Es gestattet Ihnen die unkomplizierte Distribution Ihrer Applikationslast (Application Load) über den Cluster hinweg, wobei die CPU-Zyklen jedes Nodes intelligent ausbalanciert werden. "Single Point of Failure" und "No Single Point of Bottleneck" sind kein Problem mehr, und vollständig konfigurierbares Message Expiration Handling sowie XA Transaction Recovery werden mitgeliefert. Es handelt sich daher um eine stark skalierbare und performante Clustering Implementierung. Sie beinhaltet ein JMS Front-End zur Lieferung von Nachrichten in Standard-basiertem Format und wurde entwickelt um in der Zukunft auch andere Messaging-Protokolle zu unterstützen.
es_es: Le permitirá distribuir sin problemas la carga de su aplicación a través de su clúster, balanceando de manera inteligente y utilizando los ciclos de la CPU de cada nodo. Viene sin nigún punto de falla y sin nigún punto muerto, además de manejo de expiraciones de mensajes completamente configurable y recuperación de transacciones XA. Por lo tanto proporciona una implementación de clústers con alto rendimiento y altamente escalable. Incluye un JMS para entregar mensajes en un formato estándar y también ha sido diseñado para poder soportar otros protocolos de mensajes en el futuro.
fr_fr: Cela vous permettra une distribution distribuée facilement de votre application à travers le groupement, équilibrant et utilisant intelligemment les cycles CPU de chaque noeud. Il n'y a pas un seul point de mise en échec, pas de point d'encombrement, une gestion sophistiquée des messages d'expiration, totalement configurable, et un recouvrement de transaction XA, procurant ainsi une implémentation de groupage très ajustable et performante. Cela inclut un logiciel frontal JMS qui puisse fournir des messages de formats basés-standard et est conçu pour pouvoir prendre en charge d'autres protocoles de messagerie dans le futur.
ja_jp: JBoss Messaging の使用で、クラスター全域に渡りアプリケーションの負荷を スムーズに分散することが可能になり、各ノードの CPU サイクルを知的に バランスを取りながら使用できるようになります。単独障害点（single point of failure）や 単独ボトルネックが無く、洗練された完全設定可能なメッセージ期限切れ処理と XA トランザクションのリカバリ機能を持っています。このように高い拡張性と性能を持った クラスタリングの実装を提供します。JBoss Messaging には、標準ベース フォーマットでメッセージを配信する為の JMS フロントエンドが含まれていると同時に、将来には 他のメッセージングプロトコルも対応することが出来るように設計されています。
pt_br: Isto permitirá que você distribua facilmente sua carga de aplicativo através de seu cluster, balanceando-o inteligentemente e utilizando cada nó de ciclos de CPU. Isto aparece sem nenhum único ponto de falha e sem nenhum único ponto de afunilação. Ele é sofisticado e manuseia a expiração de mensagem inteiramente configurável e recuperação de transação XA. Desta forma, isto fornece uma implementação com cluster de alta escabilidade e desempenho. Isto inclui uma front-end (parte do programa que é responsável pela interface do usuário) JMS para entregar mensagens num formato de padrão baseado, assim como ser designado a suportar outros protocolos de mensagem no futuro.
zh_cn: 它将允许你在群集系统里顺利地分布应用程序负载，智能地平衡和利用每个节点的 CPU 周期。它没有单个故障点和瓶颈，但它具有复杂和完全可配置的消息过期管理和 XA 事务恢复，因此提供了具有高可扩充性和性能的群集实现。它也包括了以基于标准的格式递送消息且能够支持将来的其他消息协议的 JMS 前端。

source: <emphasis>JMS compliance</emphasis>: A fully compatible and Sun certified JMS 1.1 implementation, that currently works with JBoss Enterprise Application Platform 4.3 or JBoss Application Server version 4.2 or later.
de_de: <emphasis>JMS-Komplianz</emphasis>: Eine vollständig kompatible und Sun zertifizierte JMS 1.1 Implementierung, die zum aktuellen Zeitpunkt mit JBoss Enterprise Application Platform 4.3 oder JBoss Application Server Version 4.2 oder später funktioniert.
es_es: <emphasis>JMS compliance</emphasis>: Una implementación JMS 1.1 completamente compatible y certificada por Sun que actualmente funciona con JBoss Enterprise Application Platform 4.3 o JBoss Application Server versión 4.2 o posteriores.
fr_fr: <emphasis>JMS compliance</emphasis>: Une implémentation JMS 1.1 certifiée Sun, qui fonctionne actuellement sur JBoss Enterprise Application Platform 4.3 ou JBoss Application Server version 4.2 ou supérieure.
ja_jp: <emphasis>JMS 準拠</emphasis>: 完全に互換であり、現在 JBoss Enterprise Application Platform 4.3 又は、JBoss Application Server バージョン 4.2 とそれ以降で機能する Sun 認定の JMS 1.1 の実装です。
pt_br: <emphasis>Flexibilidade JMS</emphasis>: Uma compatibilidade completa e implementação JMS 1.1 Sun certificada, que atualmente trabalha com a Plataforma de Aplicativo JBoss Enterprise 4.3 ou versão do Servidor de Aplicativo JBoss 4.2, ou outra versão mais recente.
zh_cn: <emphasis>JMS compliance</emphasis>：完全兼容和经 Sun 认证的 JMS 1.1 实现，可以在 JBoss 企业级应用程序平台 4.2、4.3 或更新版本里使用。

source: JBoss Messaging contains a host of other features, including:
de_de: JBoss Messaging enthält eine Reihe anderer Features, darunter:
es_es: JBoss Messaging contiene una gran cantidad de características incluyendo:
fr_fr: JBoss Messaging contient un gamme d'autres fonctions, qui comprennent:
ja_jp: JBoss Messaging には、以下を含む他の多くの特徴があります:
pt_br: O JBoss Messaging contém outros recursos, incluindo:
zh_cn: JBoss Messaging 还包含了其他功能：

source: Publish-subscribe and point-to-point messaging models
de_de: "Publish-Subscribe" und "Point-to-Point" Messaging Modelle
es_es: Modelos de mensajería publish-subscribe y point-to-point
fr_fr: Les modèles Publish-subscribe et Messaging point-à-point
ja_jp: パブリッシュ/サブスクライブとポイントツーポイントのメッセージングモデル
pt_br: Modelos de mensagens Publish-subscribe e point-to-point
zh_cn: 发布-订阅和点到点消息模型

source: Persistent and non-persistent messages
de_de: Persistente und nicht-persistent Nachrichten
es_es: Mensajes persistentes y no-persistentes
fr_fr: Messages persistants et messages non persistants
ja_jp: 永続化と非永続化のメッセージ
pt_br: Mensagens de Persistência e Sem Persistência
zh_cn: 持久的和非持久的消息

source: Guaranteed message delivery that ensures that messages arrive once and only once where required
de_de: Garantierte Message-Delivery, dass Nachrichten, wo erforderlich, ein Mal (und nur ein Mal) ausgeliefert werden
es_es: Entrega garantizada de mensajes lo que asegura que los mensajes llegan sólo una vez a donde se requiere
fr_fr: Un système de remise de messages qui garantit que les messages arrivent une fois et une fois seulement là où ils sont voulus.
ja_jp: 必要な場所にはメッセージが一度だけ到着することを確実にするメッセージ配信保証
pt_br: Entrega de mensagem garantida que assegura que as mensagens cheguem uma só vez e apenas uma vez quando requerido.
zh_cn: 确保消息在有需要时只到达一次的消息递送保证

source: Transactional and reliable - supporting ACID semantics
de_de: Transaktional und zuverlässig - unterstützt ACID-Semantik
es_es: Transaccional y confiable - soporta la semántica ACID
fr_fr: Transactionnel et fiable- supportant les sémantiques ACID
ja_jp: トランザクショナルで信頼できる：ACID セマンティクスに対応
pt_br: Transacional e confiável - suportando as semânticas ACID.
zh_cn: 事务性和可靠性 － 支持 ACID 模式

source: Customizable security framework based on JAAS
de_de: Anpassbares Sicherheits-Framework basierend auf JAAS
es_es: Marco de trabajo de seguridad personalizable basado en JAAS
fr_fr: Structures de sécurité personnalisées basées sur JAAS
ja_jp: JAAS を基にしたカスタマイズ可能なセキュリティフレームワーク
pt_br: Framework de segurança personalizada baseado no JAAS.
zh_cn: 基于 JAAS 的可定制的安全框架

source: Fully integrated with JBoss Transactions (formerly known as Arjuna JTA) for full transaction recoverability.
de_de: Komplett integriert mit JBoss Transactions (früher bekannt als Arjuna JTA) für vollständige Transaktionswiederherstellbarkeit.
es_es: Completamente integrado con JBoss Transactions (conocido antes como Arjuna JTA) para la recuperación completa de transacciones.
fr_fr: Intégré totalement dans JBoss Transactions (connu auparavant sous le nom de Arjuna JTA) pour le recouvrement total des transactions.
ja_jp: 完全なトランザクションリカバリ機能のため JBoss Transactions（旧名 Arjuna JTA）と 完全な統合
pt_br: Inteiramente integrado com as Transações do JBoss (anteriormente conhecido como Arjuna JTA) para completa recuperação da transação.
zh_cn: 和 JBoss Transactions（以前称为 Arjuna JTA）完全集成，具有完全事务恢复能力。

source: Extensive JMX management interface
de_de: Umfassende JMX-Management Oberfläche
es_es: Interfaz extensiva de administración JMX
fr_fr: Interface de gestion extensive JMX
ja_jp: 拡張型 JMX 管理インターフェイス
pt_br: Interface de gerenciamento JMX extensivo
zh_cn: 扩展的 JMX 管理接口

source: Support for most major databases including Oracle, Sybase, MS SQL Server, PostgreSQL and MySQL
de_de: Support für die meisten wichtigen Datenbanken wie Oracle, Sybase, MS SQL Server, PostgreSQL und MySQL
es_es: Soporte para las bases de datos más importantes incluyendo Oracle, Sybase, MS SQL Server, PostgreSQL y MySQL
fr_fr: Support pour la plupart des bases de données, y compris Oracle, Sybase, MS SQL Server, PostgreSQL et MySQL
ja_jp: Oracle, Sybase, MS SQL Server, PostgreSQL そして MySQL を含むほとんどの 主要データベースへの対応
pt_br: Suporte para a maioria de bancos de dados incluindo Oracle, SYbase, MS SQL Server, PostgreSQL e MySQL.
zh_cn: 对 Oracle、Sybase、MS SQL Server、PostgreSQL 和 MySQL 等主要数据库的支持

source: HTTP transport to allow use through firewalls that only allow HTTP traffic
de_de: HTTP-Transport, um die Verwendung durch Firewalls zu gestatten, die nur HTTP-Traffic erlauben
es_es: Transporte HTTP para permitir el uso a través de cortafuegos que sólo permiten tráfico HTTP
fr_fr: HTTP transport pour faciliter l'utilisation à travers les barrières de sécurité qui permettent uniquement le trafic HTTP
ja_jp: HTTP トラフィックのみを許可するファイアウォールを通過しての使用を許可する HTTP トランスポート
pt_br: Transporte HTTP para permitir o uso através de firewalls que apenas permitem o tráfego HTTP.
zh_cn: 通过 HTTP 传输使用只允许 HTTP 通信的防火墙

source: SSL transport
es_es: Transporte SSL
ja_jp: SSL トランスポート
pt_br: Transporte SSL
zh_cn: SSL 传输

source: Configurable DLQs (Dead Letter Queues) and Expiry Queues
de_de: Konfigurierbare DLQs (Dead Letter Queues) und Expiry Queues
es_es: DLQs (del inglés Dead Letter Queues) y Expiry Queues configurables
fr_fr: Files d'attente d'expiration (Expiry Queues) et DLQs (Dead Letter Queues) configurables
ja_jp: 設定可能な DLQ (Dead Letter Queues) と 期限切れキュー
pt_br: Configuração DLQs (Dead Letter Queues) e Filas Expiradas
zh_cn: 可配置的 DLQs (Dead Letter Queues) 和 Expiry Queue

source: Message statistics: Gives you a rolling historical view of what messages were delivered to what queues and subscriptions
de_de: Nachrichtenstatistiken: Bieten eine rollende historische Ansicht, welche Nachrichten an welche Warteschlangen und Abonnements geliefert wurden
es_es: Estadísticas de mensajes: le proporciona una vista histórica de los mensajes que se entregaron a que colas y a que subscripciones
fr_fr: Statistiques de messagerie: vous donne un aperçu historique sur la nature des messages transmis, vers quelles queues et quels abonnements.
ja_jp: メッセージ統計: どのメッセージがどのキュー とどのサブスクライバに配信されたかの 履歴をスクロール表示します。
pt_br: Estatísticas de mensagens: Fornece a visualização histórica completa sobre quais mensagens foram entregues para quais filas e subscrições.
zh_cn: 消息统计：给你关于递送给不同队列和订阅的不同消息的历史数据视图

source: Automatic paging of messages to storage. Allows the use of very large queues - too large to fit in memory at once
de_de: Automatisches Paging von Nachrichten zum Speicher. Gestattet die Verwendung sehr langer Warteschlangen - zu lang, um auf einmal in den Speicher zu passen
es_es: Paginación automática de los mensajes al almacenamiento. Permite el uso de colas muy largas - demasiado largas para que quepan en la memoria de una sola vez
fr_fr: Mouvement de pages automatique vers la zone de stockage. Autorise l'utilisation de très grandes files d'attente - trop grandes pour la mémoire en un seul coup.
ja_jp: 保存するメッセージの自動ページング。一度にメモリーに収納するには大きすぎる大規模な キュー の使用を可能にします。
pt_br: Paginação automática para mensagens de armazenamento. Permite o uso de filas bastante grandes - tão grandes que não cabem na memória de uma só vez.
zh_cn: 消息到存储的自动分页。这允许你使用非常大的队列 － 大到不能马上存放在内存里

source: Clustering Features
es_es: Características de clústers
fr_fr: Fonctions de clustérisation
ja_jp: クラスタリングの特徴
pt_br: Recursos de Cluster
zh_cn: 群集功能

source: Fully clustered queues and topics
de_de: Vollständig geclusterte Warteschlangen und Topics
es_es: Colas y temas completamente en clústers
fr_fr: Files d'attente et sujets totalement clustérisés
ja_jp: 完全にクラスター化した キュー と トピック
pt_br: Tópicos e filas completos de cluster
zh_cn: 完全群集的队列和主题

source: "Logical" queues and topics are distributed across the cluster. You can send to a queue or a topic from any node, and receive from any other.
de_de: "Logische" Warteschlangen und Topics werden über den Cluster hinweg distribuiert. Sie können von jedem Node aus an eine Warteschlange oder ein Topic senden und von einem anderen empfangen.
es_es: Temas y colas "lógicas" se distribuyen en todo el clúster. Puede enviar una cola o un tema desde cualquier nodo y recibir desde cualquier otro.
fr_fr: Les files d'attente et les sujets "Logiques" sont distribués à travers le groupement. Vous pouvez émettre vers une file d'attente ou un sujet à partir de n'importe quel noeud, et recevoir à partir de n'importe quel autre.
ja_jp: 論理的な キュー と トピック はクラスター全域に分散されます。どのノードでも キュー や トピック を送信したり、他のノードから受信したりすることができます。
pt_br: Filas "lógicas" e tópicos são distribuídas através do cluster. Você pode enviar uma fila ou um tópico a partir de qualquer nó e receber a partir de qualquer outro.
zh_cn: “逻辑的”队列和主题分布在整个群集里。你可以向任何节点的队列和主题发送消息和接受消息。

source: Fully clustered durable subscriptions
de_de: Vollständig geclusterte dauerhafte Abonnements
es_es: Subscripciones durables completamente en clústers
fr_fr: Abonnements durables totalement clustérisés
ja_jp: 完全クラスター化した恒久サブスクリプション
pt_br: Subscrições duráveis completas de cluster
zh_cn: 群集的持久性订阅

source: A particular durable subscription can be accessed from any node of the cluster - allowing you to spread processing load from that subscription across the cluster.
de_de: Auf ein bestimmtes dauerhaftes Abonnement kann von jedem Node des Clusters aus zugegriffen werden - wodurch die Verarbeitungslast dieses Abonnements über das Cluster verteilt werden kann.
es_es: Una subscripción durable en particular que se puede acceder desde cualquier nodo del clúster - permitiéndole distribuir la carga de procesamiento desde esa subscripción al clúster.
fr_fr: Un abonnement particulièrement durable qui peut être accessible à partir de n'importe quel noeud du groupement - ce qui vous permet de répartir le volume de traitement de cet abonnement vers le groupement.
ja_jp: 特定の恒久サブスクリプションはクラスター内のどのノードからでもアクセスが可能です。 これにより、クラスター全域でそのサブスクリプションからのプロセス負荷を拡散できる ようになります。
pt_br: Uma subscrição durável particular pode ser acessada a partir de qualquer nó do cluster - permitindo que você propague o processamento de carga a partir daquela subscrição através do cluster.
zh_cn: 你可以从群集里任何节点访问特定的持久性订阅 － 这允许把订阅的负载分摊到整个群集里。

source: Fully clustered temporary queues
de_de: Vollständig geclusterte temporäre Warteschlangen
es_es: Colas temporales completamente en clústers
fr_fr: Files d'attente temporairement groupées totalement
ja_jp: 完全クラスター化したテンポラリー キュー
pt_br: Filas temporárias completas com cluster
zh_cn: 完全群集的临时队列

source: Send a message with a <literal>replyTo</literal> of a temp queue and it can be sent back on any node of the cluster.
de_de: Senden einer Nachricht mit einem <literal>replyTo</literal> einer temporären Warteschlange und kann zu jedem beliebigen Node des Clusters zurückgeschickt werden.
es_es: Envía un mensaje con un <literal>replyTo</literal> de una cola temporal y se puede enviar de regreso en cualquier nodo del clúster.
fr_fr: Envoyer un message avec un <literal>replyTo</literal> vers une file d'attente temporaire et ce message pourra être renvoyé vers n'importe quel noeud du groupement.
ja_jp: テンポラリーキュー の <literal>replyTo</literal> の付いたメッセージを送信します。 これはクラスター内のどのノードへも返信できます。
pt_br: Envia uma mensagem com o <literal>replyTo</literal> de uma temp queue e pode retorná-la em qualquer outro nó de cluster.
zh_cn: 如果发送带有 <literal>replyTo</literal> 临时队列的消息，它就可以送回群集里的任何节点。

source: Intelligent message redistribution
de_de: Intelligente Nachrichten-Redistribuierung
es_es: Redistribución inteligente de mensajes
fr_fr: Redistribution de message intelligent
ja_jp: 知能的なメッセージ再分散
pt_br: Redistribuição de mensagem inteligente
zh_cn: 智能消息重分布

source: Messages are automatically moved between different nodes of the cluster if consumers are faster on one node than another. This can help prevent starvation or build up of messages on particular nodes.
de_de: Nachrichten werden automatisch zwischen verschiedenen Nodes des Clusters verschoben, wenn Verbraucher auf einem Node schneller als auf einem anderen sind. Dies kann mangelnder Ausnutzung oder aber Überlastung auf bestimmten Nodes vorbeugen.
es_es: Los mensajes se mueven de manera automática entre diferentes nodos del clúster si los consumidores son más rápidos en ese nodo que en otro. Esto puede ayudar a prevenir starvation o la acumulación de mensajes en nodos en particular.
fr_fr: Les messages sont déplacés automatiquement entre les différents noeuds du groupement si les consommateurs sont plus rapides sur un noeud plus qu'un autre. Ceci peut prévenir un étranglement ou une accumulation de messages sur certains noeuds.
ja_jp: １つのノードで コンシューマ が他のノードより速い場合、メッセージは自動的にクラスター内の 異なるノード間で移動します。これにより、特定のノード上でのメッセージの枯渇や 集積のアンバランスを防止できます。
pt_br: As mensagens são automaticamente movidas entre diferente nós do cluster, caso os consumidores forem mais rápidos em um nó do que em outro. Isto pode ajudar a prevenir starvation ou construção de mensagens em nós particulares.
zh_cn: 如果在某个节点上消费者比另外一个节点块，消息将在群集中的不同节点间自动转移。这有助于防止 starvation 或者在某个节点上堆积消息。

source: Message order protection
de_de: Reihenfolgenschutz von Nachrichten
es_es: Protección del orden de mensajes
fr_fr: Protection de l'ordonnancement des messages
ja_jp: メッセージ順序の保護
pt_br: Proteção de pedido de mensagem
zh_cn: 消息顺序保护
