Repository: bobmcwhirter/jboss-messaging
Catalog: docs/EAP_4_3/JBoss_Messaging_User_Guide/*/Important_Features.po
Languages: de_de, es_es, fr_fr, ja_jp, pt_br, zh_cn

source: If you want to ensure that the order of messages produced by a producer is the same as is consumed by a consumer then you can set this to true. This works even in the presence of message redistribution.
de_de: Falls Sie sichergehen wollen, dass die Reihenfolge der von einem Producer produzierten Nachrichten dieselbe dieselbe ist wie vom Verbraucher verbraucht, so setzen Sie dies auf "true". Dies funktioniert selbst wenn Nachrichten-Redistribuierung.
es_es: Si quiere asegurarse de que el orden de los mensajes generados por un productor es el mismo en que se consumen entonces puede configurar esto como verdadero. Esto funciona incluso en la presencia de una redistribución de mensajes.
fr_fr: Si vous souhaitez vous assurer que l'ordre des messages en provenance d'un producteur est le même que celui qui est consommé, alors vous pouvez paramétrer 'true'. Cela fonctionne même en présence d'une redistribution de messages.
ja_jp: プロデューサにより作成されたメッセージの順序が コンシューマ により 消費される順序と同じである ことを確実にしたい場合は、これを「true」にセットします。これは、メッセージ 再分散がある場合でも機能します。
pt_br: Caso você queira assegurar que o pedido de mensagens produzidas por um produtor é o mesmo do que as mensagens consumidas por um consumidor, então você poderá configurar isto para verdadeiro. Isto funciona mesmo com a presença de uma redistribuição de mensagens.
zh_cn: 如果你想确保生产者（Producer）产生消息的顺序和消费者（Consumer）消费消息的顺序一致，那就把这设置为 true。这甚至在消息重分布时也可以实现。

source: Fully transparent failover
de_de: Vollständig transparenter Failover
es_es: Conmutación de servidor en caso de fallo de manera completamente transparente
fr_fr: Echec totalement transparent
ja_jp: 完全透過性のフェイルオーバー
pt_br: Falha de transparência completa
zh_cn: 完全透明的失效切换

source: When a server fails, your sessions continue without exceptions on a new node as if nothing happened. (Fully configurable - If you don't want this you can fall back to exceptions being thrown and manually recreation of connections on another node)
de_de: Schlägt der Server fehl fahren Ihre Sessions ohne Ausnahmeldung an einem neuen Node fort als sei nichts passiert. (Vollständig konfigurierbar - falls Sie dies nicht wünschen können Sie auf Ausnahmemeldungen und die manuelle erneute Herstellung von Verbindungen an einem anderen Node zurückgreifen).
es_es: Cuando un servidor falla, sus sesiones continuan sin excepciones en un nuevo nodo como si no hubiera pasado nada (completamente configurable - si no quiere esto puede regresar a las excepciones y a la recreación manual de conexiones en otro nodo).
fr_fr: Lorsqu'un serveur est mis en échec, vos sessions continuent sans aucune exception sur un nouveau noeud comme si de rien. (Totalement configurable - si vous ne souhaitez pas cette option, vous pourrez retomber sur des exceptions et vous devrez recréer manuellement des connexions sur un autre noeud)
ja_jp: サーバーが障害を持つ場合、まるで何も発生しなかったように例外なく新規ノード上で セッションが継続します（完全に設定可能：これを実行したくない場合、例外エラーが 出るように変更して、手動で別のノード上で接続を再開始することができます。）
pt_br: Quando um servidor falhar, suas sessões continuarão sem exceções em um novo nó como se nada houvesse acontecido. (Configuração completa - caso você não queira isto, você poderá voltar atrás das exceções que foram lançadas e realizar manualmente a recriação das conexões em outro nó).
zh_cn: 当某个服务器发生故障时，你的会话将在新的节点上继续进行，就好像什么都没有发生一样。（这是完全可配置的 － 如果你不希望这样，你可以设置为抛出异常并手工在另外节点上重新创建连接）

source: High availability and seamless fail-over
de_de: Hohe Verfügbarkeit und nahtloser Fail-over
es_es: Alta disponibilidad y conmutación de servidor en caso de fallos
fr_fr: Niveau de disponibilité et échecs sans coupure
ja_jp: ハイアベイラビリティーとシームレスフェイルオーバー
pt_br: Alta disponibilidade e seamless fail-over
zh_cn: 高可用性和无缝式失效切换

source: If the node you are connected to fails, you will automatically fail over to another node and will not lose any persistent messages. You can carry on with your session seamlessly where you left off. Once and only once delivery of persistent messages is respected at all times.
de_de: Schlägt der Node, mit dem Sie verbunden sind fehl, erfolgt ein automatischer Failover an einen anderen Node und Sie verlieren keine der persistenten Nachrichten. Sie können nahtlos mit Ihrer Session fortfahren, wo Sie aufgehört haben. Die einmalige (und ausschließlich einmalige) Auslieferung persistenter Nachrichten wird zu allen Zeiten berücksichtigt.
es_es: Si el nodo al que está conectado falla, conmutará de manera automática a otro nodo y no perderá ningún mensaje persistente. Puede continuar con su sesión desde donde quedó sin ningún cambio aparente. En todo momento se respeta la política de entrega de mensajes de sólo una vez.
fr_fr: Si le noeud sur lequel vous êtes connecté est mis en échec, vous retomberez automatiquement sur un autre noeud et vous ne perdrez aucuns messages persistants. Vous pouvez continuer vos sessions là ou vous les avez laissées, sans coupure. Un et seulement un envoi de messages persistants est respecté à tout moment.
ja_jp: 接続しているノードが障害を持つ場合、それを自動的に別のノードにフェイルオーバーするように 設定すると永続化メッセージのいずれも失うことはありません。作業が停止したところから継目のない セッションを継続することが出来ます。いかなる場合でも永続化メッセージの配信は常に1 回のみです。
pt_br: Caso o nó em que você estiver conectado falhar, você irá automaticamente realizar o fail over para outro nó e não perderá qualquer mensagem de persistência. Você poderá continuar com a sua sessão seamlessly onde você a deixou. A entrega das mensagens de persistência é respeitada em todos os períodos, apenas uma só vez.
zh_cn: 如果你连接的节点出现了故障，你将自动切换至另外一个节点且不会丢失任何持久性消息。你可以从断开的地方开始无缝地继续你的会话。在任何时候，持久性消息都只会被递送一次。

source: Message bridge
es_es: Puente de mensajes
fr_fr: Pont de messagerie
ja_jp: メッセージブリッジ
pt_br: Interligação de Mensagem
zh_cn: 消息桥（Message Bridge）

source: JBoss Messaging contains a message bridge component which enables you to bridge messages between any two JMS1.1 destinations on the same or physical separate locations. (E.g. separated by a WAN). This allows you to connect geographically separate clusters, forming huge globally distributed logical queues and topics.
de_de: JBoss Messaging enthält eine Message Bridge Komponente, die es hnen gestattet Nachrichten zwischen zwei beliebigen JMS1.1 Destinations an demselben oder aber an verschiedenen Orten zu überbrücken (z.B. durch ein WAN getrennt). Dies ermöglicht Ihnen die Verbindung mit geografisch getrennten Clustern, die riesige und global verteilte logische Warteschlangen und Topics bilden.
es_es: JBoss Messaging contiene un componente de puente de mensajes el cual le habilita a establecer puentes de mensajes entre dos destinos cualesquiera JMS1.1 en el mismo lugar o en lugares separados físicamente, (por ejemplo, separados por un WAN). Esto le permite conectar clústers separados geográficamente, formando gigantescas temas y colas lógicas globalmente distribuidas.
fr_fr: JBoss Messaging comprend un composant de pont de messagerie qui vous permet l'apontage des messages entre n'importe quelle paire de destinations JMS1.1 sur les mêmes locations ou sur des locations séparées physiquement. (Par.ex séparées par un WAN). Cela vous permet de vous connecter géographiquement a des groupements séparés géographiquement, formant des sujets et des files d'attente logiques distribuées dans le monde entier.
ja_jp: JBoss Messaging には、メッセージブリッジコンポーネントが含まれており、これが 同一場所、又は物理的に隔離した場所（例：WAN で隔離）にある２つの JMS1.1 送り先 間で メッセージのブリッジ（橋渡し）が出来ます。これにより、地理的に隔離したクラスター群を接続できる ようになり、大規模なグローバル分散の論理 キュー や トピック を形成することができます。
pt_br: O JBoss Messaging contém o componente de interligação de mensagem que permite que você interligue mensagens entre duas quaisquer destinações JMS1.1, nas mesmas ou diferentes localizações físicas. (Por exemplo: separado por um WAN). Isto permite que você conecte-se a clusters geograficamente separados, formando imensos tópicos e filas lógicas distribuídas localmente.
zh_cn: JBoss Messaging 包含一个消息桥组件，它让你可以在处于相同或不同（如由 WAN 分隔）位置上的两个 JMS1.1 目的地之间连接消息。这允许你连接物理上独立的群集系统，从而组成大型的全球分布式逻辑队列和主题。

source: Compatibility with JBossMQ
de_de: Kompatibilität mit JBossMQ
es_es: Compatibilidad con JBossMQ
fr_fr: Compatibilité avec JBossMQ
ja_jp: JBossMQ との互換性
pt_br: Compatibilidade com o JBossMQ
zh_cn: 对 JBossMQ 的兼容性

source: Since JBoss Messaging is JMS 1.1 and JMS 1.0.2b compatible, the JMS code written against JBossMQ will run with JBoss Messaging without any changes.
de_de: Da JBoss Messaging JMS 1.1 und JMS 1.0.2b kompatibel ist, läuft der gegen JBossMQ geschriebene JMS-Code ohne Änderungen bei JBoss Messaging.
es_es: Ya que JBoss Messaging es compatible con JMS 1.1 y JMS 1.0.2b, el código JMS escrito frente a JBossMQ ejecutará con JBoss Messaging sin ningún cambio.
fr_fr: Comme JBoss Messaging est compatible avec JMS 1.1 et JMS 1.0.2b, le code JMS inscrit sur une base JBossMQ fonctionnera avec JBoss Messaging sans aucun changement.
ja_jp: JBoss Messaging は JMS 1.1 及び JMS 1.0.2b とに互換性を持つため、JBossMQ に 対して書かれた JMS コードは変更無しに JBoss Messaging で実行出来ます。
pt_br: Uma vez que o JBoss Messaging é compatível ao JMS 1.1 e JMS 1.0.2b, o código JMS gravado em referência ao JBossMQ rodará com o JBoss Messaging sem quaisquer alterações.
zh_cn: 既然 JBoss Messaging 兼容 JMS 1.1 和 JMS 1.0.2b，针对 JBossMQ 编写的 JMS 代码不作修改就可以在 JBoss Messaging 里运行。

source: JBoss Messaging does not have wire format compatibility with JBossMQ so it would be necessary to upgrade JBoss MQ clients with JBoss Messaging client jars.
de_de: JBoss Messaging besitzt keine "Wire"-Format Kompatibilität mit JBossMQ daher wäre es notwendig JBoss MQ Clients mit JBoss Messaging Client Jars zu upgraden.
es_es: JBoss Messaging no tiene compatibilidad con JBossMQ así que sería necesario actualizar los clientes JBoss MQ con jars de clientes JBoss Messaging.
fr_fr: JBoss Messaging ne possède pas de compatibilité de format de câble avec JBossMQ, donc il serait utile de mettre les clients JBoss MQ à niveau avec les jars clients JBoss Messaging.
ja_jp: JBoss Messaging は JBossMQ に対して書き込み形式の互換性を持ちません。そのため、 JBoss MQ クライアントを JBoss Messaging client jars でアップグレードする必要が あります。
pt_br: O JBoss Messaging não possui cabo de formato compatível ao JBossMQ, de forma que poderá ser necessário atualizar os clientes JBoss MQ com as jarras do cliente JBoss Messaging.
zh_cn: JBoss Messaging 不具备和 JBossMQ 的线格式（wire format）兼容，JBoss MQ 客户端有必要用 JBoss Messaging 客户端的 jar 文件进行升级。

source: Even if JBoss Messaging deployment descriptors are very similar to JBoss MQ deployment descriptors, they are <emphasis>not</emphasis> identical, so they will require some simple adjustments to get them to work with JBoss Messaging. Also, the database data model is completely different, so don't attempt to use JBoss Messaging with a JBoss MQ data schema and vice-versa.
de_de: Selbst wenn JBoss Messaging Deployment-Deskriptoren den JBoss MQ Deployment-Deskriptoren sehr ähnlich sind, sind diese <emphasis>nicht</emphasis> identisch, so dass einige einfache Anpassungen notwendig sind, damit sie mit JBoss Messaging funktionieren. Auch das Datenmodell der Datenbank ist ganz anders, versuchen Sie also nicht, JBoss Messaging mit einem JBoss MQ Datenschema und umgekehrt zu benutzen.
es_es: Incluso si los descriptores de despliegue de JBoss Messaging son muy similares a los descriptores de despliegue de JBoss MQ, <emphasis>no</emphasis> son idénticos así que necesitarán algunos ajustes simples para que funcionen con JBoss Messaging. También el modelo de datos de la base de datos es completamente diferente así que no intente utilizar JBoss Messaging con un esquema de datos JBoss MQ y vice-versa.
fr_fr: Même si les descripteurs de déploiement JBoss Messaging sont très semblables aux descripteurs de déploiement JBoss MQ, ils ne sont <emphasis>pas</emphasis> identiques, donc, ils auront besoin de quelques simples ajustements pour qu'ils fonctionnent avec JBoss Messaging. Aussi, le modèle de la base de données est complètement différent, donc n'essayez pas d'utiliser JBoss Messaging avec les schémas de données JBoss MQ et vice versa.
ja_jp: JBoss Messaging のデプロイメント記述子が JBoss MQ のデプロイメント記述子に類似していても、その両者は 同一では <emphasis>ありません</emphasis>。そのため、両者は JBoss Messaging と共に 機能するには簡単な調節を必要とします。また、データベースのデータモデルは全く異なる為に、 JBoss Messaging を JBoss MQ データスキーマと共に使用したりその逆はしないで下さい。
pt_br: Mesmo que os descritores de implementação do JBoss Messaging forem bastante similares aos descritores de implementação do JBoss MQ, estes <emphasis>não</emphasis> são idênticos, de forma que eles solicitarão alguns ajustamentos para funcionarem com o JBoss Messaging. Além disso, o modelo de dados do banco de dados é completamente diferente. Sendo assim, não é recomendável usar o JBoss Messaging com um esquema de dados do JBoss MQ e vice-versa.
zh_cn: 即使 JBoss Messaging 和 JBoss MQ 的部署描述符非常相似，但它们<emphasis>并不是</emphasis>相同的，所以要进行少许调整才能在 JBoss Messaging 里使用。而且，数据库数据模型完全不一样，所以请不要试图用 JBoss MQ 的数据模型来使用 JBoss Messaging，反之亦然。

source: JBoss Messaging is built against the JBoss AS 4.2 libraries which are built using Java 5. Therefore JBoss Messaging only runs with Java 5 or later.
de_de: JBoss Messaging ist gegen JBoss AS 4.2 Bibliotheken gebaut, die unter Verwendung von Java 5 gebaut wurden. Daher funktioniert JBoss Messaging nur mit Java 5 oder später.
es_es: JBoss Messaging está construido frente a las bibliotecas JBoss AS 4.2, las cuales se construyen utilizando Java 5. Por lo tanto JBoss Messaging sólo ejecuta con Java 5 o versiones posteriores.
fr_fr: JBoss Messaging est construit a partir des bibliothèques JBoss AS 4.2, construites elles-mêmes en utilisant Java 5. Donc JBoss Messaging ne peut être exécuté qu'avec Java 5 ou version supérieure.
ja_jp: JBoss Messaging は、Java 5 を使用してビルドされた JBoss AS 4.2 ライブラリに 対してビルドされています。その理由で、JBoss Messaging は Java 5 あるいはそれ以降で のみ稼働します。
pt_br: O JBoss Messaging é construído de acordo com as bibliotecas do JBoss AS 4.2, das quais são construídas usando o Java 5. Portanto, o JBoss Messaging apenas roda com o Java 5 ou versões mais atualizadas.
zh_cn: JBoss Messaging 是采用基于 Java 5 的 JBoss AS 4.2 类库进行构建的，因此 JBoss Messaging 只能运行在 Java 5 或更新版本里。
