Repository: bobmcwhirter/jboss-messaging
Catalog: docs/EAP_4_3/JBoss_Messaging_User_Guide/*/Installation.po
Languages: de_de, es_es, fr_fr, ja_jp, pt_br, zh_cn

source: You should also make these changes on any configuration you choose, to remove all references to the old JBossMQ:
de_de: Sie sollten diese Änderungen auch an jeder Konfiguration vornehmen, die Sie wählen, um sämtliche Verweise zur alten JBossMQ zu entfernen:
es_es: También debe realizar estos cambios en cualqueri configuración que escoja para remover todas las referencias al JBossMQ antiguo:
fr_fr: Vous devriez également faire ces changements sur n'importe quelle configuration que vous choisissez, afin de retirer toutes références à l'ancien JBoss MQ:
ja_jp: 選択するいずれの設定でもこれらの変更をする必要があります。旧式の JBossMQ への全ての参照を削除するには次のようにします:
pt_br: Você deve ainda realizar esta mudança em qualquer configuração que você escolher, com a finalidade de remover todas as referências ao JBossMQ antigo:
zh_cn: 你也应该在所选的任何配置里进行这样的修改，删除所有对旧的 JBossMQ 的引用：

source: Edit <literal>$JBOSS_CONFIG/deploy/jms-ds.xml</literal> and replace jboss.mq by jboss.messaging on every occurrence. If you are in a clustered installation, then do the above with the file <literal>$JBOSS_CONFIG/deploy/hajndi-jms-ds.xml</literal>
de_de: Bearbeiten Sie <literal>$JBOSS_CONFIG/deploy/jms-ds.xml</literal> und ersetzen Sie jboss.mq by jboss.messaging bei jedem Auftreten. Falls Sie eine geclusterte Installation besitzen, führen Sie das obige mit der <literal>$JBOSS_CONFIG/deploy/hajndi-jms-ds.xml</literal>-Datei durch
es_es: Modifique <literal>$JBOSS_CONFIG/deploy/jms-ds.xml</literal> y reemplace jboss.mq by jboss.messaging en todo lugar. Si está en una instalación con clústers entonces haga lo anterior con el archivo <literal>$JBOSS_CONFIG/deploy/hajndi-jms-ds.xml</literal>
fr_fr: Modifier <literal>$JBOSS_CONFIG/deploy/jms-ds.xml</literal> et remplacer jboss.mq par jboss.messaging sur chaque occurrence. Si vous êtes dans une configuration de groupage, alors procédez à l'étape ci-dessus à l'aide du fichier <literal>$JBOSS_CONFIG/deploy/hajndi-jms-ds.xml</literal>
ja_jp: <literal>$JBOSS_CONFIG/deploy/jms-ds.xml</literal> の編集により、出現する全ての jboss.mq を jboss.messaging で入れ替えます。クラスター化インストールの場合は、 上記編集を <literal>$JBOSS_CONFIG/deploy/hajndi-jms-ds.xml</literal> ファイルで 実行します。
pt_br: Edite o <literal>$JBOSS_CONFIG/deploy/jms-ds.xml</literal> e substitua o jboss.mq by jboss.messaging em cada ocorrência. Caso você esteja na instalação com cluster, então realize o mesmo que efetuado acima com o arquivo <literal>$JBOSS_CONFIG/deploy/hajndi-jms-ds.xml</literal>.
zh_cn: 编辑 <literal>$JBOSS_CONFIG/deploy/jms-ds.xml</literal> 并用 jboss.messaging 替换每个 jboss.mq。如果你在进行群集安装，则请在 <literal>$JBOSS_CONFIG/deploy/hajndi-jms-ds.xml</literal> 文件里进行修改。

source: Edit <literal>$JBOSS_CONFIG/conf/standardjboss.xml</literal> and set <literal>CreateJBossMQDestination</literal> to false on every occurrence. Make sure it looks like this: <programlisting> <literal>&lt;CreateJBossMQDestination&gt;false&lt;/CreateJBossMQDestination&gt;</literal> </programlisting> Those Proxies will try to create a Destination on JBossMQ if they can't find it on JNDI, what would cause some errors related to JBoss MQ.
de_de: Bearbeiten Sie <literal>$JBOSS_CONFIG/conf/standardjboss.xml</literal> und setzen Sie <literal>CreateJBossMQDestination</literal> bei jedem Auftreten auf "false". Stellen Sie sicher, dass es wie folgt aussieht: <programlisting> <literal>&lt;CreateJBossMQDestination&gt;false&lt;/CreateJBossMQDestination&gt;</literal> </programlisting> Diese Proxies werden versuchen, eine Destination auf JBossMQ zu erstellen, wenn sie diese nicht auf JNDI finden können, was zu einigen Fehlern im Bezug auf JBoss MQ führen kann.
es_es: Modifique <literal>$JBOSS_CONFIG/conf/standardjboss.xml</literal> y configure <literal>CreateJBossMQDestination</literal> como falso en todo lugar. Asegúrese de que se ve así: <programlisting> <literal>&lt;CreateJBossMQDestination&gt;false&lt;/CreateJBossMQDestination&gt;</literal> </programlisting> Esos Proxies tratarán de crear un destino en JBossMQ si no lo pueden encontrar en JNDI, lo que generaría algunos errores relacionados con JBoss MQ.
fr_fr: Modifier <literal>$JBOSS_CONFIG/conf/standardjboss.xml</literal> et configurer <literal>CreateJBossMQDestination</literal> à 'faux' pour chaque occurrence. Veillez à ce que cela ressemble à: <programlisting> <literal>&lt;CreateJBossMQDestination&gt;false&lt;/CreateJBossMQDestination&gt;</literal> </programlisting> Ces Proxies tenteront de créer une Destination sur JBossMQ s'il ne parviennent pas à la trouver dans JNDI, ce qui causerait quelques erreurs liées à JBoss MQ.
ja_jp: <literal>$JBOSS_CONFIG/conf/standardjboss.xml</literal> の編集により、 <literal>CreateJBossMQDestination</literal> を全ての出現で「false」に セットします。確実に次のようになるようにします: <programlisting> <literal>&lt;CreateJBossMQDestination&gt;false&lt;/CreateJBossMQDestination&gt;</literal> </programlisting> これらのプロキシーは、 JNDI 上に JBossMQ の 送り先が見付からない場合、それを作成する試みをします。これは JBossMQ に関連した エラーの原因になります。
pt_br: Edite o <literal>$JBOSS_CONFIG/conf/standardjboss.xml</literal> e configure o <literal>CreateJBossMQDestination</literal> para falso, em cada ocorrência. Tenha certeza que isto parece-se com: <programlisting> <literal>&lt;CreateJBossMQDestination&gt;false&lt;/CreateJBossMQDestination&gt;</literal> </programlisting>. Estes Proxies tentarão criar uma Destinação no JBossMQ, caso eles não possam encontrá-los no JNDI, o que causaria ainda mais erros relacionados ao JBoss MQ.
zh_cn: 编辑 <literal>$JBOSS_CONFIG/conf/standardjboss.xml</literal> 并把所有的 <literal>CreateJBossMQDestination</literal> 设置为 false。请确保它类似于 <programlisting> <literal>&lt;CreateJBossMQDestination&gt;false&lt;/CreateJBossMQDestination&gt;</literal> </programlisting> 这些代理将试图在 JBossMQ 上创建一个目的地，如果它们在 JNDI 里没有找到，那么将导致和 JBossMQ 相关的一些错误。

source: Edit $JBOSS_CONFIG/conf/jboss-service.xml and remove the reference to JBoss MQ on JSR-77 Management Bean:
de_de: Bearbeiten Sie $JBOSS_CONFIG/conf/jboss-service.xml und entfernen Sie den Verweis auf JBoss MQ am JSR-77 Management Bean:
es_es: Modifique $JBOSS_CONFIG/conf/jboss-service.xml y remueva la referencia a JBoss MQ oen el Bean de administración JSR-77:
fr_fr: Modifer $JBOSS_CONFIG/conf/jboss-service.xml et retirer la référence à JBoss MQ sur le Bean de gestion JSR-77:
ja_jp: $JBOSS_CONFIG/conf/jboss-service.xml の編集により JSR-77 Management Bean にある JBoss MQ への照合を削除します:
pt_br: Edite o $JBOSS_CONFIG/conf/jboss-service.xml e remova a referência para o JBoss MQ no Bean Gerenciador JSR-77:
zh_cn: 编辑 $JBOSS_CONFIG/conf/jboss-service.xml 并删除对 JSR-77 Management Bean 里的 JBoss MQ 的引用：

source: Change <literal>$JBOSS_CONFIG/conf/login-config.xml</literal> and remove jboss-mq security policies
de_de: Verändern Sie <literal>$JBOSS_CONFIG/conf/login-config.xml</literal> und entfernen Sie jboss-mq Sicherheitsrichtlinien
es_es: Cambie <literal>$JBOSS_CONFIG/conf/login-config.xml</literal> y remueva las políticas de seguridad jboss-mq
fr_fr: Changer <literal>$JBOSS_CONFIG/conf/login-config.xml</literal> et retirer les politiques de sécurité jboss-mq
ja_jp: <literal>$JBOSS_CONFIG/conf/login-config.xml</literal> の変更で jboss-mq セキュリティポリシーを削除します。
pt_br: Modifique o <literal>$JBOSS_CONFIG/conf/login-config.xml</literal> e remova as políticas de segurança jboss-mq.
zh_cn: 修改 <literal>$JBOSS_CONFIG/conf/login-config.xml</literal> 并删除 jboss-mq 安全策略。

source: ### Remove these lines: &lt;!-- Security domain for JBossMQ --&gt; &lt;application-policy name = "jbossmq"&gt; &lt;authentication&gt; &lt;login-module code = "org.jboss.security.auth.spi.DatabaseServerLoginModule" flag = "required"&gt; &lt;module-option name = "unauthenticatedIdentity"&gt;guest&lt;/module-option&gt; &lt;module-option name = "dsJndiName"&gt;java:/DefaultDS&lt;/module-option&gt; &lt;module-option name = "principalsQuery"&gt; SELECT PASSWD FROM JMS_USERS WHERE USERID=?&lt;/module-option&gt; &lt;module-option name = "rolesQuery"&gt; SELECT ROLEID, 'Roles' FROM JMS_ROLES WHERE USERID=?&lt;/module-option&gt; &lt;/login-module&gt; &lt;/authentication&gt; &lt;/application-policy&gt; &lt;!-- Security domain for JBossMQ when using file-state-service.xml &lt;application-policy name = "jbossmq"&gt; &lt;authentication&gt; &lt;login-module code = "org.jboss.mq.sm.file.DynamicLoginModule" flag = "required"&gt; &lt;module-option name = "unauthenticatedIdentity"&gt;guest&lt;/module-option&gt; &lt;module-option name = "sm.objectname"&gt;jboss.mq:service=StateManager&lt;/module-option&gt; &lt;/login-module&gt; &lt;/authentication&gt; &lt;/application-policy&gt; --&gt;
de_de: ### Entfernen Sie diese Zeilen: &lt;!-- Security domain for JBossMQ --&gt; &lt;application-policy name = "jbossmq"&gt; &lt;authentication&gt; &lt;login-module code = "org.jboss.security.auth.spi.DatabaseServerLoginModule" flag = "required"&gt; &lt;module-option name = "unauthenticatedIdentity"&gt;guest&lt;/module-option&gt; &lt;module-option name = "dsJndiName"&gt;java:/DefaultDS&lt;/module-option&gt; &lt;module-option name = "principalsQuery"&gt; SELECT PASSWD FROM JMS_USERS WHERE USERID=?&lt;/module-option&gt; &lt;module-option name = "rolesQuery"&gt; SELECT ROLEID, 'Roles' FROM JMS_ROLES WHERE USERID=?&lt;/module-option&gt; &lt;/login-module&gt; &lt;/authentication&gt; &lt;/application-policy&gt; &lt;!-- Security domain for JBossMQ when using file-state-service.xml &lt;application-policy name = "jbossmq"&gt; &lt;authentication&gt; &lt;login-module code = "org.jboss.mq.sm.file.DynamicLoginModule" flag = "required"&gt; &lt;module-option name = "unauthenticatedIdentity"&gt;guest&lt;/module-option&gt; &lt;module-option name = "sm.objectname"&gt;jboss.mq:service=StateManager&lt;/module-option&gt; &lt;/login-module&gt; &lt;/authentication&gt; &lt;/application-policy&gt; --&gt;
fr_fr: ### Retirer ces lignes: &lt;!-- Security domain for JBossMQ --&gt; &lt;application-policy name = "jbossmq"&gt; &lt;authentication&gt; &lt;login-module code = "org.jboss.security.auth.spi.DatabaseServerLoginModule" flag = "required"&gt; &lt;module-option name = "unauthenticatedIdentity"&gt;guest&lt;/module-option&gt; &lt;module-option name = "dsJndiName"&gt;java:/DefaultDS&lt;/module-option&gt; &lt;module-option name = "principalsQuery"&gt; SELECT PASSWD FROM JMS_USERS WHERE USERID=?&lt;/module-option&gt; &lt;module-option name = "rolesQuery"&gt; SELECT ROLEID, 'Roles' FROM JMS_ROLES WHERE USERID=?&lt;/module-option&gt; &lt;/login-module&gt; &lt;/authentication&gt; &lt;/application-policy&gt; &lt;!-- Security domain for JBossMQ when using file-state-service.xml &lt;application-policy name = "jbossmq"&gt; &lt;authentication&gt; &lt;login-module code = "org.jboss.mq.sm.file.DynamicLoginModule" flag = "required"&gt; &lt;module-option name = "unauthenticatedIdentity"&gt;guest&lt;/module-option&gt; &lt;module-option name = "sm.objectname"&gt;jboss.mq:service=StateManager&lt;/module-option&gt; &lt;/login-module&gt; &lt;/authentication&gt; &lt;/application-policy&gt; --&gt;

source: Starting the Server
de_de: Starten des Servers
es_es: Iniciar el servidor
fr_fr: Démarrer le serveur
ja_jp: サーバーの開始
pt_br: Inicializando o Servidor
zh_cn: 启动服务器

source: To run the server, execute the <filename>run.bat</filename> or <filename>run.sh</filename> script as appropriate for your operating system, in the <filename>$JBOSS_HOME/bin</filename> directory.
de_de: Um den Server laufen zu lassen, führen Sie das <filename>run.bat</filename> oder <filename>run.sh</filename>-Skript im <filename>$JBOSS_HOME/bin</filename>-Verzeichnis wie für Ihr Betriebssystem passend aus.
es_es: Para ejecutar el servidor, ejecute el script <filename>run.bat</filename> o <filename>run.sh</filename> como sea apropiado para su sistema operativo en el directorio <filename>$JBOSS_HOME/bin</filename>.
fr_fr: Pour exécuter le serveur, exécuter le script <filename>run.bat</filename> ou <filename>run.sh</filename> qui convient en fonction de votre système, dans le répertoire <filename>$JBOSS_HOME/bin</filename>.
ja_jp: サーバーを稼働するには、使用中オペレーティングシステムに応じて、<filename>$JBOSS_HOME/bin</filename> ディレクトリ内で <filename>run.bat</filename> 又は <filename>run.sh</filename> の スクリプトを実行します。
pt_br: Execute o script <filename>run.bat</filename> ou <filename>run.sh</filename> conforme apropriado em seu sistema de operação, no diretório <filename>$JBOSS_HOME/bin</filename>, para rodar o servidor.
zh_cn: 要运行这个服务器，根据操作系统执行 <filename>$JBOSS_HOME/bin</filename> 目录下的 <filename>run.bat</filename> 或 <filename>run.sh</filename> 脚本。

source: Where config_name is the name of the JBoss AS configuration where you have installed messaging. (The default is 'messaging')
de_de: Wo config_name der Name der JBoss AS Konfiguration ist, wo Sie Messaging installiert haben. (Der Standard ist 'messaging')
es_es: En donde config_name es el nombre de la configuración JBoss AS en donde ha instalado messaging, (por defecto es 'messaging').
fr_fr: Où config_name est le nom de la configuration JBoss AS où vous avez installé messaging. (Le nom par défaut est 'messaging')
ja_jp: ここで、config_name とは messaging をインストールしている JBoss AS 設定の 名前です。（デフォルトは messaging）
pt_br: Quando o config_name for o nome da configuração do JBoss AS uma vez que você tenha instalado o messaging. (O padrão é 'messaging')
zh_cn: 这里的 config_name 是你安装 Messaging 的 JBoss AS 配置的名称（缺省为 'messaging'）。

source: A successful JBoss Messaging deployment generates logging output similar to for a non clustered installation (for a clustered installation you will also see extra cluster related output)
de_de: Ein erfolgreiches JBoss Messaging Deployment generiert eine Protokollierungsausgabe ähnlich derjenigen einer nicht-geclusterten Installation (für eine geclusterte Installation sehen Sie auch Extra-Ausgaben, die sich auf das Cluster beziehen)
es_es: Un despliegue exitoso de JBoss Messaging genera una salida similar al iniciar sesión que una instalación sin clústers (para una instalación con clústers también verá una salida relacionada con el clúster)
fr_fr: Un déploiement de Jboss Messaging qui fonctionne correctement devrait générer des sorties de journalisation similaires à celles générées par une installation non groupée (pour une installation groupée, vous verrez également une sortie supplémentaire relative au groupement)
ja_jp: 正しくデプロイされた JBoss Messaging はクラスター化に対応していないインストール用には以下に 似たロギング出力を生成します。（クラスター化インストールには、余分のクラスター 関連の出力も出ます）
pt_br: Uma implementação do JBoss Messaging com êxito gera a habilitação do emissor similar a uma instalação em cluster (para uma instalação com cluster, você verá também cluster extras relacionados ao emissor).
zh_cn: 成功的 JBoss Messaging 部署产生和非群集安装类似的日志输出（对于群集安装，你将看到和群集相关的额外信息）。

source: The warning message <literal>"DataSource connection transaction isolation should be READ_COMMITTED, but it is currently NONE"</literal> is there to remind you that by default JBossAS ships with Hypersonic, an in-memory Java-based database engine, which is apropriate for demo purposes, but not for heavy load production environments. The <ulink url="http://wiki.jboss.org/wiki/Wiki.jsp?page=ConfigJBossMQDB">Critique of Hypersonic</ulink> wiki page outlines some of the well-known issues occuring when using this database.
de_de: Der Warnhinweis <literal>"DataSource connection transaction isolation should be READ_COMMITTED, but it is currently NONE"</literal> soll Sie daran erinnern, dass JBossAS standardmäßig mit Hypersonic einer in-memory Java-basierten Datenbank-Engine geliefert wird, die für Demo-Zwecke geeignet ist, nicht aber für stark ausgelastete Produktionsumgebungen. Die <ulink url="http://wiki.jboss.org/wiki/Wiki.jsp?page=ConfigJBossMQDB">Critique of Hypersonic</ulink> Wiki-Seite geht auf einige der bekannten Probleme ein, die bei der Verwendung dieser Datenbank auftreten können.
es_es: El mensaje de advertencia <literal>"DataSource connection transaction isolation should be READ_COMMITTED, but it is currently NONE"</literal> se presenta para recordarle que por defecto JBossAS se envía junto con Hypersonic, una máquina de base de datos en-memoria con base en Java, la cual es apropiada para porpósitos de demostración, pero no para entornos de producción de carga pesada. La página wiki <ulink url="http://wiki.jboss.org/wiki/Wiki.jsp?page=ConfigJBossMQDB">Critique of Hypersonic</ulink> presenta algunos de los problemas bien conocidos que tienen lugar al usar esta base de datos.
fr_fr: Le message d'avertissement <literal>"DataSource connection transaction isolation should be READ_COMMITTED, but it is currently NONE"</literal> est là pour vous rappeler que par défaut JBossAS est proposé avec Hypersonic, un moteur de base de données basée-Java-en-mémoire, qui convient pour les présentations, mais pas pour les environnements de production à grand volume de travail. La page wiki <ulink url="http://wiki.jboss.org/wiki/Wiki.jsp?page=ConfigJBossMQDB">Critique of Hypersonic</ulink> souligne quelques uns des problèmes bien connus, associés à l'utilisation de cette base de données.
ja_jp: 警告メッセージ <literal>"DataSource connection transaction isolation should be READ_COMMITTED, but it is currently NONE"</literal> は、デフォルトの JBossAS が Hypersonic と言うメモリー内 Java ベースのデータベースエンジンで配布されており、 これがデモンストレーション目的には適切ではある半面、高負荷の実稼働環境には不適合であることを 知らせるためにあります。<ulink url="http://wiki.jboss.org/wiki/Wiki.jsp?page=ConfigJBossMQDB">Critique of Hypersonic</ulink> wiki ページはこの データベースを使用する時に発生する既知の問題の一部について概要を示しています。
pt_br: A mensagem de aviso <literal>"DataSource connection transaction isolation should be READ_COMMITTED, but it is currently NONE"</literal> está lá para lembrá-lo que pelo padrão o JBossAS lança o Hypersonic. Sendo este, um mecanismo de banco de dados baseado na memória Java, da qual é apropriada para fins demo, mas não para ambientes de produção de carga pesada. A página wiki <ulink url="http://wiki.jboss.org/wiki/Wiki.jsp?page=ConfigJBossMQDB">Critique of Hypersonic</ulink> traça alguns dos problemas ocorridos, uma vez utilizando este banco de dados.
zh_cn: 这里的警告信息 <literal>"DataSource connection transaction isolation should be READ_COMMITTED, but it is currently NONE"</literal> 是提醒你 JBossAS 缺省附带的 Hypersonic（一个运行于内存里的基于 Java 的数据库引擎）仅适合演示目的，它不适用于高负载的产品环境。<ulink url="http://wiki.jboss.org/wiki/Wiki.jsp?page=ConfigJBossMQDB">Critique of Hypersonic</ulink> wiki 页面描述了使用这个数据库时发生的一些众所周知的问题。

source: Before using Messaging in production, you <emphasis>must</emphasis> configure the Messaging instance to use an enterprise-class database backend such as Oracle, Sybase, PostgreSQL, MS SQL or MySQL, otherwise you risk losing your data. See <xref linkend="conf.changingds"/> for details about replacing Hypersonic.
de_de: Ehe Sie Messaging in Production verwenden, <emphasis>müssen</emphasis> Sie die Messaging Instanz so konfigurieren, dass ein Datenbank-Backend der Enterprise-Klasse wie etwa Oracle, Sybase, PostgreSQL, MS SQL oder MySQL verwendet wird, da Sie andernfalls den Verlust Ihrer Daten riskieren. Einzelheiten zum Ersetzen von Hypersonic finden Sie unter <xref linkend="conf.changingds"/>.
es_es: Antes de utilizar Messaging en producción <emphasis>tiene</emphasis> que configurar la instancia Messaging para utilizar un backend de la base de datos de la clase empresarial tal como Oracle, Sybase, PostgreSQL, MS SQL o MySQL, de otra manera corre el riesgo de perder sus datos. Consulte <xref linkend="conf.changingds"/> para obtener más detalles sobre como reemplazar Hypersonic.
fr_fr: Avant d'utiliser Messaging en production, vous <emphasis>devez</emphasis> configurer l'instance de Messaging en utilisant un système de données classe-entreprise, comme Oracle, Sybase, PostgreSQL, MS SQL ou MySQL, sinon vous risquez de perdre vos données. Voir <xref linkend="conf.changingds"/> pour trouver des informations sur la manière de remplacer Hypersonic.
ja_jp: Messaging を実稼働環境で使用する前に、Messaging インスタンスを設定して Oracle, Sybase, PostgreSQL, MS SQL それに MySQL などの エンタープライズクラスの データベースバックエンドを使用するようにしなければなりません。そうしないと、 データ紛失のリスクを持つことになります。Hypersonic の取り替えに関する詳細は <xref linkend="conf.changingds"/> でご覧下さい。
pt_br: Antes de se usar o Messaging em produção, você <emphasis>deve</emphasis> configurar a instância Messaging para uso do banco de dados de classe empresarial backend tal como Oracle, Sybase, PostgreSQL, MS SQL ou MySQL. Do contrário, você arriscará perder todos os seus dados. Consulte o <xref linkend="conf.changingds"/> para maiores detalhes em como substituir o Hypersonic.
zh_cn: 在产品环境里使用 Messaging 之前，你<emphasis>必须</emphasis>配置 Messaging 实例来使用企业级的数据库后台，如 Oracle、Sybase、PostgreSQL、MS SQL 或 MySQL，否则你有丢失数据的风险。关于替换 Hypersonic 的详情，请参考 <xref linkend="conf.changingds"/>。

source: Installation Validation
de_de: Installationsvalidierung
es_es: Validación de la instalación
fr_fr: Validation de l'installation
ja_jp: インストールの妥当性検証
pt_br: Validação da Instalação
zh_cn: 验证安装

source: The release bundle contains a series of examples that should run "out of the box" and could be used to validate a new installation. Such an example sends a persistent JMS message to a queue called <literal>queue/testQueue</literal>.
de_de: Das Release Bündel enthält eine Reihe von Beispielen, die sofort zur Ausführung bereit sein sollten und zur Validierung einer neuen Installation verwendet werden können. Ein solches Beispiel sendet eine persistente JMS-Nachricht an eine Warteschlange namens <literal>queue/testQueue</literal>.
es_es: El lanzamiento contiene una serie de ejemplos que se deben ejecutar "tal como vienen" y se pueden utilizar para validar una nueva instalación. Tal ejemplo envía un mensaje JMS persistente a una cola llamada <literal>queue/testQueue</literal>.
fr_fr: Le paquetage de mise à jour comprend une série d'exemples qui doivent être exécutés "out the box" et qui pourraient être utilisés pour valider une nouvelle installation. Un tel exemple envoie un message JMS persistant vers une file d'attente nommée <literal>queue/testQueue</literal>.
ja_jp: リリースバンドルは、新品状態のままで実行できるサンプル集合を含んでおり、 これらは新規インストールの検証に使用することができます。そのようなサンプルは 永続化の JMS メッセージを <literal>queue/testQueue</literal> と言う キューに 送信します。
pt_br: Este agrupamento de liberação contém uma série de exemplos que devem rodar "fora da caixa" e podem ser usados para validar uma nova instalação. Tal exemplo envia uma mensagem JMS de persistência para uma fila chamada <literal>queue/testQueue</literal>.
zh_cn: 本发行版本包含一系列可以马上运行的例子，它们可用来验证新的安装。这样的例子发送一条持久性 JMS 消息至名为 <literal>queue/testQueue</literal> 的队列。
