Repository: bobmcwhirter/jboss-messaging
Catalog: docs/EAP_4_3/JBoss_Messaging_User_Guide/*/Installation.po
Languages: de_de, es_es, fr_fr, ja_jp, pt_br, zh_cn

source: You don't actually have to create an environment variable <literal>JBOSS_CONFIG</literal>, this is just used in the installation instructions to describe the steps
de_de: Sie müssen nicht tatsächlich eine Umgebungsvariable <literal>JBOSS_CONFIG</literal> erstellen, dies wurde lediglich in der Installationsanweisung verwendet, um die Schritte zu beschreiben
es_es: De hecho no tiene que crear una variable de entorno <literal>JBOSS_CONFIG</literal>, esto sólo se utiliza en las instrucciones de instalación para describir los pasos
fr_fr: Vous n'avez pas vraiment besoin de créer une variable d'environnement <literal>JBOSS_CONFIG</literal>, c'est uniquement utilisé dans les instructions d'installation pour décrire les étapes
ja_jp: 実際には環境変数 <literal>JBOSS_CONFIG</literal> は作成する必要はありません。 これは、単にこの手順を説明する為にインストールの案内に使用しているだけです。
pt_br: Na realidade, você não precisa criar uma variável do ambiente <literal>JBOSS_CONFIG</literal>. Isto é apenas utilizada nas instruções de instalação para descrição de alguns passos.
zh_cn: 实际上你不需要创建环境变量 <literal>JBOSS_CONFIG</literal>，它只是被用来描述安装步骤。

source: For a clustered installation it is mandatory that a shared database is available to all nodes in the cluster. The default JBoss AS uses HSQLDB for its database which is a local shared database. Therefore in order to use clustering you must replace this with a different shared database. If the database is not replaced then clustering will not work.
de_de: Für eine geclusterte Installation ist es verbindlich, dass eine geteilte Datenbank allen Nodes im Cluster zugänglich ist. Der standardmäßige JBoss AS verwendet HSQLDB für seine Datenbank, die eine lokale, geteilte Datenbank ist. Um daher Clustering zu verwenden, müssen Sie diese durch eine andere geteilte Datenbank ersetzen. Wird die Datenbank nicht ersetzt, funktioniert Clustering nicht.
es_es: Para una instalación con clústers es obligatorio que una base de datos compartida esté disponible para todos los nodos en el clúster. El JBoss AS predeterminado utiliza HSQLDB para su base de datos, la cual es una base de datos local compartida. Por lo tanto con el fin de utiliza clústers tiene que reemplazar esto con una diferente base de datos compartida. Si la base de datos no se reemplaza entonces el clúster no funciona.
fr_fr: Pour une installation en groupe, il faut qu'une base de données soit partagée par tous les noeuds du groupement. JBoss AS par défaut utilise HSQLDB pour sa banque de données qui est une banque de données locale partagée. De ce fait, pour utiliser le regroupement, vous devez la remplacer par une base de données différente partagée. Si cette base de donnée n'est pas remplacée, le regroupement ne fonctionnera pas.
ja_jp: クラスター化したインストールには、共有データベースがクラスター内の全ての ノードで利用できることが必須です。デフォルトの JBoss AS はデータベースとして ローカルの共有データベースである HSQLDB を使用します。そのため、クラスタリングを 使用するには、これを別の共有データベースで入れ替えなければなりません。データベースが 入れ替わらないとクラスタリングは機能しません。
pt_br: Para a instalação com cluster é obrigatório que o banco de dados compartilhado esteja disponível a todos os nós de cluster. O JBoss AS padrão usa o HSQLDB para seu banco de dados, que é um banco de dados local compartilhado. Portanto, você deverá substituí-lo com um diferente banco de dados compartilhado. Caso o banco de dados não seja substituído, então o cluster não irá funcionar.
zh_cn: 对于群集方式的安装来说，一个所有节点共享的数据库是强制的。缺省的 JBoss AS 使用 HSQLDB 作为其本地共享的数据库。因此，为了使用群集，你必须用不同的共享数据库来替换它。如果没有替换这个数据库，群集将不能运行。

source: Replace <literal>$JBOSS_CONFIG/deploy/jboss-messaging.sar/hsqldb-persistence-service.xml</literal> by the <literal>databasename&gt;-persistence-service</literal> from <literal>&lt;downloadPackage&gt;/examples/config.</literal>. For instance <literal>mysql-persistence-service.xml</literal>
de_de: Ersetzen Sie <literal>$JBOSS_CONFIG/deploy/jboss-messaging.sar/hsqldb-persistence-service.xml</literal> durch <literal>databasename&gt;-persistence-service</literal> aus <literal>&lt;downloadPackage&gt;/examples/config.</literal>. Zum Beispiel <literal>mysql-persistence-service.xml</literal>
es_es: Reemplace <literal>$JBOSS_CONFIG/deploy/jboss-messaging.sar/hsqldb-persistence-service.xml</literal> por el <literal>databasename&gt;-persistence-service</literal> desde <literal>&lt;downloadPackage&gt;/examples/config.</literal>. Por ejemplo <literal>mysql-persistence-service.xml</literal>
fr_fr: Remplacer <literal>$JBOSS_CONFIG/deploy/jboss-messaging.sar/hsqldb-persistence-service.xml</literal> par <literal>databasename&gt;-persistence-service</literal> à partir de <literal>&lt;downloadPackage&gt;/examples/config.</literal>. Pour l'instance <literal>mysql-persistence-service.xml</literal>
ja_jp: <literal>$JBOSS_CONFIG/deploy/jboss-messaging.sar/hsqldb-persistence-service.xml</literal> を <literal>&lt;downloadPackage&gt;/examples/config.</literal> からの、<literal>databasename&gt;-persistence-service</literal> によって入れ替えます。 例えば、<literal>mysql-persistence-service.xml</literal>
pt_br: Substitua o <literal>$JBOSS_CONFIG/deploy/jboss-messaging.sar/hsqldb-persistence-service.xml</literal> pelo <literal>databasename&gt;-persistence-service</literal> a partir do <literal>&lt;downloadPackage&gt;/examples/config.</literal>. Por exemplo: <literal>mysql-persistence-service.xml</literal>.
zh_cn: 用 <literal>&lt;downloadPackage&gt;/examples/config.</literal> 里的 <literal>databasename&gt;-persistence-service</literal> 替换 <literal>$JBOSS_CONFIG/deploy/jboss-messaging.sar/hsqldb-persistence-service.xml</literal>。例如 <literal>mysql-persistence-service.xml</literal>。

source: Configure a JCA datasource using an example from <literal>$JBOSS_HOME/docs/examples/jca</literal> and copying to <literal>$JBOSS_CONFIG/deploy</literal> JBoss Messaging uses <literal>DefaultDS</literal> by default so you should configure your datasource to bind to that
de_de: Konfigurieren Sie eine JCA-Datenquelle unter Verwendung eines Beispiels aus <literal>$JBOSS_HOME/docs/examples/jca</literal> und kopieren Sie in <literal>$JBOSS_CONFIG/deploy</literal>. JBoss Messaging verwendet standardmäßig <literal>DefaultDS</literal>, weshalb Sie Ihre Datenquelle so konfigurieren sollten, dass sie dort anbindet
es_es: Configure una fuente de datos JCA utilizando un ejemplo de <literal>$JBOSS_HOME/docs/examples/jca</literal> y copiando a <literal>$JBOSS_CONFIG/deploy</literal> JBoss Messaging usa <literal>DefaultDS</literal> por defecto así que debe configurar su fuente de datos para enlazar a eso
fr_fr: Configurer une source de données JCA en utilisant l'exemple de <literal>$JBOSS_HOME/docs/examples/jca</literal> et en le copiant dans JBoss Messaging <literal>$JBOSS_CONFIG/deploy</literal> utilise <literal>DefaultDS</literal> par défaut, donc vous devez configurer votre source de données pour vous y conformer
ja_jp: <literal>$JBOSS_HOME/docs/examples/jca</literal> からの例を使用して JCA datasource を 設定して、<literal>$JBOSS_CONFIG/deploy</literal> にコピーします。JBoss Messaging はデフォルトで <literal>DefaultDS</literal> を使用するので、それにバインドするために使用する datasource を 設定する必要があります。
pt_br: Configure o banco de dados JCA usando um exemplo a partir do <literal>$JBOSS_HOME/docs/examples/jca</literal> e copiando para <literal>$JBOSS_CONFIG/deploy</literal>. O JBoss Messaging usa <literal>DefaultDS</literal> pelo padrão, de maneira que você poderá configurar seu banco de dados para vincular-se a isto.
zh_cn: 用 <literal>$JBOSS_HOME/docs/examples/jca</literal> 里的示例配置 JCA 数据源并复制到 <literal>$JBOSS_CONFIG/deploy</literal> 里。JBoss Messaging 缺省使用 <literal>DefaultDS</literal>，所以你应该配置自己的数据源。

source: Remove hsqldb-ds.xml from <literal>$JBOSS_CONFIG/deploy</literal>
es_es: Remueva hsqldb-ds.xml de <literal>$JBOSS_CONFIG/deploy</literal>
fr_fr: Retirer hsqldb-ds.xml de <literal>$JBOSS_CONFIG/deploy</literal>
ja_jp: <literal>$JBOSS_CONFIG/deploy</literal> から hsqldb-ds.xml を除きます。
pt_br: Remova o hsqldb-ds.xml do <literal>$JBOSS_CONFIG/deploy</literal>.
zh_cn: 从 <literal>$JBOSS_CONFIG/deploy</literal> 里删除 hsqldb-ds.xml。

source: Copy your database driver to <literal>$JBOSS_CONFIG/lib</literal>. Your database driver can probably be downloaded from your database provider's web site
de_de: Kopieren Sie Ihren Datenbanktreiber in <literal>$JBOSS_CONFIG/lib</literal>. Sie können Ihren Datenbanktreiber wahrscheinlich von der Website Ihres Datenbank-Providers herunterladen
es_es: Copie el controlador de la base de datos en <literal>$JBOSS_CONFIG/lib</literal>. Su controlador de la base de datos probablemente puede descargarse del sitio web del proveedor de la base de datos
fr_fr: Copier la base de donnée de votre pilote dans <literal>$JBOSS_CONFIG/lib</literal>. Votre pilote de base de données peut probablement être déchargé à partir de la base de données du site internet de votre provider.
ja_jp: 使用するデータベースドライバーを <literal>$JBOSS_CONFIG/lib</literal> にコピーします。 使用するデータベースドライバーはたぶんそのデータベースプロバイダーの Web サイトから ダウンロードできるでしょう。
pt_br: Copie seu driver do banco de dados para <literal>$JBOSS_CONFIG/lib</literal>. O seu driver de banco de dados poderá ser baixado de seu site da web de provedor.
zh_cn: 把数据库驱动复制到 <literal>$JBOSS_CONFIG/lib</literal> 里。你也可以从数据库提供者的网站上下载相关驱动。

source: Ensure the <literal>ServerPeerID</literal> MBean attribute value in messaging-service.xml is unique for each node. The <literal>ServerPeerID</literal> value must be a valid integer. Every node MUST have a unique id, including those just connected by message bridges.
de_de: Stellen Sie sicher, dass der <literal>ServerPeerID</literal> MBean Attributwert in messaging-service.xml eindeutig für jeden Node ist. Beim <literal>ServerPeerID</literal>-Wert muss es sich um eine gültige ganze Zahl handeln. Jeder Node MUSS eine eindeutige ID besitzen, einschließlich der nur durch Nachrichtenbrücken ("Message Bridges") verbundenen.
es_es: Asegúrese de que el valor del atributo MBean <literal>ServerPeerID</literal> en messaging-service.xml es único para cada nodo. El valor <literal>ServerPeerID</literal> debe ser un número entero válido. Todo nodo TIENE que tener un id único, incluyendo aquello que sólo estan conectador por puentes de mensajes.
fr_fr: Veillez à ce que la valeur de l'attribut <literal>ServerPeerID</literal> du MBean dans messaging-service.xml est unique pour chaque noeud. La valeur <literal>ServerPeerID</literal> doit être une entier relatif valide Chaque noeud DOIT avoir un id unique, y compris ceux qui sont simplement reliés par des ponts de messagerie.
ja_jp: messaging-service.xml 内の <literal>ServerPeerID</literal> MBean 属性の値が 各ノード毎に特有であることを確実にします。<literal>ServerPeerID</literal> の 値は有効な整数でなければなりません。単にメッセージブリッジで接続されている ものも含み全てのノードは特有の ID を持っている必要があります。
pt_br: Tenha certeza de que o valor do atributo MBean <literal>ServerPeerID</literal> em messaging-service.xml é único para cada nó. Cada nó DEVE possuir uma id exclusiva, incluindo aqueles apenas conectados pelas interligações de mensagens.
zh_cn: 确保 messaging-service.xml 里的 <literal>ServerPeerID</literal> MBean 属性值对于每个节点而言都是唯一的。<literal>ServerPeerID</literal> 必须是有效的整型值。每个节点（包括那些仅通过消息桥连接的节点）都必须具有唯一的 ID。

source: Each node must have a unique <literal>ServerPeerID</literal> for clustering to work!
de_de: Jeder Node muss eine eindeutige <literal>ServerPeerID</literal> besitzen, damit Clustering funktioniert!
es_es: ¡Cada nodo debe tener un <literal>ServerPeerID</literal> único para que los clústers funcionen!
fr_fr: Chaque noeud doit posséder un <literal>ServerPeerID</literal> unique pour que le groupage fonctionne!
ja_jp: クラスタリングが機能するためには、各ノードが特有の <literal>ServerPeerID</literal> を 持っていなければなりません。
pt_br: Cada nó deve possuir uma exclusiva <literal>ServerPeerID</literal> para o cluster funcionar.
zh_cn: 为了群集的运行，每个节点都必须具有唯一的 <literal>ServerPeerID</literal>。

source: If you want to run multiple JBoss Messaging nodes on the same box using the same IP address, e.g. for development purposes, then you can use the ServiceBindingManager to do this as follows:
de_de: Falls Sie mehrere JBoss Messaging Nodes auf derselben Box unter Verwendung derselben IP-Adresse verwenden möchten, etwa zu Entwicklungszwecken, so können Sie den ServiceBindingManager verwenden, um dies wie folgt zu tun:
es_es: Si quiere ejecutar múltiples nodos JBoss Messaging en la misma máquina utilizando la misma dirección IP, por ejemplo, para propósitos de desarrollo entonces puede utilizar el ServiceBindingManager para hacer esto así:
fr_fr: Si vous souhaitez exécuter des noeuds JBoss Messaging multiples sur la même machine en utilisant la même adresse IP, par ex. dans un but de développement, vous pouvez utiliser ServiceBindingManager pour vous aider:
ja_jp: 例えば開発目的で同じ IP アドレスを使用して同じボックス上で複数の JBoss Messaging ノード群を 使用したい場合は、以下のようにして ServiceBindingManager を使用することで、それを 達成できます:
pt_br: Caso você deseje rodar nós múltiplos do JBoss Messaging na mesma caixa, usando o mesmo endereço IP (por exemplo: para fins de desenvolvimento), você poderá usar o ServiceBindingManager para isto, conforme segue abaixo:
zh_cn: 如果你想在同一主机上运行多个具有相同 IP 地址的 JBoss Messaging 节点（如处于开发目的），你可以使用 ServiceBindingManager：

source: Uncomment binding manager service from $JBOSS_CONFIG/conf/jboss-service.xml
de_de: Unkommentieren Sie den Binding-Manager-Dienst aus $JBOSS_CONFIG/conf/jboss-service.xml
es_es: Remueva el comentario del servidio administradir de vinculaciones de $JBOSS_CONFIG/conf/jboss-service.xml
fr_fr: Retirer le commentaire de binding manager service de $JBOSS_CONFIG/conf/jboss-service.xml
ja_jp: $JBOSS_CONFIG/conf/jboss-service.xml からバインディングマネージャサービスをアンコメント化します。
pt_br: Serviço de gerenciador binding sem comentário a partir do $JBOSS_CONFIG/conf/jboss-service.xml.
zh_cn: 取消 $JBOSS_CONFIG/conf/jboss-service.xml 里对 binding manager 服务的注释

source: Specify the desired port rage (e.g. ports-01, ports-02... etc)
de_de: Legen Sie den gewünschten Port-Bereich fest (z.B. ports-01, ports-02... u.s.w.)
es_es: Especifique el rango de puertos deseados (por ejemplo, ports-01, ports-02... etc)
fr_fr: Spécifier l'ordre de grandeur du port souhaité (ar ex. ports-01, ports-02... etc)
ja_jp: 希望のポート範囲（例：ports-01, ports-02...など）を指定します。
pt_br: Especifica a abrangência de portal desejada (por exemplo: ports-01, ports-02, etc.)
zh_cn: 指定相应的端口（如 ports-01、ports-02 等等）

source: Look at $JBOSS_HOME/docs/examples/binding-manager/sample-bindings.xml. On each port range, JBoss Remoting configuration should look like:
de_de: Sehen Sie sich $JBOSS_HOME/docs/examples/binding-manager/sample-bindings.xml an. An jedem Port-Bereich sollte die JBoss Remoting Konfiguration wie folgt aussehen:
es_es: Vea el $JBOSS_HOME/docs/examples/binding-manager/sample-bindings.xml. En cada rango del puerto, la configuración de JBoss Remoting se debe ver de manera similar a:
fr_fr: Regardez $JBOSS_HOME/docs/examples/binding-manager/sample-bindings.xml. Sur chaque interval portuaire, la configuration JBoss Remoting devrait ressembler à ce qui suit:
ja_jp: $JBOSS_HOME/docs/examples/binding-manager/sample-bindings.xml を確認します。 それぞれのポートの範囲では、JBoss Remoting 設定は以下のようになるはずです:
pt_br: Observe o $JBOSS_HOME/docs/examples/binding-manager/sample-bindings.xml. Em cada abrangência de portal, a configuração do JBoss Remoting deve parecer-se com:
zh_cn: 查看 $JBOSS_HOME/docs/examples/binding-manager/sample-bindings.xml。在每个端口范围内，JBoss Remoting 的配置应该类似于：

source: You must ensure that the config (like above) is identical to that in <literal>remoting-bisocket-service.xml</literal> With the exception of the actual serverBindPort which clearly must be different for each ports range. Please note that the default JBoss Messaging service binding manager bindings in <literal>sample-bindings.xml</literal> shipped with JBAS 4.2.0 is out of date and you will need to copy the config from <literal>remoting-bisocket-service.xml</literal>
de_de: Sie müssen sicherstellen, dass die config (wie oben) identisch zu der in <literal>remoting-bisocket-service.xml</literal> ist. Ausgenommen ist der tatsächliche serverBindPort, der natürlich für den Bereich jeden Ports unterschiedlich sein muss. Bitte beachten Sie, dass die Bindings des Binding Managers von JBoss Messaging in <literal>sample-bindings.xml</literal>, die mit JBAS 4.2.0 geliefert werden veraltet sind, und Sie die config aus <literal>remoting-bisocket-service.xml</literal> werden kopieren müssen
es_es: Debe asegurarse de que la configuración (como la anterior) sea idéntica a la de <literal>remoting-bisocket-service.xml</literal> Con la excepción del serverBindPort el cual claramente debe ser diferente para cada rango de puerto. Observe que los enlaces en <literal>sample-bindings.xml</literal> del administrador de enlaces del servicio JBoss Messaging predeterminado que se envía con JBAS 4.2.0 se encuentra desactualizado y necesitará copiar la configuración de <literal>remoting-bisocket-service.xml</literal>
fr_fr: Vous devez veiller à ce que la config (comme celle qui est mentionnée ci-dessus) soit identique à celle de <literal>remoting-bisocket-service.xml</literal> avec pour exception celle de serverBindPort qui doit être différente pour chaque interval portuaire. Veuillez noter que <literal>sample-bindings.xml</literal> le Binding Manager de service par défaut de JBoss Messaging et fourni avec JBAS 4.2.0, est obsolète et que vous devrez copier la config de <literal>remoting-bisocket-service.xml</literal>
ja_jp: （上記のような）config が <literal>remoting-bisocket-service.xml</literal> 内の config と同一になるように確認します。実際の serverBindPort は例外で、これは 明確に各ポート範囲毎に異なる必要があります。JBAS 4.2.0 で配布してある <literal>sample-bindings.xml</literal> 内のデフォルトの JBoss Messaging サービスバインディングマネージャのバインディングは旧式であるため、<literal>remoting-bisocket-service.xml</literal> から config をコピーする必要があることに注意して 下さい。
pt_br: Você deve garantir que a config (conforme acima) é idêntica àquela em <literal>remoting-bisocket-service.xml</literal>, sem nenhuma exceção do atual serverBindPort, do qual deve ser diferente para cada abrangência de portal. Perceba que o gerenciador binding do serviço do JBoss Messaging, do qual realiza o binding em <literal>sample-bindings.xml</literal> e lançado com o JBAS 4.2.0, está desatualizado e você precisará copiar a config a partir do <literal>remoting-bisocket-service.xml</literal>.
zh_cn: 你必须确保其上面的配置和 <literal>remoting-bisocket-service.xml</literal> 里的一样，除了实际的 serverBindPort（显然对于每个端口范围都必须有所不同）。请注意，JBAS 4.2.0 附带的 <literal>sample-bindings.xml</literal> 里的缺省 JBoss Messaging 服务 binding manager 已经过期，你将需要从 <literal>remoting-bisocket-service.xml</literal> 里复制新的配置。

source: You should ensure that each node is configured to use a different ports range.
de_de: Sie sollten sicherstellen, dass jeder Node so konfiguriert ist, dass er den Bereich eines anderen Ports verwendet.
es_es: Debe asegurarse de que cada nodo se configura para utilizar un rango diferente de puertos.
fr_fr: Vous devez veiller à ce que chaque noeud soit configuré pour utiliser un interval portuaire différent.
ja_jp: 各ノードが異なるポート範囲を使用するように設定されていることを確認して下さい。
pt_br: Você deve garantir que cada nó é configurado para uso em abrangências de portais diferentes.
zh_cn: 你应该确保每个节点都使用不同的端口范围。

source: There are few extra steps at
de_de: Es gibt einige Extra-Schritte unter
es_es: Hay unos pasos extras en
fr_fr: Il existe quelques étapes supplémentaire
ja_jp: いくつか余分な手順があります。
pt_br: Existem alguns outros passos
zh_cn: 还有几个额外的步骤

source: That's it
de_de: Das ist's
es_es: Eso es todo
fr_fr: C'est à dire
ja_jp: これで終了です。
pt_br: Que são
zh_cn: 这就是

source: Manual Installation
de_de: Manuelle Installation
es_es: Instalación manual
fr_fr: L'installation manuelle
ja_jp: 手動のインストール
pt_br: Instalação de Manual
zh_cn: 手工安装

source: This installation procedure should be performed if you are installing into a JBoss AS configuration that you have changed in some way from the default JBoss AS distribution. If you are just using the standard, untouched JBoss AS 4.2 distribution you can use the automated procedure above
de_de: Dieser Installationsvorgang sollte durchgeführt werden, falls Sie in eine JBoss AS Konfiguration installieren, die Sie aufgrund einer an der standardmäßigen JBoss AS Distribution vorgenommenen Änderung erhalten haben. Falls Sie lediglich die standardmäßige JBoss AS 4.2 Distribution verwenden, können Sie die automatisierte Vorgehensweise oben verwenden
es_es: Debe utilizar este procedimiento de instalación si está instalando en una configuración de JBoss AS que haya sido modificada de alguna manera de la distribución JBoss AS predeterminada. Si simplemente está utilizando la distribución JBoss AS 4.2 estándar sin haberla tocado entonces puede utilizar el procedimiento automatizado anterior.
fr_fr: La procédure d'installation devrait être effectuée si vous procédez à une installation dans une configuration JBoss AS que vous avez changée quelque peu au moins par rapport à la distribution JBoss As par défaut. Si vous utilisez une distribution JBoss AS 4.2 standard vierge, vous pouvez procéder à la procédure automatique ci-dessus
ja_jp: デフォルトの JBoss AS ディストリビューションからいくらか変更をしている JBoss AS 設定に インストールしている場合は、このインストール手順を実行する必要があります。全く 触っていない標準の JBoss AS 4.2 ディストリビューションを使用している場合は、上記の 自動化した手順を使用できます。
pt_br: Este procedimento de instalação deve ser executado caso você esteja instalando em uma configuração JBoss AS, da qual você tenha modificado de alguma maneira a partir da distribuição do JBoss AS padrão. Caso você esteja apenas utilizando o padrão, a distribuição JBoss AS 4.2 intocável, você poderá usar o procedimento acima.
zh_cn: 如果你在缺省的 JBoss AS 配置里做了修改，那么你应该使用本安装过程。如果你使用标准的、未更改的 JBoss AS 4.2 发行版本，那么你就可以使用之前所述的自动过程。

source: For this procedure we assume you already have your custom configuration located at <literal>JBOSS_CONFIG=$JBOSS_HOME/server/&lt;myconfiguration&gt;</literal>, and that it contains a JBoss MQ installation.
de_de: Für diesen Vorgang gehen wir davon aus, dass Sie bereits Ihre angepasste Konfiguration unter <literal>JBOSS_CONFIG=$JBOSS_HOME/server/&lt;myconfiguration&gt;</literal> besitzen und dass diese eine JBoss MQ Installation enthält.
es_es: Para este procedimiento asumimos que ya tiene su configuración personalizada en <literal>JBOSS_CONFIG=$JBOSS_HOME/server/&lt;myconfiguration&gt;</literal> y que contiene una instalación JBoss MQ.
fr_fr: Pour cette procédure, nous assumons que vous avez déjà une configuration personnalisée dans <literal>JBOSS_CONFIG=$JBOSS_HOME/server/&lt;myconfiguration&gt;</literal>, qui contient une installation JBoss MQ.
ja_jp: この手順では、<literal>JBOSS_CONFIG=$JBOSS_HOME/server/&lt;myconfiguration&gt;</literal> にカスタム設定をすで配置していること、そしてそれが JBoss MQ インストールを含んでいる ことを想定しています。
pt_br: Assumimos que para este exemplo você já possui sua configuração de costume localizada em <literal>JBOSS_CONFIG=$JBOSS_HOME/server/&lt;myconfiguration&gt;</literal>, e que ela possui uma instalação JBoss MQ.
zh_cn: 在本安装过程里，我们假定你的自定义配置位于 <literal>JBOSS_CONFIG=$JBOSS_HOME/server/&lt;myconfiguration&gt;</literal>，且它包含了一个 JBoss MQ 安装。
