Repository: bobmcwhirter/jboss-messaging
Catalog: docs/EAP_4_3/JBoss_Messaging_User_Guide/*/Installation.po
Languages: de_de, es_es, fr_fr, ja_jp, pt_br, zh_cn

source: Look at $JBOSS_HOME/docs/examples/binding-manager/sample-bindings.xml. On each port range, JBoss Remoting configuration should look like: <programlisting> &lt;service-config name="jboss.messaging:service=Connector,transport=bisocket" delegateClass="org.jboss.services.binding.AttributeMappingDelegate"&gt; &lt;delegate-config&gt; &lt;attribute name="Configuration"&gt;&lt;![CDATA[ &lt;config&gt; &lt;invoker transport="bisocket"&gt; &lt;attribute name="marshaller" isParam="true"&gt; org.jboss.jms.wireformat.JMSWireFormat &lt;/attribute&gt; &lt;attribute name="unmarshaller" isParam="true"&gt; org.jboss.jms.wireformat.JMSWireFormat &lt;/attribute&gt; &lt;attribute name="dataType" isParam="true"&gt;jms&lt;/attribute&gt; &lt;attribute name="socket.check_connection" isParam="true"&gt;false&lt;/attribute&gt; &lt;attribute name="timeout" isParam="true"&gt;0&lt;/attribute&gt; &lt;attribute name="serverBindAddress"&gt;${jboss.bind.address}&lt;/attribute&gt; &lt;attribute name="serverBindPort"&gt;4657&lt;/attribute&gt; &lt;attribute name="leasePeriod"&gt;10000&lt;/attribute&gt; &lt;attribute name="clientSocketClass" isParam="true"&gt; org.jboss.jms.client.remoting.ClientSocketWrapper &lt;/attribute&gt; &lt;attribute name="serverSocketClass"&gt; org.jboss.jms.server.remoting.ServerSocketWrapper &lt;/attribute&gt; &lt;attribute name="numberOfRetries" isParam="true"&gt;1&lt;/attribute&gt; &lt;attribute name="numberOfCallRetries" isParam="true"&gt;1&lt;/attribute&gt; &lt;attribute name="clientMaxPoolSize" isParam="true"&gt;50&lt;/attribute&gt; &lt;/invoker&gt; &lt;handlers&gt; &lt;handler subsystem="JMS"&gt; org.jboss.jms.server.remoting.JMSServerInvocationHandler &lt;/handler&gt; &lt;/handlers&gt; &lt;/config&gt; ]]&gt;&lt;/attribute&gt; &lt;/delegate-config&gt; &lt;binding port="4657"/&gt; &lt;/service-config&gt; </programlisting> <warning><para> You must ensure that the config (like above) is identical to that in <literal>remoting-bisocket-service.xml</literal> With the exception of the actual serverBindPort which clearly must be different for each ports range. Please note that the default JBoss Messaging service binding manager bindings in <literal>sample-bindings.xml</literal> shipped with JBAS 4.2.0 is out of date and you will need to copy the config from <literal>remoting-bisocket-service.xml</literal> </para> </warning> You should ensure that each node is configured to use a different ports range.
de_de: Sehen Sie sich $JBOSS_HOME/docs/examples/binding-manager/sample-bindings.xml an. An jedem Port-Bereich sollte die JBoss Remoting Konfiguration wie folgt aussehen: <programlisting> &lt;service-config name="jboss.messaging:service=Connector,transport=bisocket" delegateClass="org.jboss.services.binding.AttributeMappingDelegate"&gt; &lt;delegate-config&gt; &lt;attribute name="Configuration"&gt;&lt;![CDATA[ &lt;config&gt; &lt;invoker transport="bisocket"&gt; &lt;attribute name="marshaller" isParam="true"&gt; org.jboss.jms.wireformat.JMSWireFormat &lt;/attribute&gt; &lt;attribute name="unmarshaller" isParam="true"&gt; org.jboss.jms.wireformat.JMSWireFormat &lt;/attribute&gt; &lt;attribute name="dataType" isParam="true"&gt;jms&lt;/attribute&gt; &lt;attribute name="socket.check_connection" isParam="true"&gt;false&lt;/attribute&gt; &lt;attribute name="timeout" isParam="true"&gt;0&lt;/attribute&gt; &lt;attribute name="serverBindAddress"&gt;${jboss.bind.address}&lt;/attribute&gt; &lt;attribute name="serverBindPort"&gt;4657&lt;/attribute&gt; &lt;attribute name="leasePeriod"&gt;10000&lt;/attribute&gt; &lt;attribute name="clientSocketClass" isParam="true"&gt; org.jboss.jms.client.remoting.ClientSocketWrapper &lt;/attribute&gt; &lt;attribute name="serverSocketClass"&gt; org.jboss.jms.server.remoting.ServerSocketWrapper &lt;/attribute&gt; &lt;attribute name="numberOfRetries" isParam="true"&gt;1&lt;/attribute&gt; &lt;attribute name="numberOfCallRetries" isParam="true"&gt;1&lt;/attribute&gt; &lt;attribute name="clientMaxPoolSize" isParam="true"&gt;50&lt;/attribute&gt; &lt;/invoker&gt; &lt;handlers&gt; &lt;handler subsystem="JMS"&gt; org.jboss.jms.server.remoting.JMSServerInvocationHandler &lt;/handler&gt; &lt;/handlers&gt; &lt;/config&gt; ]]&gt;&lt;/attribute&gt; &lt;/delegate-config&gt; &lt;binding port="4657"/&gt; &lt;/service-config&gt; </programlisting> <warning><para> Sie müssen sicherstellen, dass config (wie oben) identisch mit <literal>remoting-bisocket-service.xml</literal>ist, ausgenommen des tatsächlichen serverBindPort, der natürlich für den Bereich jeden Ports anders sein muss. Beachten Sie bitte, dass die standardmäßigen Bindings des Binding Managers des JBoss Messaging Dienstes in <literal>sample-bindings.xml</literal>, die mit JBAS 4.2.0 geliefert werden, veraltet sind und Sie die config von <literal>remoting-bisocket-service.xml</literal> </para> werden kopieren müssen. </warning> Sie sollten sicherstellen, dass jeder Node zur Verwendung eines unterschiedlichen Port-Bereichs konfiguriert ist.
es_es: Vea $JBOSS_HOME/docs/examples/binding-manager/sample-bindings.xml. En cada rango de puerto, la configuración de JBoss Remoting se debe ver así: <programlisting> &lt;service-config name="jboss.messaging:service=Connector,transport=bisocket" delegateClass="org.jboss.services.binding.AttributeMappingDelegate"&gt; &lt;delegate-config&gt; &lt;attribute name="Configuration"&gt;&lt;![CDATA[ &lt;config&gt; &lt;invoker transport="bisocket"&gt; &lt;attribute name="marshaller" isParam="true"&gt; org.jboss.jms.wireformat.JMSWireFormat &lt;/attribute&gt; &lt;attribute name="unmarshaller" isParam="true"&gt; org.jboss.jms.wireformat.JMSWireFormat &lt;/attribute&gt; &lt;attribute name="dataType" isParam="true"&gt;jms&lt;/attribute&gt; &lt;attribute name="socket.check_connection" isParam="true"&gt;false&lt;/attribute&gt; &lt;attribute name="timeout" isParam="true"&gt;0&lt;/attribute&gt; &lt;attribute name="serverBindAddress"&gt;${jboss.bind.address}&lt;/attribute&gt; &lt;attribute name="serverBindPort"&gt;4657&lt;/attribute&gt; &lt;attribute name="leasePeriod"&gt;10000&lt;/attribute&gt; &lt;attribute name="clientSocketClass" isParam="true"&gt; org.jboss.jms.client.remoting.ClientSocketWrapper &lt;/attribute&gt; &lt;attribute name="serverSocketClass"&gt; org.jboss.jms.server.remoting.ServerSocketWrapper &lt;/attribute&gt; &lt;attribute name="numberOfRetries" isParam="true"&gt;1&lt;/attribute&gt; &lt;attribute name="numberOfCallRetries" isParam="true"&gt;1&lt;/attribute&gt; &lt;attribute name="clientMaxPoolSize" isParam="true"&gt;50&lt;/attribute&gt; &lt;/invoker&gt; &lt;handlers&gt; &lt;handler subsystem="JMS"&gt; org.jboss.jms.server.remoting.JMSServerInvocationHandler &lt;/handler&gt; &lt;/handlers&gt; &lt;/config&gt; ]]&gt;&lt;/attribute&gt; &lt;/delegate-config&gt; &lt;binding port="4657"/&gt; &lt;/service-config&gt; </programlisting> <warning><para> Debe asegurarse de que la configuración (como la anterior) sea idéntica a la que se encuentre en <literal>remoting-bisocket-service.xml</literal> Con la excepción del serverBindPort el cual claramente debe ser diferente para cada rango de puerto. Observe que los enlaces del administrador de enlaces den servicio JBoss Messaging predeterminado en <literal>sample-bindings.xml</literal> se envía junto con JBAS 4.2.0 está desactualizado y tendrá que copiar la configuración del <literal>remoting-bisocket-service.xml</literal> </para> </warning> Debe asegurarse de que cada nodo es configurado para utilizar un rango de puerto diferente.
fr_fr: Regarder $JBOSS_HOME/docs/examples/binding-manager/sample-bindings.xml. Sur chaque interval portuaire, La configuration JBoss Remoting devrait ressembler à ce qui suit: <programlisting> &lt;service-config name="jboss.messaging:service=Connector,transport=bisocket" delegateClass="org.jboss.services.binding.AttributeMappingDelegate"&gt; &lt;delegate-config&gt; &lt;attribute name="Configuration"&gt;&lt;![CDATA[ &lt;config&gt; &lt;invoker transport="bisocket"&gt; &lt;attribute name="marshaller" isParam="true"&gt; org.jboss.jms.wireformat.JMSWireFormat &lt;/attribute&gt; &lt;attribute name="unmarshaller" isParam="true"&gt; org.jboss.jms.wireformat.JMSWireFormat &lt;/attribute&gt; &lt;attribute name="dataType" isParam="true"&gt;jms&lt;/attribute&gt; &lt;attribute name="socket.check_connection" isParam="true"&gt;false&lt;/attribute&gt; &lt;attribute name="timeout" isParam="true"&gt;0&lt;/attribute&gt; &lt;attribute name="serverBindAddress"&gt;${jboss.bind.address}&lt;/attribute&gt; &lt;attribute name="serverBindPort"&gt;4657&lt;/attribute&gt; &lt;attribute name="leasePeriod"&gt;10000&lt;/attribute&gt; &lt;attribute name="clientSocketClass" isParam="true"&gt; org.jboss.jms.client.remoting.ClientSocketWrapper &lt;/attribute&gt; &lt;attribute name="serverSocketClass"&gt; org.jboss.jms.server.remoting.ServerSocketWrapper &lt;/attribute&gt; &lt;attribute name="numberOfRetries" isParam="true"&gt;1&lt;/attribute&gt; &lt;attribute name="numberOfCallRetries" isParam="true"&gt;1&lt;/attribute&gt; &lt;attribute name="clientMaxPoolSize" isParam="true"&gt;50&lt;/attribute&gt; &lt;/invoker&gt; &lt;handlers&gt; &lt;handler subsystem="JMS"&gt; org.jboss.jms.server.remoting.JMSServerInvocationHandler &lt;/handler&gt; &lt;/handlers&gt; &lt;/config&gt; ]]&gt;&lt;/attribute&gt; &lt;/delegate-config&gt; &lt;binding port="4657"/&gt; &lt;/service-config&gt; </programlisting> <warning><para> Vous devrez veiller à ce que la config (comme ci-dessus) est identique à celle qui existe dans <literal>remoting-bisocket-service.xml</literal> avce pour exception le serverBindPort qui doit être différent poiur chaque interval portuaire. Veillez noter que <literal>sample-bindings.xml</literal> du Binding Manager de service de JBoss Messaging proposé avec JBAS 4.2.0 est obsolète et vous aurez besoin de copier la configuration de <literal>remoting-bisocket-service.xml</literal> </para> </warning> Vous devrez veiller à ce que chaque noeud soit configuré de façon à utiliser différents intervals portuaires.
ja_jp: $JBOSS_HOME/docs/examples/binding-manager/sample-bindings.xml を確認します。 それぞれのポートの範囲で、JBoss Remoting 設定は以下のようになるはずです: <programlisting> &lt;service-config name="jboss.messaging:service=Connector,transport=bisocket" delegateClass="org.jboss.services.binding.AttributeMappingDelegate"&gt; &lt;delegate-config&gt; &lt;attribute name="Configuration"&gt;&lt;![CDATA[ &lt;config&gt; &lt;invoker transport="bisocket"&gt; &lt;attribute name="marshaller" isParam="true"&gt; org.jboss.jms.wireformat.JMSWireFormat &lt;/attribute&gt; &lt;attribute name="unmarshaller" isParam="true"&gt; org.jboss.jms.wireformat.JMSWireFormat &lt;/attribute&gt; &lt;attribute name="dataType" isParam="true"&gt;jms&lt;/attribute&gt; &lt;attribute name="socket.check_connection" isParam="true"&gt;false&lt;/attribute&gt; &lt;attribute name="timeout" isParam="true"&gt;0&lt;/attribute&gt; &lt;attribute name="serverBindAddress"&gt;${jboss.bind.address}&lt;/attribute&gt; &lt;attribute name="serverBindPort"&gt;4657&lt;/attribute&gt; &lt;attribute name="leasePeriod"&gt;10000&lt;/attribute&gt; &lt;attribute name="clientSocketClass" isParam="true"&gt; org.jboss.jms.client.remoting.ClientSocketWrapper &lt;/attribute&gt; &lt;attribute name="serverSocketClass"&gt; org.jboss.jms.server.remoting.ServerSocketWrapper &lt;/attribute&gt; &lt;attribute name="numberOfRetries" isParam="true"&gt;1&lt;/attribute&gt; &lt;attribute name="numberOfCallRetries" isParam="true"&gt;1&lt;/attribute&gt; &lt;attribute name="clientMaxPoolSize" isParam="true"&gt;50&lt;/attribute&gt; &lt;/invoker&gt; &lt;handlers&gt; &lt;handler subsystem="JMS"&gt; org.jboss.jms.server.remoting.JMSServerInvocationHandler &lt;/handler&gt; &lt;/handlers&gt; &lt;/config&gt; ]]&gt;&lt;/attribute&gt; &lt;/delegate-config&gt; &lt;binding port="4657"/&gt; &lt;/service-config&gt; </programlisting> <warning><para>（上記のような）config は <literal>remoting-bisocket-service.xml</literal> 内の config と同一になることを確認する必要があります。実際の serverBindPort は例外となり、これは明確に各ポート範囲毎に特有でなければなりません。 JBAS 4.2.0 で配布されている <literal>sample-bindings.xml</literal> 内のデフォルトの JBoss Messaging サービスバインディングマネージャのバインディングは旧式のものであるため、 <literal>remoting-bisocket-service.xml</literal> から config をコピーする必要があることに 注意して下さい。</para> </warning> 各ノードが異なるポート範囲を使用するように設定されている ことを確認して下さい。
pt_br: Observe o $JBOSS_HOME/docs/examples/binding-manager/sample-bindings.xml. On each port range, JBoss Remoting configuration should look like: <programlisting> &lt;service-config name="jboss.messaging:service=Connector,transport=bisocket" delegateClass="org.jboss.services.binding.AttributeMappingDelegate"&gt; &lt;delegate-config&gt; &lt;attribute name="Configuration"&gt;&lt;![CDATA[ &lt;config&gt; &lt;invoker transport="bisocket"&gt; &lt;attribute name="marshaller" isParam="true"&gt; org.jboss.jms.wireformat.JMSWireFormat &lt;/attribute&gt; &lt;attribute name="unmarshaller" isParam="true"&gt; org.jboss.jms.wireformat.JMSWireFormat &lt;/attribute&gt; &lt;attribute name="dataType" isParam="true"&gt;jms&lt;/attribute&gt; &lt;attribute name="socket.check_connection" isParam="true"&gt;false&lt;/attribute&gt; &lt;attribute name="timeout" isParam="true"&gt;0&lt;/attribute&gt; &lt;attribute name="serverBindAddress"&gt;${jboss.bind.address}&lt;/attribute&gt; &lt;attribute name="serverBindPort"&gt;4657&lt;/attribute&gt; &lt;attribute name="leasePeriod"&gt;10000&lt;/attribute&gt; &lt;attribute name="clientSocketClass" isParam="true"&gt; org.jboss.jms.client.remoting.ClientSocketWrapper &lt;/attribute&gt; &lt;attribute name="serverSocketClass"&gt; org.jboss.jms.server.remoting.ServerSocketWrapper &lt;/attribute&gt; &lt;attribute name="numberOfRetries" isParam="true"&gt;1&lt;/attribute&gt; &lt;attribute name="numberOfCallRetries" isParam="true"&gt;1&lt;/attribute&gt; &lt;attribute name="clientMaxPoolSize" isParam="true"&gt;50&lt;/attribute&gt; &lt;/invoker&gt; &lt;handlers&gt; &lt;handler subsystem="JMS"&gt; org.jboss.jms.server.remoting.JMSServerInvocationHandler &lt;/handler&gt; &lt;/handlers&gt; &lt;/config&gt; ]]&gt;&lt;/attribute&gt; &lt;/delegate-config&gt; &lt;binding port="4657"/&gt; &lt;/service-config&gt; </programlisting> <warning><para> Certifique-se que a config (conforme acima) é idêntica àquela em <literal>remoting-bisocket-service.xml</literal>, sem nenhuma exceção do atual serverBindPort, do qual deve ser diferente para cada abrangência de portal. Perceba que o gerenciador binding do serviço do JBoss Messaging, do qual realiza o binding em <literal>sample-bindings.xml</literal> e lançado com o JBAS 4.2.0, está desatualizado e você precisará copiar a config a partir do <literal>remoting-bisocket-service.xml</literal> </para> </warning>. Você deverá ter certeza que cada nó é configurado para usar uma abrangência de portais diferentes.
zh_cn: 来看看 $JBOSS_HOME/docs/examples/binding-manager/sample-bindings.xml。对于每个端口范围，JBoss Remoting 配置都应该类似于：<programlisting> &lt;service-config name="jboss.messaging:service=Connector,transport=bisocket" delegateClass="org.jboss.services.binding.AttributeMappingDelegate"&gt; &lt;delegate-config&gt; &lt;attribute name="Configuration"&gt;&lt;![CDATA[ &lt;config&gt; &lt;invoker transport="bisocket"&gt; &lt;attribute name="marshaller" isParam="true"&gt; org.jboss.jms.wireformat.JMSWireFormat &lt;/attribute&gt; &lt;attribute name="unmarshaller" isParam="true"&gt; org.jboss.jms.wireformat.JMSWireFormat &lt;/attribute&gt; &lt;attribute name="dataType" isParam="true"&gt;jms&lt;/attribute&gt; &lt;attribute name="socket.check_connection" isParam="true"&gt;false&lt;/attribute&gt; &lt;attribute name="timeout" isParam="true"&gt;0&lt;/attribute&gt; &lt;attribute name="serverBindAddress"&gt;${jboss.bind.address}&lt;/attribute&gt; &lt;attribute name="serverBindPort"&gt;4657&lt;/attribute&gt; &lt;attribute name="leasePeriod"&gt;10000&lt;/attribute&gt; &lt;attribute name="clientSocketClass" isParam="true"&gt; org.jboss.jms.client.remoting.ClientSocketWrapper &lt;/attribute&gt; &lt;attribute name="serverSocketClass"&gt; org.jboss.jms.server.remoting.ServerSocketWrapper &lt;/attribute&gt; &lt;attribute name="numberOfRetries" isParam="true"&gt;1&lt;/attribute&gt; &lt;attribute name="numberOfCallRetries" isParam="true"&gt;1&lt;/attribute&gt; &lt;attribute name="clientMaxPoolSize" isParam="true"&gt;50&lt;/attribute&gt; &lt;/invoker&gt; &lt;handlers&gt; &lt;handler subsystem="JMS"&gt; org.jboss.jms.server.remoting.JMSServerInvocationHandler &lt;/handler&gt; &lt;/handlers&gt; &lt;/config&gt; ]]&gt;&lt;/attribute&gt; &lt;/delegate-config&gt; &lt;binding port="4657"/&gt; &lt;/service-config&gt; </programlisting> <warning><para> 你必须确保相关配置（如上）和 <literal>remoting-bisocket-service.xml</literal> 里的相同，除了实际的 serverBindPort 显然会有所不同。请注意 JBAS 4.2.0 带有的 <literal>sample-bindings.xml</literal> 里的缺省的 JBoss Messaging 服务的 binding manager 绑定已经过期，你需要从 <literal>remoting-bisocket-service.xml</literal> 里进行复制。</para> </warning> 你应该确保每个节点都使用不同的端口范围。

source: Extra steps to complete your installation
de_de: Weitere Schritte zur Fertigstellung Ihrer Installation
es_es: Pasos extra para completar su instalación
fr_fr: Etapes supplémentaires pour terminer votre installation
ja_jp: インストールを完了するための余分の手順
pt_br: Alguns outros passos para completar sua instalação
zh_cn: 完成安装所需的额外步骤

source: SECURITY RISK! To avoid a security risk, you MUST specify the value of the attribute SuckerPassword in the Server Peer config (messaging-service.xml). If you do not specify a value, the default value will be used. Any person that knows the default value will be able to access to all destinations on the server. The password chosen should only be exposed to administrators
de_de: SICHERHEITSRISIKO! Um Sicherheitsrisiken zu vermeiden, MÜSSEN Sie den Wert des Attributs SuckerPassword in Server Peer config (messaging-service.xml) festlegen.Falls Sie keinen Wert festlegen, so wird der Standardwert verwendet. Jede Person, die den Standardwert kennt kann auf sämtliche Destinationen auf dem Server zugreifen. Das gewählte Passwort sollte nur Administratoren zugänglich sein.
es_es: ¡RIESGO DE SEGURIDAD! Para evitar un riesgo de seguridad DEBE especificar el valor del atributo SuckerPassword en la configuración Server Peer (messaging-service.xml). Si no especifica un valor, se utilizará el valor predeterminado. Cualquier persona que conozca el valor predeterminado podrá acceder a todos los destinos en el servidor. La contraseña seleccionada sólo la debe conocer los administradores
fr_fr: SECURITY RISK! (RISQUE DE SECURITE) Afin d'éviter 'security risk', vous DEVEZ spécifier la valeur de l'attribut SuckerPassword dans la configuration du Server Peer (messaging-service.xml). Si vous ne spécifiez pas de valeur, on utilisera la valeur par défaut. Toute personne qui connaît la valeur par défaut sera en mesure d'accéder à toutes les destinations sur le serveur. Le mot de passe choisi ne devra être exposé qu'aux administrateurs
ja_jp: セキュリティリスク！：セキュリティリスクを回避する為に、属性 SuckerPassword の値を Server Peer config (messaging-service.xml) 内に指定しなければなりません。この値を 指定しないと、デフォルトの値が使用されます。そしてこのデフォルト値を知る誰もが このサーバーの全ての送り先へアクセスできるようになります。選択するパスワードは 管理者のみに知らせるべきです。
pt_br: SECURITY RISK! Para evitar o risco de segurança, você DEVE especificar o valor do atributo SuckerPassword no Server Peer config (messaging-service.xml). Caso você não especificar este valor, o valor padrão será usado. Qualquer pessoa que conhece o valor do padrão, estará apta a acessar todas as destinações do servidor. A senha escolhida deve ser passada apenas para administradores.
zh_cn: 安全风险！要避免安全风险，你必须在指定 Server Peer 配置（messaging-service.xml）里属性 SuckerPassword 的值。如果你没有进行指定，缺省值将被使用。任何知道缺省值的人都可以访问这台服务器上的所有目的地。只有管理员应该知道所指定的密码。

source: JBoss Messaging 1.4.0 requires a patched version of jboss-remoting.jar. This version is not available in the JBoss AS 4.2.0 or JBoss AS 4.2.1 distributions. The patched jar can be found <ulink url="http://repository.jboss.com/jboss/remoting/2.2.2.SP1-brew/lib/">here</ulink>. Please download it and copy it into the <literal>$JBOSS_HOME/server/&lt;your server name&gt;/lib directory</literal> of any server profiles that use JBoss Messaging 1.4.0. If you are using JBoss Messaging from a standalone client also make sure this jar is on your classpath *before* jbossall-client.jar.
de_de: JBoss Messaging 1.4.0 benötigt eine gepatchte Version der jboss-remoting.jar. Diese Version ist in den JBoss AS 4.2.0 oder JBoss AS 4.2.1 Distributionen nicht verfügbar. Die gepatchte jar finden Sie <ulink url="http://repository.jboss.com/jboss/remoting/2.2.2.SP1-brew/lib/">hier</ulink>. Bitte laden Sie sie herunter und kopieren Sie sie in das <literal>$JBOSS_HOME/server/&lt;your server name&gt;/lib directory</literal> sämtlicher Server-Profile, die JBoss Messaging 1.4.0 verwenden. Falls Sie JBoss Messaging von einem eigenständigen Client verwenden, so stellen Sie außerdem sicher, dass diese jar *vor* jbossall-client.jar in Ihrem Klassenpfad ist.
es_es: JBoss Messaging 1.4.0 requiere una versión modificada (con un parche) de jboss-remoting.jar. Esta versión no se encuentra disponible en las distribuciones JBoss AS 4.2.0 o JBoss AS 4.2.1. La jar modificada se puede encontrar en <ulink url="http://repository.jboss.com/jboss/remoting/2.2.2.SP1-brew/lib/">here</ulink>. Descárguela y copiéla en el <literal>$JBOSS_HOME/server/&lt;your server name&gt;/lib directory</literal> de cualquier perfil del servidor que use JBoss Messaging 1.4.0. Si está usando JBoss Messaging desde un cliente autónomo también asegúrese de que esta jar se encuentra en su ruta de clase *antes* jbossall-client.jar.
fr_fr: JBoss Messaging 1.4.0 requiert une version modifiée de jboss-remoting.jar. Cette version n'est pas disponible dans les distributions JBoss AS 4.2.0 ou JBoss AS 4.2.1 . On peut trouver le jar modifié dans <ulink url="http://repository.jboss.com/jboss/remoting/2.2.2.SP1-brew/lib/">here</ulink>. Veillez le décharger et le copier dans le <literal>$JBOSS_HOME/server/&lt;your server name&gt;/lib directory</literal> de n'importe quel profil de serveurs qui utilise JBoss Messaging 1.4.0. Si vous utilisez JBoss Messaging sur un client autonome, veiller à ce que ce jar soit sur le chemin de classe *avant* jbossall-client.jar.
ja_jp: JBoss Messaging 1.4.0 は jboss-remoting.jar のパッチ済みバージョンが必要に なります。このバージョンは JBoss AS 4.2.0 や JBoss AS 4.2.1 ディストリビューション からは入手できません。パッチ済み jar は <ulink url="http://repository.jboss.com/jboss/remoting/2.2.2.SP1-brew/lib/">ここ</ulink> で入手することができます。 これをダウンロードして、JBoss Messaging 1.4.0 を使用するいずれかのサーバープロフィールの <literal>$JBOSS_HOME/server/&lt;your server name&gt;/lib</literal> ディレクトリにコピーします。 単独型のクライアントから JBoss Messaging を使用している場合は、またこの jar が jbossall-client.jar の 前の使用 classpath にあることを確認してください
pt_br: O JBoss Messaging 1.4.0 solicita uma versão patched do jboss-remoting.jar. Esta versão não está disponível nas distribuições do JBoss AS 4.2.0 ou JBoss AS 4.2.1. A jarra patched pode ser encontrada em <ulink url="http://repository.jboss.com/jboss/remoting/2.2.2.SP1-brew/lib/">here</ulink>. Por favor realize o download e copie isto ao <literal>$JBOSS_HOME/server/&lt;your server name&gt;/lib directory</literal> de qualquer perfil do servidor que usa o JBoss Messaging 1.4.0. Caso você esteja usando o JBoss Messaging a partir de um cliente autônomo, certifique-se também que esta jarra está na sua classpath *antes* do jbossall-client.jar.
zh_cn: JBoss Messaging 1.4.0 要求 jboss-remoting.jar 的一个修订版本。这个版本不在 JBoss AS 4.2.0 或 JBoss AS 4.2.1 里。这个 jar 文件可以在<ulink url="http://repository.jboss.com/jboss/remoting/2.2.2.SP1-brew/lib/">这里</ulink>里找到。请下载这个文件并复制到任何使用 JBoss Messaging 1.4.0 的服务器配置的 <literal>$JBOSS_HOME/server/&lt;your server name&gt;/lib</literal> 目录里。如果你在独立的客户端里使用 JBoss Messaging，也请确保这个 jar 文件在 classpath 里位于 jbossall-client.jar ＊前面＊。
