Repository: bobmcwhirter/jboss-messaging
Catalog: docs/EAP_4_3/JBoss_Messaging_User_Guide/*/Installation.po
Languages: de_de, es_es, fr_fr, ja_jp, pt_br, zh_cn

source: Move <literal>$JBOSS_CONFIG/deploy/jms/hajndi-jms-ds.xml</literal> and <literal>$JBOSS_CONFIG/deploy/jms/jms-ra.rar</literal> to <literal>$JBOSS_CONFIG/deploy</literal>
de_de: Verschieben Sie <literal>$JBOSS_CONFIG/deploy/jms/hajndi-jms-ds.xml</literal> und <literal>$JBOSS_CONFIG/deploy/jms/jms-ra.rar</literal> nach <literal>$JBOSS_CONFIG/deploy</literal>
es_es: Mueva <literal>$JBOSS_CONFIG/deploy/jms/hajndi-jms-ds.xml</literal> y <literal>$JBOSS_CONFIG/deploy/jms/jms-ra.rar</literal> a <literal>$JBOSS_CONFIG/deploy</literal>
fr_fr: Déplacer <literal>$JBOSS_CONFIG/deploy/jms/hajndi-jms-ds.xml</literal> et <literal>$JBOSS_CONFIG/deploy/jms/jms-ra.rar</literal> vers <literal>$JBOSS_CONFIG/deploy</literal>
ja_jp: <literal>$JBOSS_CONFIG/deploy/jms/hajndi-jms-ds.xml</literal> と <literal>$JBOSS_CONFIG/deploy/jms/jms-ra.rar</literal> を <literal>$JBOSS_CONFIG/deploy</literal> に移動します。
pt_br: Mude <literal>$JBOSS_CONFIG/deploy/jms/hajndi-jms-ds.xml</literal> e <literal>$JBOSS_CONFIG/deploy/jms/jms-ra.rar</literal> para <literal>$JBOSS_CONFIG/deploy</literal>.
zh_cn: 把 <literal>$JBOSS_CONFIG/deploy/jms/hajndi-jms-ds.xml</literal> 和 <literal>$JBOSS_CONFIG/deploy/jms/jms-ra.rar</literal> 移至 <literal>$JBOSS_CONFIG/deploy</literal> 下。

source: Remove the old JBoss MQ by removing the directory <literal>$JBOSS_CONFIG/deploy/jms.</literal>
de_de: Entfernen Sie die alte JBoss MQ, indem Sie das Verzeichnis <literal>$JBOSS_CONFIG/deploy/jms.</literal> entfernen
es_es: Remueva el viejo JBoss MQ borrando el directorio <literal>$JBOSS_CONFIG/deploy/jms.</literal>
fr_fr: Retirer l'ancien JBoss MQ en retirant le répertoire <literal>$JBOSS_CONFIG/deploy/jms.</literal>
ja_jp: ディレクトリ <literal>$JBOSS_CONFIG/deploy/jms.</literal> を削除することにより、 旧式の JBoss MQ を取り除きます。
pt_br: Remova o antigo JBoss MQ, apenas removendo o diretório <literal>$JBOSS_CONFIG/deploy/jms.</literal>.
zh_cn: 通过删除 <literal>$JBOSS_CONFIG/deploy/jms.</literal> 目录来删除旧的 JBoss MQ。

source: Remove the old JBoss MQ jar file: <literal>$JBOSS_CONFIG/lib/jbossmq.jar</literal>
de_de: Entfernen Sie die alte JBoss MQ jar-Datei: <literal>$JBOSS_CONFIG/lib/jbossmq.jar</literal>
es_es: Remueva el viejo archivo jar JBoss MQ: <literal>$JBOSS_CONFIG/lib/jbossmq.jar</literal>
fr_fr: Retirer l'ancien fichier jar MQ JBoss de: <literal>$JBOSS_CONFIG/lib/jbossmq.jar</literal>
ja_jp: 旧式の JBoss MQ jar ファイル <literal>$JBOSS_CONFIG/lib/jbossmq.jar</literal> を取り除きます。
pt_br: Remova o arquivo de jarra JBoss MQ antigo: <literal>$JBOSS_CONFIG/lib/jbossmq.jar</literal>.
zh_cn: 删除旧的 JBoss MQ jar 文件：<literal>$JBOSS_CONFIG/lib/jbossmq.jar</literal>

source: Make sure you don't have any JBossMQ files under <literal>$JBOSS_CONFIG/deploy-hasingleton</literal>. For that just remove <literal>$JBOSS_CONFIG/deploy-hasingleton/jms</literal>
de_de: Vergewissern Sie sich, dass Sie keine JBossMQ-Dateien unter <literal>$JBOSS_CONFIG/deploy-hasingleton</literal> haben. Entfernen Sie dafür einfach <literal>$JBOSS_CONFIG/deploy-hasingleton/jms</literal>
es_es: Asegúrese de que no tenga ningún archivo JBossMQ bajo <literal>$JBOSS_CONFIG/deploy-hasingleton</literal>. Para eso simplemente borre <literal>$JBOSS_CONFIG/deploy-hasingleton/jms</literal>
fr_fr: Veillez à ce que vous n'ayez plus de fichiers JBossMQ dans <literal>$JBOSS_CONFIG/deploy-hasingleton</literal>. Pour cela, retirer <literal>$JBOSS_CONFIG/deploy-hasingleton/jms</literal>
ja_jp: <literal>$JBOSS_CONFIG/deploy-hasingleton</literal> の下方に JBossMQ ファイルが ないように確認して下さい。その為には、<literal>$JBOSS_CONFIG/deploy-hasingleton/jms</literal> を削除します。
pt_br: Tenha certeza que você não possui qualquer arquivo JBossMQ sob <literal>$JBOSS_CONFIG/deploy-hasingleton</literal>. Para isto, apenas remova o <literal>$JBOSS_CONFIG/deploy-hasingleton/jms</literal>.
zh_cn: 确保 <literal>$JBOSS_CONFIG/deploy-hasingleton</literal> 下没有任何 JBossMQ 文件。因此删除 <literal>$JBOSS_CONFIG/deploy-hasingleton/jms</literal> 就好了。

source: Add a security policy called "messaging" on $JBOSS_CONFIG/config/login-config.xml. You could use this as an example, or create one according to JBoss Security Documentation: <programlisting> &lt;application-policy name = "messaging"&gt; &lt;authentication&gt; &lt;login-module code = "org.jboss.security.auth.spi.UsersRolesLoginModule" flag = "required" &gt; &lt;module-option name = "unauthenticatedIdentity"&gt;guest&lt;/module-option&gt; &lt;module-option name = "usersProperties"&gt;props/messaging-users.properties&lt;/module-option&gt; &lt;module-option name = "rolesProperties"&gt;props/messaging-roles.properties&lt;/module-option&gt; &lt;/login-module&gt; &lt;/authentication&gt; &lt;/application-policy&gt; </programlisting> In case you are using the above policy you should also create files <literal>messaging-users.properties</literal> and <literal>messaging-roles.properties</literal> in the <literal>$JBOSS_CONFIG/config/props/</literal> directory. .
de_de: Fügen Sie eine Sicherheitsrichtlinie namens "messaging" in $JBOSS_CONFIG/config/login-config.xml hinzu. Sie können diese als ein Beispiel nehmen oder eine entsprechend der JBoss Security Documentation (JBoss Sicherheitsdokumentation) erstellen: <programlisting> &lt;application-policy name = "messaging"&gt; &lt;authentication&gt; &lt;login-module code = "org.jboss.security.auth.spi.UsersRolesLoginModule" flag = "required" &gt; &lt;module-option name = "unauthenticatedIdentity"&gt;guest&lt;/module-option&gt; &lt;module-option name = "usersProperties"&gt;props/messaging-users.properties&lt;/module-option&gt; &lt;module-option name = "rolesProperties"&gt;props/messaging-roles.properties&lt;/module-option&gt; &lt;/login-module&gt; &lt;/authentication&gt; &lt;/application-policy&gt; </programlisting> Falls Sie die obige Richtlinie verwenden, sollten Sie auch die Dateien <literal>messaging-users.properties</literal> und <literal>messaging-roles.properties</literal> im <literal>$JBOSS_CONFIG/config/props/</literal>-Verzeichnis erstellen.
es_es: Añada una política de seguridad llamada "messaging" en $JBOSS_CONFIG/config/login-config.xml. Puede utilizar esto como un ejemplo, o crear uno de acuerdo a la documentación de JBoss Security: <programlisting> &lt;application-policy name = "messaging"&gt; &lt;authentication&gt; &lt;login-module code = "org.jboss.security.auth.spi.UsersRolesLoginModule" flag = "required" &gt; &lt;module-option name = "unauthenticatedIdentity"&gt;guest&lt;/module-option&gt; &lt;module-option name = "usersProperties"&gt;props/messaging-users.properties&lt;/module-option&gt; &lt;module-option name = "rolesProperties"&gt;props/messaging-roles.properties&lt;/module-option&gt; &lt;/login-module&gt; &lt;/authentication&gt; &lt;/application-policy&gt; </programlisting> En el caso de que esté utilizando la política enterior también debe crear archivos <literal>messaging-users.properties</literal> y <literal>messaging-roles.properties</literal> en el directorio <literal>$JBOSS_CONFIG/config/props/</literal>. .
fr_fr: Ajouter une politique de sécurité intitulée "messaging" on $JBOSS_CONFIG/config/login-config.xml. Vous pouvez utiliser ce qui suit comme un exemple, ou bien en créer un à partir de la documentation JBoss security: <programlisting> &lt;application-policy name = "messaging"&gt; &lt;authentication&gt; &lt;login-module code = "org.jboss.security.auth.spi.UsersRolesLoginModule" flag = "required" &gt; &lt;module-option name = "unauthenticatedIdentity"&gt;guest&lt;/module-option&gt; &lt;module-option name = "usersProperties"&gt;props/messaging-users.properties&lt;/module-option&gt; &lt;module-option name = "rolesProperties"&gt;props/messaging-roles.properties&lt;/module-option&gt; &lt;/login-module&gt; &lt;/authentication&gt; &lt;/application-policy&gt; </programlisting> Dans le cas où vous utilisez la politique ci-dessus, vous devriez également créer les fichiers <literal>messaging-users.properties</literal> et <literal>messaging-roles.properties</literal> dans le répertoire <literal>$JBOSS_CONFIG/config/props/</literal>.
ja_jp: $JBOSS_CONFIG/config/login-config.xml に "messaging" と言うセキュリティポリシーを 追加します。以下を例として使用するか、又は JBoss Security Documentation に 従って、新規のものを作成することも出来ます: <programlisting> &lt;application-policy name = "messaging"&gt; &lt;authentication&gt; &lt;login-module code = "org.jboss.security.auth.spi.UsersRolesLoginModule" flag = "required" &gt; &lt;module-option name = "unauthenticatedIdentity"&gt;guest&lt;/module-option&gt; &lt;module-option name = "usersProperties"&gt;props/messaging-users.properties&lt;/module-option&gt; &lt;module-option name = "rolesProperties"&gt;props/messaging-roles.properties&lt;/module-option&gt; &lt;/login-module&gt; &lt;/authentication&gt; &lt;/application-policy&gt; </programlisting> 上記のポリシーを使用している場合、<literal>$JBOSS_CONFIG/config/props/</literal> ディレクトリ内に、 ファイル <literal>messaging-users.properties</literal> と ファイル <literal>messaging-roles.properties</literal> も作成する必要があります。
pt_br: Adicione a política de segurança chamada "messaging" no $JBOSS_CONFIG/config/login-config.xml. Você poderá usar este exemplo ou criar um novo exemplo de acordo com a Documentação de Segurança JBoss: <programlisting> &lt;application-policy name = "messaging"&gt; &lt;authentication&gt; &lt;login-module code = "org.jboss.security.auth.spi.UsersRolesLoginModule" flag = "required" &gt; &lt;module-option name = "unauthenticatedIdentity"&gt;guest&lt;/module-option&gt; &lt;module-option name = "usersProperties"&gt;props/messaging-users.properties&lt;/module-option&gt; &lt;module-option name = "rolesProperties"&gt;props/messaging-roles.properties&lt;/module-option&gt; &lt;/login-module&gt; &lt;/authentication&gt; &lt;/application-policy&gt; </programlisting> In case you are using the above policy you should also create files <literal>messaging-users.properties</literal> and <literal>messaging-roles.properties</literal> in the <literal>$JBOSS_CONFIG/config/props/</literal> directory. .
zh_cn: 在 $JBOSS_CONFIG/config/login-config.xml 里添加名为 "messaging" 的安全策略。你可以把这用作例子，或按照 JBoss Security 文档创建一个新的配置：<programlisting> &lt;application-policy name = "messaging"&gt; &lt;authentication&gt; &lt;login-module code = "org.jboss.security.auth.spi.UsersRolesLoginModule" flag = "required" &gt; &lt;module-option name = "unauthenticatedIdentity"&gt;guest&lt;/module-option&gt; &lt;module-option name = "usersProperties"&gt;props/messaging-users.properties&lt;/module-option&gt; &lt;module-option name = "rolesProperties"&gt;props/messaging-roles.properties&lt;/module-option&gt; &lt;/login-module&gt; &lt;/authentication&gt; &lt;/application-policy&gt; </programlisting> 如果你使用上述的策略，你也可以在 <literal>$JBOSS_CONFIG/config/props/</literal> 目录里创建文件 <literal>messaging-users.properties</literal> 和 <literal>messaging-roles.properties</literal>。

source: You can find an example <literal>messaging-users.properties</literal> and <literal>messaging-roles.properties</literal> in the JBoss Messaging distribution in the <literal>&lt;downloadPackage&gt;src/etc/server/default/config</literal> directory.
de_de: Sie finden Beispiele für <literal>messaging-users.properties</literal> und <literal>messaging-roles.properties</literal> in der JBoss Messaging Distribution im <literal>&lt;downloadPackage&gt;src/etc/server/default/config</literal>-Verzeichnis.
es_es: Puede encontrar un ejemplo <literal>messaging-users.properties</literal> y <literal>messaging-roles.properties</literal> en la distribución JBoss Messaging en el directorio <literal>&lt;downloadPackage&gt;src/etc/server/default/config</literal> directory.
fr_fr: Vous pourrez trouver un exemple dans <literal>messaging-users.properties</literal> et dans <literal>messaging-roles.properties</literal> dans la distribution JBoss Messaging située dans le répertoire <literal>&lt;downloadPackage&gt;src/etc/server/default/config</literal>.
ja_jp: JBoss Messaging ディストリビューションにある、<literal>&lt;downloadPackage&gt;src/etc/server/default/config</literal> ディレクトリでサンプルの <literal>messaging-users.properties</literal> と <literal>messaging-roles.properties</literal> を見つけることができます。
pt_br: Você poderá usar um exemplo <literal>messaging-users.properties</literal> e <literal>messaging-roles.properties</literal> na distribuição do JBoss Messaging no diretório <literal>&lt;downloadPackage&gt;src/etc/server/default/config</literal>.
zh_cn: 你可以在 <literal>&lt;downloadPackage&gt;src/etc/server/default/config</literal> 目录里的 JBoss Messaging 发行版本中找到 <literal>messaging-users.properties</literal> 和 <literal>messaging-roles.properties</literal> 示例。

source: Unzip jboss-messaging.sar from your download package into the directory <literal>JBOSS_CONFIG/deploy/jboss-messaging.sar</literal>. JBoss Messaging should be deployed unzipped (exploded) so you have easy access to its config files which are stored there.
de_de: Entzippen Sie jboss-messaging.sar aus Ihrem Download-Paket in das <literal>JBOSS_CONFIG/deploy/jboss-messaging.sar</literal>-Verzeichnis. JBoss Messaging sollte entzippt (ausgeklappt) entzippt werden, damit Sie bequemen Zugriff auf die dort gespeicherten config-Dateien haben.
es_es: Descomprima jboss-messaging.sar desde su paquete de descarga al directorio <literal>JBOSS_CONFIG/deploy/jboss-messaging.sar</literal>. JBoss Messaging se debe implementar sin comprimir de manera que tenga fácil acceso a sus archivos de configuración, los cuales se almacenan allí.
fr_fr: Décompresser jboss-messaging.sar de votre paquetage de déchargement dans le répertoire <literal>JBOSS_CONFIG/deploy/jboss-messaging.sar</literal>. JBoss Messaging devrait être déployé, décompressé (explosé) de façon à ce que vous puissiez avoir accès aux fichiers de configuration qui sont situés à l'intérieur.
ja_jp: ダウンロードしたパッケージから、ディレクトリ <literal>JBOSS_CONFIG/deploy/jboss-messaging.sar</literal> に jboss-messaging.sar を展開します。JBoss Messaging はそこに保存してある config ファイルに簡単にアクセス できるように、展開してデプロイする必要があります。
pt_br: Descomprima o jboss-messaging.sar a partir do seu pacote de download no diretório <literal>JBOSS_CONFIG/deploy/jboss-messaging.sar</literal>. O JBoss Messaging deve ser implementado descomprimido (separado), de forma que você terá acesso fácil a estes arquivos config dos quais estão armazenados.
zh_cn: 从下载的软件包里把 jboss-messaging.sar 解压至 <literal>JBOSS_CONFIG/deploy/jboss-messaging.sar</literal> 目录。JBoss Messaging 应该按非压缩模式（展开模式）部署，所以你可以轻易访问其配置文件。

source: Copy jboss-messaging.jar from your download package into the directory <literal>JBOSS_CONFIG/lib</literal>. jboss-messaging.jar needs to go in the lib directory so it is accessible to other services e.g. the JBoss Transactions Recovery Manager
de_de: Kopieren Sie jboss-messaging.jar aus Ihrem Download-Paket in das Verzeichnis <literal>JBOSS_CONFIG/lib</literal>. jboss-messaging.jar gehört in das lib-Verzeichnis, damit es anderen Diensten zugänglich ist, etwa dem JBoss Transactions Recovery Manager
es_es: Copieboss-messaging.jar desde su paquete descargado en el directorio <literal>JBOSS_CONFIG/lib</literal>. Es necesario que jboss-messaging.jar vaya en el directorio lib para que sea accesible a otros servicio, por ejemplo, el administrador de recuperación de transacciones de JBoss
fr_fr: Copier jboss-messaging.jar de votre paquetage de téléchargement dans le répertoire <literal>JBOSS_CONFIG/lib</literal>. jboss-messaging.jar doit aller dans le répertoire lib, de façon à ce qu'il puisse être accessible aux autres services par ex. au gestionnaire JBoss Transactions Recovery Manager
ja_jp: ダウンロードしたパッケージから jboss-messaging.jar をディレクトリ <literal>JBOSS_CONFIG/lib</literal> に コピーします。jboss-messaging.jar は、lib ディレクトリに入れて、JBoss Transactions Recovery Manager のような 他のサービスがアクセスできるようにする必要があります。
pt_br: Copie jboss-messaging.jar a partir de seu pacote download em um diretório <literal>JBOSS_CONFIG/lib</literal>. O jboss-messaging.jar precisa entrar no laboratório lib, de forma que ele seja acessível a outros serviços, por exemplo: o Gerenciador de recuperação de Transações JBoss.
zh_cn: 从下载的软件包里把 jboss-messaging.jar 复制到 <literal>JBOSS_CONFIG/lib</literal> 里。jboss-messaging.jar 必须存放在 lib 目录下，这样才能被其他访问（如 JBoss Transactions Recovery Manager）所访问。

source: Configure a JCA datasource using an example from <literal>$JBOSS_HOME/docs/examples/jca</literal> and copying to <literal>$JBOSS_CONFIG/deploy</literal>. JBoss Messaging uses <literal>DefaultDS</literal> by default so you should configure your datasource to bind to that
de_de: Konfigurieren Sie eine JCA-Datenquelle unter Verwendung eines Beispiels aus <literal>$JBOSS_HOME/docs/examples/jca</literal> und kopieren Sie in <literal>$JBOSS_CONFIG/deploy</literal>. JBoss Messaging verwendet standardmäßig <literal>DefaultDS</literal>, daher sollten Sie Ihre Datenquelle so konfigurieren, dass Sie dort anbindet
es_es: Configure una fuente de datos JCA utilizando un ejemplo de <literal>$JBOSS_HOME/docs/examples/jca</literal> y copiela en <literal>$JBOSS_CONFIG/deploy</literal>. JBoss Messaging usa <literal>DefaultDS</literal> por defecto así que debe configurar su fuente de datos para vincularse a esa
fr_fr: Configurer une source de données JCA en utilisant une exemple dans <literal>$JBOSS_HOME/docs/examples/jca</literal> et en le copiant dans <literal>$JBOSS_CONFIG/deploy</literal>. JBoss Messaging utilise <literal>DefaultDS</literal> par défaut, donc vous devrez configurer votre source de données pour vous y conformer
ja_jp: <literal>$JBOSS_HOME/docs/examples/jca</literal> からのサンプルを使用して、JCA datasource を 設定して、<literal>$JBOSS_CONFIG/deploy</literal> へコピーします。JBoss Messaging は デフォルトで <literal>DefaultDS</literal> を使用するため、それにバインドするように 使用する datasource を設定する必要があります。
pt_br: Configure um banco de dados JCA usando o exemplo a partir do <literal>$JBOSS_HOME/docs/examples/jca</literal> e copiando para <literal>$JBOSS_CONFIG/deploy</literal>. O JBoss Messaging usa o <literal>DefaultDS</literal> por padrão, de maneira que você deverá configurar seu banco de dados para ser vinculado a isto.
zh_cn: 用 <literal>$JBOSS_HOME/docs/examples/jca</literal> 里的例子配置 JCA 数据源并将其复制到 <literal>$JBOSS_CONFIG/deploy</literal> 里。JBoss Messaging 缺省使用 <literal>DefaultDS</literal>，所以你应该使你的数据源和它绑定。

source: Ensure the <literal>ServerPeerID</literal> MBean attribute value in messaging-service.xml is unique for each node on the cluster. The <literal>ServerPeerID</literal> value must be a valid integer.
de_de: Vergewissern Sie sich, dass der <literal>ServerPeerID</literal> MBean Attributwert in messaging-service.xml für jeden Node des Clusters eindeutig ist. Beim <literal>ServerPeerID</literal>-Wert muss es sich um eine gültige ganze Zahl handeln.
es_es: Aegúrese de que el valor del atributo MBean <literal>ServerPeerID</literal> en messaging-service.xml es único para cada nodo en el clúster. El valor <literal>ServerPeerID</literal> debe ser un número entero válido.
fr_fr: Veillez à ce que la valeur de l'attribut MBean <literal>ServerPeerID</literal> dans messaging-service.xml soit bien unique dans chaque noeud du groupement. La valeur de <literal>ServerPeerID</literal> doit être une entier relatif valide.
ja_jp: messaging-service.xml 内の <literal>ServerPeerID</literal> MBean 属性の値が クラスター上の各ノード毎に特有であることを確認します。<literal>ServerPeerID</literal> の 値は有効な整数でなければなりません。
pt_br: Tenha certeza de que o valor do atributo MBean da <literal>ServerPeerID</literal> em messaging-service.xml e exclusivo para cada nó no cluster. O valor da <literal>ServerPeerID</literal> deve ser um número válido.
zh_cn: 确保 messaging-service.xml 里的 <literal>ServerPeerID</literal> MBean 属性值对于每个节点而言都是唯一的。<literal>ServerPeerID</literal> 必须是有效的整型值。
