Repository: bobmcwhirter/jboss-messaging
Catalog: docs/EAP_4_3/JBoss_Messaging_User_Guide/*/Installation.po
Languages: de_de, es_es, fr_fr, ja_jp, pt_br, zh_cn

source: JBoss Messaging Installation
es_es: Instalación de JBoss Messaging
fr_fr: Installation JBoss Messaging
ja_jp: JBoss Messaging のインストール
pt_br: Instalação do JBoss Messaging
zh_cn: 安装 JBoss Messaging

source: JBoss Messaging is shipped within JBoss Enterprise Application Platform 4.3. So if you are using JBoss Enterprise Application Platform 4.3, you can ignore this section on installation.
de_de: JBoss Messaging wird mit der JBoss Enterprise Application Platform 4.3 geliefert. Wenn Sie also die JBoss Enterprise Application Platform 4.3 verwenden, so können Sie diesen Abschnitt zur Installation überspringen.
es_es: JBoss Messaging se envía dentro de JBoss Enterprise Application Platform 4.3. Así que si está utilizando JBoss Enterprise Application Platform 4.3, puede ignorar esta sección en la instalación.
fr_fr: JBoss Messaging comprend la plate-forme JBoss Enterprise Application Platform 4.3. Donc, si vous utilisez la plate-forme JBoss Enterprise Application Platform 4.3, vous pouvez ignorer cette section pour la phase d'installation.
ja_jp: JBoss Messaging は JBoss Enterprise Application Platform 4.3 内に収納した状態で 配布されています。ですから JBoss Enterprise Application Platform 4.3 を使用している 場合は、このインストールのセクションは無視して下さい。
pt_br: O JBoss Messaging foi lançado com a Plataforma de Aplicativo do JBoss Enterprise 4.3. Desta forma, caso você esteja utilizando a Plataforma de Aplicativo do JBoss Enterprise 4.3, você poderá ignorar esta seção na instalação.
zh_cn: JBoss 企业级应用程序平台 4.3 里带有 JBoss Messaging。所以，如果你在使用 JBoss 企业级应用程序平台 4.3，那么你可以忽略本节。

source: This section describes procedures on how to install JBoss Messaging into JBoss AS. At the end of this procedure, you will create a JBoss Messaging configuration that will start a clustered or non-clustered messaging server.
de_de: Dieser Abschnitt beschreibt Vorgehensweisen zur Installation von JBoss Messaging in JBoss AS. Am Ende werden Sie eine JBoss Messaging Konfiguration erstellen, die einen geclusterten oder nicht geclusterten Messaging Server startet.
es_es: Esta sección describe los procedimientos sobre cómo instalar JBoss Messaging en JBoss AS. Al final de este procedimiento creará una configuración de JBoss Messaging que iniciará en un servidor de mensajes sin clústers o con ellos.
fr_fr: Cette section décrit la procédure sur la façon d'installer JBoss Messaging dans JBoss AS. A la fin de l'installation, vous aurez créé une configuration JBoss Messaging qui démarrera un serveur de messagerie groupé ou non groupé.
ja_jp: このセクションでは、JBoss Messaging を JBoss AS にインストールする方法を 説明しています。この手順の後で、クラスター化の、又はクラスター化に対応していないメッセージングサーバーを開始する JBoss Messaging 設定を作成します。
pt_br: Esta seção descreve procedimentos de como instalar o JBoss Messaging no JBoss AS. No final deste procedimento, você criará uma configuração do JBoss Messaging que inicializará um servidor de mensagem com ou sem cluster.
zh_cn: 本节描述在 JBoss AS 里安装 JBoss Messaging 的过程。在这个过程的最后，你将创建一个 JBoss Messaging 配置来启动群集或非群集的消息服务器。

source: By default, JBoss AS 4 ships with JBossMQ as default JMS provider. In order to use the JBoss AS instance with JBoss Messaging, you need to perform the installation procedure described below.
de_de: Standardmäßig wird mit JBoss AS 4 mit JBossMQ als standardmäßigem JMS Provider geliefert. Um die JBoss AS Instanz mit JBoss Messaging zu verwenden, müssen Sie den unten beschriebenen Installationsprozess durchführen.
es_es: Por defecto, JBoss AS 4 se envía con JBossMQ como proveedor JMS predeterminado. Con el fin de utilizar la instacia JBoss AS con JBoss Messaging necesita realizar el procedimiento de instalación que describimos a continuación.
fr_fr: Par défaut, JBoss AS 4 est proposé avec JBossMQ en tant que provider JMS par défaut. Pour utiliser l'instance JBoss AS avec JBoss Messaging, vous avez besoin d'exécuter la procédure d'installation décrite ci-dessous.
ja_jp: デフォルトで JBoss AS 4 は、デフォルト JMS プロバイダーとしての JBossMQ と共に 配布されています。JBoss Messaging と一緒に JBoss AS インスタンスを使用するには、 以下に説明してあるインストールの手順を実行する必要があります。
pt_br: Por padrão, o JBoss AS lança pelo JBossMQ o provedor JMS padrão. Você precisará executar o procedimento de instalação descrito abaixo, com a finalidade de se utilizar a instância JBoss AS com o JBoss Messaging:
zh_cn: 在缺省情况下，JBoss AS 4 带有作为缺省 JMS 提供者的 JBossMQ。为了使用带有 JBoss Messaging 的 JBoss AS 实例，你需要执行下面所述的过程。

source: A JBossMQ and a JBoss Messaging instance cannot coexist, at least not unless special precautions are taken. Do not simply attempt to copy the Messaging release artifact <filename>jboss-messaging.sar</filename> over to the JBoss instance w <filename>deploy</filename> directory. Follow one of the alternate installation procedures outlined below instead.
de_de: Eine JBossMQ und eine JBoss Messaging Instanz können nicht koexistieren, zumindest nicht, ohne dass bestimmte Vorkehrungen getroffen werden. Versuchen Sie nicht, das Messaging Release Artifact <filename>jboss-messaging.sar</filename> einfach zur JBoss Instanz w <filename>deploy</filename>-Verzeichnis hinüber zu kopieren. Folgen Sie stattdessen einer der nachfolgend beschriebenen Vorgehensweisen zur Installation.
es_es: Una instancia de JBossMQ y otra de JBoss Messaging no pueden coexistir, por lo menos no a menos de que tome precauciones especiales. No intente simplemente copiar el artefacto de lanzamiento de Messaging <filename>jboss-messaging.sar</filename> en la instancia JBoss w del directorio <filename>deploy</filename> directory. En su lugar siga uno de los procedimientos de instalación alternos que describimos a continuación.
fr_fr: Une instance JBossMQ et JBoss Messagingne peuvent pas coexister, en tous cas, pas avant de prendre certaines précautions. N'essayez pas simplement de copier une artéfact de mise à jour Messaging <filename>jboss-messaging.sar</filename> sur une instance JBoss dans le répertoire d'instances <filename>deploy</filename>. Suivre une procédure d'installation alternative précisée ci-dessous à la place.
ja_jp: JBossMQ と JBoss Messaging インスタンスは共存することが出来ません。少なくとも、 特別な事前設定がなければ出来ません。Messaging リリースの加工品 <filename>jboss-messaging.sar</filename> を 単純に JBoss インスタンス <filename>deploy</filename> ディレクトリにコピーを試みないで下さい。 その代わりに、以下に概要を示してある他のインストール法の１つに従って下さい。
pt_br: Um JBossMQ e uma instância JBoss Messaging não podem coexistir, a não ser que cuidados sejam tomados. Não é recomendável copiar artefatos de liberação Messaging <filename>jboss-messaging.sar</filename> no w de instância JBoss de diretório <filename>deploy</filename>. Segue abaixo, uma das alternativas de procedimentos de instalação esboçada:
zh_cn: JBossMQ 和 JBoss Messaging 实例不能并存，至少在没有采取特殊预防措施时是这样的。请不要简单地把 Messaging 的 <filename>jboss-messaging.sar</filename> 复制到 JBoss 的 <filename>deploy</filename> 目录里。请按照下面的安装过程之一进行安装。

source: We only recommend and support installing JBoss Messaging in JBoss AS 4.2 or later. You should avoid using JBoss Messaging on any version of JBoss AS prior to JBoss 4.2.0.GA, such as 4.0.5.GA and 4.0.4.GA.
de_de: Wir empfehlen nur und bieten auch nur Support für die Installation von JBoss Messaging in JBoss AS 4.2 oder späterer Version. Sie sollten die Verwendung von JBoss Messaging bei Versionen von JBoss AS die älter als JBoss 4.2.0.GA sind - etwa 4.0.5.GA und 4.0.4.GA - vermeiden.
es_es: Sólo recomendamos y soportamos instalar JBoss Messaging en JBoss AS 4.2 o versiones posteriores. Debe evitar el utilizar JBoss Messaging en cualquier versión de JBoss AS previa a JBoss 4.2.0.GA, tal como 4.0.5.GA y 4.0.4.GA.
fr_fr: Nous recommandons et prêtons notre support à l'installation de JBoss Messaging dans JBoss AS 4.2 ou versions supérieures uniquement. Vous devez éviter d'utiliser JBoss Messaging sur n'importe quelle version de JBoss AS précédant JBoss 4.2.0, comme 4.0.5.GA ou 4.0.4.GA.
ja_jp: 弊社では、JBoss AS 4.2 又はそれ以降への JBoss Messaging のインストールのみを推奨し サポートします。4.0.5.GA や 4.0.4.GA などの JBoss 4.2.0.GA 以前の JBoss AS の バージョンでの JBoss Messaging の使用は避けるべきです。
pt_br: Nós apenas recomendamos e suportamos a instalação do JBoss Messaging no JBoss AS 4.2, ou versões mais atualizadas. Você deverá evitar o uso do JBoss Messaging em qualquer versão do JBoss AS antes do JBoss 4.2.0.GA, tais como 4.0.5.GA e 4.0.4.GA.
zh_cn: 我们只推荐和支持在 JBoss AS 4.2 或更高版本里安装 JBoss Messaging。你应该避免在 JBoss 4.2.0.GA之前的版本里使用 JBoss Messaging，如 4.0.5.GA 和 4.0.4.GA。

source: JBoss Messaging is built against the JBoss AS 4.2 libraries which are built using Java 5. Therefore JBoss Messaging only runs with Java 5 or later.
de_de: Der Build von JBoss Messaging entspricht JBoss AS 4.2 Bibliotheken, die unter Verwendung von Java 5 erstellt wurden. Daher funktioniert JBoss Messaging nur mit Java 5 oder später.
es_es: JBoss Messaging se construye frente a las bibliotecas de JBoss AS 4.2 las cuales se construyen utilizando Java 5. Por lo tanto JBoss Messaging sólo ejecuta con Java 5 o posteriores.
fr_fr: JBoss Messaging est construit à partir des bibliothèques JBoss AS 4.2, elles-mêmes contruites en utilisant Java 5. De ce fait, JBoss Messaging ne peut être exécuté qu'avec JAva 5 ou versions supérieures.
ja_jp: JBoss Messaging は Java 5 を使用して構築された JBoss AS 4.2 ライブラリに対して 構築されています。そのため、JBoss Messaging は Java 5 かそれ以降でのみ動作します。
pt_br: O JBoss Messaging é construído baseado nas bibliotecas do JBoss AS 4.2, das quais são construídas usando o Java 5. Portanto, o JBoss Messaging apenas roda com o Java 5 ou versões mais avançadas.
zh_cn: JBoss Messaging 是按照基于 Java 5 的 JBoss AS 4.2 的类库进行构建的。因此，JBoss Messaging 只能在 Java 5 或更新版本里运行。

source: Installing JBoss Messaging on JBoss AS 4.2
de_de: Installation von JBoss Messaging auf JBoss AS 4.2
es_es: Instalación de JBoss Messaging en JBoss AS 4.2
fr_fr: Installer JBoss Messaging sur JBoss AS 4.2
ja_jp: JBoss AS 4.2 上に JBoss Messaging のインストール
pt_br: Instalação do JBoss Messaging no JBoss AS 4.2
zh_cn: 在 JBoss AS 4.2 里安装 JBoss Messaging

source: In this section we present two different methods of installing JBoss Messaging in JBoss AS 4.2
de_de: In diesem Abschnitt stellen wir zwei verschiedene Methoden der Installation von JBoss Messaging in JBoss AS 4.2
es_es: En esta sección vamos a presentar dos métodos diferentes de instalar JBoss Messaging en JBoss AS 4.2
fr_fr: Dans cette section, nous présentons deux méthodes différentes pour installer JBoss Messaging dans JBoss AS 4.2
ja_jp: このセクションでは、JBoss AS 4.2 に JBoss Messaging をインストールするための ２つの異なる方法を示しています。
pt_br: Nesta seção, apresentaremos dois métodos diferentes de instalação do JBoss Messaging no JBoss AS 4.2.
zh_cn: 本节我们将介绍在 JBoss AS 4.2 里安装 JBoss Messaging 的两种不同的方法。

source: If you have a completely clean JBoss AS 4.2.0 installation then you can do an <xref linkend="install.automated"/>automatic install
de_de: Falls Sie eine völlig reine JBoss AS 4.2.0 Installation besitzen, so können Sie eine <xref linkend="install.automated"/>automatische Installation durchführen
es_es: Si tiene una instalación completamente limpia de JBoss AS 4.2.0 entonces puede realizar una instalación automática <xref linkend="install.automated"/>
fr_fr: Si vous possédez une installation propre de JBoss AS 4.2.0, alors vous pouvez effectuer une installation automatique <xref linkend="install.automated"/>
ja_jp: 完全無変更の JBoss AS 4.2.0 インストールがある場合、<xref linkend="install.automated"/> 自動インストールを実行することができます。
pt_br: Caso você tenha completado a instalação do JBoss AS 4.2.0 limpa, então você poderá realizar uma instalação automática <xref linkend="install.automated"/>.
zh_cn: 如果你有一个全新的 JBoss AS 4.2.0 安装，你可以进行自动安装：<xref linkend="install.automated"/>。

source: If you have a JBoss 4.2.0 that you have changed in some way from a clean JBoss AS 4.2.0 installation then you will need to do a <xref linkend="install.manual"/>manual install
de_de: Wurde Ihr JBoss 4.2.0 irgendwie verändert und ist keine reine JBoss AS 4.2.0 Installation mehr, so müssen Sie eine <xref linkend="install.manual"/>manuelle Installation durchführen
es_es: Si tiene JBoss 4.2.0 y lo ha cambiado de alguna manera y por lo tanto no es una instalación limpia de JBoss AS 4.2.0 entonces necesitará realizar una instalación manual <xref linkend="install.manual"/>
fr_fr: Si vous possédez un JBoss 4.2.0 que vous avez quelque peu modifié par rapport à une installation JBoss AS 4.2.0, alors vous aurez besoin d'effectuer une installation manuelle <xref linkend="install.manual"/>
ja_jp: デフォルト状態の JBoss AS 4.2.0 インストールにいくらかの変更をした JBoss 4.2.0 がある場合、<xref linkend="install.manual"/> 手動インストールを する必要があります。
pt_br: Caso você possua um JBoss 4.2.0, do qual você tenha modificado de alguma forma na instalação do JBoss AS 4.2.0 limpa, então você precisará realizar uma instalação manual <xref linkend="install.manual"/>.
zh_cn: 如果你安装的 JBoss 4.2.0 已经被修改过了，你需要进行手工安装 <xref linkend="install.manual"/>。

source: Automated Installation
de_de: Automatisierte Installation
es_es: Instalación automatizada
fr_fr: Installation automatique
ja_jp: 自動化したインストール
pt_br: Instalação Automática
zh_cn: 自动安装

source: This procedure should only be performed from a clean JBoss AS 4.2 installation. If you have modifed the JBoss AS 4.2 installation at all since installation then you will need to perform a manual clustered JBoss Messaging installation
de_de: Dieser Vorgang sollte nur von einer unveränderten JBoss AS 4.2 Installation aus durchgeführt werden.Falls Sie die JBoss AS 4.2 Installation seit der Installation auf irgendeine Weise verändert haben, werden Sie eine manuelle geclusterte JBoss Messaging Installation durchführen müssen
es_es: Este procedimiento sólo se debe realizar desde una instalación limpia de JBoss AS 4.2. Si ha modificado la instalación JBoss AS 4.2 entonces necesitará realizar una instalación manual de JBoss Messaging en clústers.
fr_fr: Cette procédure ne devrait être exécutée qu'à partir d'une installation JBoss AS 4.2 propre. Si vous avez quelque peu modifié l'installation JBoss AS 4.2 depuis son installation, alors vous aurez besoin d'effectuer une installation manuelle groupée de JBoss Messaging.
ja_jp: この手順は無変更の JBoss AS 4.2 インストールからのみ実行するものです。 インストール後に少しでも JBoss AS 4.2 インストールに変更を加えた場合は、 手動のクラスター化 JBoss Messaging インストールを実行する必要があります。
pt_br: Este procedimento deveria apenas ser executado a partir de uma instalação JBoss AS 4.2 limpa. Caso você tenha modificado uma instalação JBoss AS 4.2 desde a instalação, então você precisará executar uma instalação manual do JBoss Messaging com cluster.
zh_cn: 这个过程应该在全新的 JBoss AS 4.2 安装上进行。如果在安装后你已经修改了 JBoss AS 4.2，你需要执行手工的群集安装。

source: Set up the <literal>JBOSS_HOME</literal> environment variable to point to the JBoss 4.2 installation you want to use JBoss Messaging with.
de_de: Stellen Sie die <literal>JBOSS_HOME</literal>-Umgebungsvariable so ein, dass Sie auf die JBoss 4.2 Installation weist, mit der Sie JBoss Messaging verwenden möchten.
es_es: Configure la variable de entorno <literal>JBOSS_HOME</literal> para que apunte a la instalación JBoss 4.2 con la que quiere utilizar JBoss Messaging.
fr_fr: Configurer la variable d'environnement <literal>JBOSS_HOME</literal> pour pointer vers l'installation JBoss 4.2 que vous souhaitez utiliser en conjonction avec JBoss Messaging.
ja_jp: <literal>JBOSS_HOME</literal> 環境変数を、JBoss Messaging と共に使用する JBoss 4.2 インストールにポイントするように設定します。
pt_br: Configure a variável do ambiente <literal>JBOSS_HOME</literal> para o ponto de instalação do JBoss 4.2, que você deseje utilizar com o JBoss Messaging.
zh_cn: 设置 <literal>JBOSS_HOME</literal> 环境变量，使其指向 JBoss Messaging 所在的 JBoss 4.2 的安装位置。

source: Run the installation script, available in the <filename>util</filename> directory of the release bundle as follows:
de_de: Führen Sie das im <filename>util</filename>-Verzeichnis des Release-Bündels verfügbare Installationskript wie folgt aus:
es_es: Ejecute el script de instalación disponible en el directorio <filename>util</filename> del lanzamiento así:
fr_fr: Exécuter le script d'installation, disponible dans le répertoire <filename>util</filename> du paquet de mise à jour comme suit:
ja_jp: 以下のようにして、リリースバンドルの <filename>util</filename> ディレクトリにある インストールスクリプトを実行します:
pt_br: Rode o script de instalação disponível no diretório <filename>util</filename> no agrupamento de liberação, conforme segue abaixo:
zh_cn: 运行发行版本中 <filename>util</filename> 目录里的安装脚本：

source: If you want to create a simple non clustered installion based on the default configuration:
de_de: Falls Sie basierend auf der Standardkonfiguration eine einfache, nicht geclusterte Installation erstellen möchten:
es_es: Si quiere crear una instalación simple sin clústers con base en la configuración predeterminada:
fr_fr: Si vous souhaitez créer une installation simple non clusterisée, basée sur la configuration par défaut:
ja_jp: デフォルト設定を基にした簡単なクラスター化に対応していないインストールを作成したい場合は 次のようにします:
pt_br: Caso você deseje criar uma simples instalação sem cluster baseada na configuração padrão, siga o exemplo abaixo:
zh_cn: 如果你想创建简单的基于 default 配置的非群集的安装：

source: If you want to create a clustered installation based on the all configuration or change the configuration name:
de_de: Falls Sie basierend auf der "all" Konfiguration eine geclusterte Installation erstellen oder den Konfigurationsnamen ändern möchten:
es_es: Si quiere crear una instalación con clústers con base en la configuración all o cambiar el nombre de la configuración:
fr_fr: Si vous souhaitez créer une installation groupée, basée sur la configuration globale ou si vous souhaitez changer le nom de la configuration:
ja_jp: 全ての設定を基にして、あるいは設定名を変更してクラスター化インストールを 作成したい場合は次のようにします:
pt_br: Caso você queira criar uma instalação com cluster baseada em todas as configurações ou mudar o nome da configuração, utilize o exemplo abaixo:
zh_cn: 如果你想创建基于 all 配置的群集配置或需要修改配置名称：

source: In the above you would substitute <literal>messaging-node0</literal> with whatever is the name you want to give the configuration. If you want several cluster nodes on the same machine, e.g. for development purposes then a good convention is to name them <literal>messaging-node0, messaging-node1</literal> to match <literal>messaging-node&lt;ServerPeerID&gt;</literal>
de_de: Oben würden Sie <literal>messaging-node0</literal> durch den Namen ersetzen, den Sie der Konfiguration geben möchten. Falls Sie mehrere Cluster Nodes auf derselben Maschine haben möchten, etwa zu Entwicklungszwecken, so empfiehlt sich die Namensgebung nach dem Schema <literal>messaging-node0, messaging-node1</literal> zur Übereinstimmung mit <literal>messaging-node&lt;ServerPeerID&gt;</literal>
es_es: En el anterior substituiría <literal>messaging-node0</literal> con cualquiera que sea el nombre que quiera darle a la configuración. Si quiere varios nodos clúster en la misma máquina, por ejemplo, para propósitos de desarrollo entonces una buena convención es nombrarlos <literal>messaging-node0, messaging-node1</literal> para que coincida con <literal>messaging-node&lt;ServerPeerID&gt;</literal>
fr_fr: Vous devez, ci-dessus, substituer <literal>messaging-node0</literal> par le nom de la configuration que vous souhaitez lui donner. Si vous souhaitez plusieurs noeuds de groupements sur la même machine, par ex. dans des buts de développement, alors il existe une bonne convention qui consiste à les appeler <literal>messaging-node0, messaging-node1</literal> to match <literal>messaging-node&lt;ServerPeerID&gt;</literal>
ja_jp: 上記では、<literal>messaging-node0</literal> の部分をこの設定に与えたい名前で 入れ替えます。例えば、開発目的などで同じマシン上に数種のクラスターノードを持ちたい 場合は、適切な慣例としてそれらを <literal>messaging-node&lt;ServerPeerID&gt;</literal> に 合わせて <literal>messaging-node0, messaging-node1</literal> と命名するのが良いでしょう。
pt_br: No exemplo acima, você deveria substituir a <literal>messaging-node0</literal> com o nome em que você deseja usar a configuração. Caso você deseje diversos nós de cluster na mesma máquina, por exemplo: para fins de desenvolvimento, então uma excelente emenda será nomeá-los <literal>messaging-node0, messaging-node1</literal>, de forma que coincidam com <literal>messaging-node&lt;ServerPeerID&gt;</literal>.
zh_cn: 你可以用任何名称替换 <literal>messaging-node0</literal> 来为配置命名。如果你想在同一台主机上运行多个群集节点（如处于开发目的），使用 <literal>messaging-node&lt;ServerPeerID&gt;</literal>（如 <literal>messaging-node0, messaging-node1</literal>）是个不错的命名规则。

source: The messaging.config.source variable determines which JBoss AS configuration (e.g. default or all) to base the installation on
de_de: Die messaging.config.source Variable bestimmt, auf welcher JBoss AS Konfiguration (d.h. "default" oder "all") die Installation basiert wird
es_es: La variable messaging.config.source determina sobre cual instalación se debe basar la configuración JBoss AS (por ejemplo, all o la predeterminada)
fr_fr: La variable messaging.config.source détermine sur quelle configuration JBoss AS ( par ex. la configuration par défaut ou configuration complète) baser l'installation.
ja_jp: messaging.config.source 変数はインストールが土台とする JBoss AS 設定 （例：デフォルトか全て）を決定します。
pt_br: A variável messaging.config.source determina qual configuração do JBoss AS (por exemplo: padrão ou total) deve ser a base da instalação.
zh_cn: messaging.config.source 变量指定了安装基于哪个 JBoss AS 配置（如 default 或 all）。

source: The installation script will create a <filename>$JBOSS_HOME/server/messaging-node0</filename> configuration. (If you have chosen <literal>messaging-node0</literal>)
de_de: Das Installationsskript erstellt eine <filename>$JBOSS_HOME/server/messaging-node0</filename>-Konfiguration. (Falls Sie <literal>messaging-node0</literal> gewählt haben)
es_es: El script de instalación creará una configuración <filename>$JBOSS_HOME/server/messaging-node0</filename> (si escogió <literal>messaging-node0</literal>)
fr_fr: Le script d'installation va créer une configuration <filename>$JBOSS_HOME/server/messaging-node0</filename>. (Si vous avez choisi <literal>messaging-node0</literal>)
ja_jp: インストールスクリプトは <filename>$JBOSS_HOME/server/messaging-node0</filename> 設定を作成します（<literal>messaging-node0</literal> を選択している場合）。
pt_br: O script de instalação será criado para a configuração <filename>$JBOSS_HOME/server/messaging-node0</filename>. (Caso você tenha escolhido <literal>messaging-node0</literal>.)
zh_cn: 安装脚本将创建一个 <filename>$JBOSS_HOME/server/messaging-node0</filename> 配置（如果你已经选择了 <literal>messaging-node0</literal> 这种命名方式）。

source: For the rest of the procedure we assume JBOSS_CONFIG refers to your new messaging configuration (e.g. messaging-node0 or messaging)
de_de: Für die verbleibende Zeit gehen wir davon aus, dass JBOSS_CONFIG sich auf Ihre neue Messaging Konfiguration bezieht (z.B. messaging-node0 oder messaging)
es_es: Para el resto del procedimiento asumimos que JBOSS_CONFIG se refiere a su nueva configuración de mensajes (por ejemplo, messaging-node0 o messaging)
fr_fr: Pour le reste de la procédure, nous assumons que JBOSS_CONFIG fera référence à votre nouvelle configuration de messagerie (par. ex. messaging-node0 ou messaging)
ja_jp: 残りの手順では、JBOSS_CONFIG がユーザーの新規メッセージング設定 （例：messaging-node0 又は messaging）を参照すると想定しています。
pt_br: Para o resto do procedimento, assumimos que o JBOSS_CONFIG relata a sua nova configuração de mensagem (por exemplo: messaging-node0 ou messaging).
zh_cn: 在安装过程里，我们将假设 JBOSS_CONFIG 指的是新的配置名称（如 messaging-node0 或 messaging）。
