Repository: bobmcwhirter/jboss-messaging
Catalog: docs/EAP_4_3/JBoss_Messaging_User_Guide/*/Installation.po
Languages: de_de, es_es, fr_fr, ja_jp, pt_br, zh_cn

source: To run the example and validate the installation, open an new command line window and set the <literal>JBOSS_HOME</literal> environment variable to point to the JBoss AS 4.x installation you've just installed Messaging on. Navigate to the folder where you extracted the release bundle and drill down to <filename>/examples/queue</filename>. Apache Ant must pe present in your path in order to be able to run the example.
de_de: Um das Beispiel auszuführen und die Installation zu validieren öffnen Sie ein neues Befehlszeilenfenster und stellen Sie die <literal>JBOSS_HOME</literal>-Umgebungsvariable so ein, dass Sie auf die JBoss AS 4.x Installation weist auf der Sie gerade Messaging installiert haben. Navigieren Sie zum Ordner, wo Sie das Release-Bündel extrahiert haben und und begeben Sie sich in <filename>/examples/queue</filename>. Apache Ant muss in Ihrem Pfad vorhanden sein, damit Sie das Beispiel ausführen können.
es_es: Para ejecutar el ejemplo y validar la instalación, abra una nueva terminal y configure la variable de entorno <literal>JBOSS_HOME</literal> para que apunte a la instalación de JBoss AS 4.x cuando acabe de instalar Messaging on. Navegue al folder en donde puso el lanzamiento y llegue hasta <filename>/examples/queue</filename>. Apache Ant debe presentarse en su ruta con el fin de poder ejecutar el ejemplo.
fr_fr: Pour exécuter l'exemple et valider l'installation, ouvrir une nouvelle fenêtre de ligne de commande et configurer la variable d'environnement <literal>JBOSS_HOME</literal> de façon à ce qu'elle pointe vers JBoss AS 4.x sur laquelle vous venez juste d'installer Messaging. Naviguer vers le dossier d'où vous avez extrait le paquetage de mise à jour et forer vers le bas dans <filename>/examples/queue</filename>. Apache Ant doit figurer dans votre chemin d'accès pour pouvoir exécuter l'exemple.
ja_jp: サンプルを実行して、インストールを検証するには、新規のコマンドラインウィンドウを 開いて <literal>JBOSS_HOME</literal> 環境変数を、Messaging をインストールしている JBoss AS 4.x インストールへポイントするようにセットします。リリースバンドルを解凍した フォルダーへ移動していき、<filename>/examples/queue</filename> まで進行します。 サンプルを実行できるようにする為には、Apache Ant が使用パスに存在する必要があります。
pt_br: Para rodar este exemplo e validar a instalação, abra uma nova janela de linha de comando e configure a variável do ambiente <literal>JBOSS_HOME</literal> para apontar à instalação JBoss AS 4.x que você tenha acabado de instalar o Messaging. Navegue até a pasta onde você extraiu o agrupamento de liberação e faça o drill down até <filename>/examples/queue</filename>. O Apache Ant deve estar presente em seu caminho com o objetivo de estar apto a rodar o exemplo.
zh_cn: 要运行这些例子来验证安装，你可以打开一个命令行窗口并设置 <literal>JBOSS_HOME</literal> 环境变量，使其指向你刚才安装 Messaging 所基于的 JBoss AS 4.x 的安装位置。导航至你解压本发行版本的文件夹并进入 <filename>/examples/queue</filename>。要运行这些例子，系统路径里必须有 Apache Ant。

source: Make sure you start the JBoss server before trying to run the tests
de_de: Stellen Sie sicher, dass der JBoss Server gestartet ist, ehe Sie die Tests ausführen
es_es: Asegúrese de iniciar el servidor JBoss antes de intentar el ejecutar los tests
fr_fr: Veillez bien à démarrer le serveur JBoss avant d'essayer d'exécuter les tests
ja_jp: これらのテストを実行する前に JBoss サーバーをスタートすることを確認します。
pt_br: Certifique-se de inicializar o servidor JBOss antes de tentar rodar os testes.
zh_cn: 在进行测试之前，请确保 JBoss 服务器已经运行。

source: A successfull execution log output looks similar to:
de_de: Die Ausgabe eines erfolgreichen Ausführungsprotokolls sieht in etwa so aus:
es_es: Un registro de la salida de una ejecución exitosa se ve similar a esta:
fr_fr: Un exécution réussie de log output ressemble à ce qui suit:
ja_jp: 正しく実行できたログは以下のような出力を表示します:
pt_br: Uma execução com êxito do emissor log parece-se com:
zh_cn: 执行成功的日志输出应该类似于：

source: It is recommended to run <literal>all</literal> validation examples available in the <filename>example</filename> directory (<filename>queue</filename>, <filename>topic</filename>, <filename>mdb</filename>, <filename>stateless</filename>, etc.). In <xref linkend="examples"/>, we will have a look at each of those examples.
de_de: Es empfiehlt sich, die im <filename>example</filename>-Verzeichnis verfügbaren <literal>all</literal>-Validierungsbeispiele auszuführen (<filename>queue</filename>, <filename>topic</filename>, <filename>mdb</filename>, <filename>stateless</filename>, u.s.w.). In <xref linkend="examples"/> sehen wir uns diese Beispiele genauer an.
es_es: Se recomienda ejecutar los ejemplos de validación <literal>all</literal> disponibles en el directorio <filename>example</filename> (<filename>queue</filename>, <filename>topic</filename>, <filename>mdb</filename>, <filename>stateless</filename>, etc.). En <xref linkend="examples"/>, vamos a mirar cada uno de esos ejemplos.
fr_fr: Il est recommandé d'exécuter les exemples de validation <literal>all</literal> validation disponibles dans le répertoire <filename>example</filename> (<filename>queue</filename>, <filename>topic</filename>, <filename>mdb</filename>, <filename>stateless</filename>, etc.). Dans <xref linkend="examples"/>, nous étudierons chacun de ces exemples.
ja_jp: <filename>example</filename> ディレクトリ内で利用できる <literal>全ての</literal> 検証 サンプル（<filename>queue</filename>, <filename>topic</filename>, <filename>mdb</filename>, <filename>stateless</filename> など）の実行が推奨されます。<xref linkend="examples"/> 内で、 これらのサンプルの１つ１つを観察します。
pt_br: É recomendável rodar <literal>all</literal> validação de exemplos disponíveis no diretório <filename>example</filename> (<filename>queue</filename>, <filename>topic</filename>, <filename>mdb</filename>, <filename>stateless</filename>, etc.). Em <xref linkend="examples"/>, observaremos cada um destes exemplos.
zh_cn: 我们推荐你运行 <filename>example</filename> 目录（<filename>queue</filename>、<filename>topic</filename>、<filename>mdb</filename>、<filename>stateless</filename> 等等）里的 <literal>all</literal> 验证示例。在 <xref linkend="examples"/> 里，我们将依次查看每个例子。

source: Accessing JBoss Messaging from a remote client
de_de: Zugriff auf JBoss Messaging von einem Remote Client
es_es: Acceso a JBoss Messaging desde un cliente remoto
fr_fr: Accéder à JBoss Messaging à partir d'un client distant
ja_jp: リモートクライアントからの JBoss Messaging へのアクセス
pt_br: Acessando o JBoss Messaging a partir de um cliente remoto
zh_cn: 从远程客户端访问 JBoss Messaging

source: In order to access JBoss Messaging from a client outside the JBoss app server, you will need to ensure the following jar files are on the client classpath:
de_de: Um von einem Client außerhalb des JBoss app Servers Zugriff auf JBoss Messaging zu haben, müssen Sie sicherstellen, dass die folgenden jar-Dateien sich im Klassenpfad des Clients befinden:
es_es: Con el fin de acceder a JBoss Messaging desde un cliente fuera del servidor de aplicaciones de JBoss, necesitará asegurarse de que los siguiente archivos jar se encuentren en la ruta de clase del cliente:
fr_fr: Pour accéder à JBoss Messaging à partir d'un client en dehors du serveur app JBoss, vous devrez vous assurer que les fichiers jar suivants sont sur le chemin de classe du client:
ja_jp: JBoss アプリケーションサーバーの外部のクライアントから JBoss Messaging にアクセスするには、 クライアントの classpath に以下のような jar ファイルがあることを確認する必要があります。
pt_br: Com o objetivo de acessar o JBoss Messaging a partir de um cliente fora do servidor JBoss app, você deverá garantir que os seguintes arquivos de jarra estão na classpath do cliente:
zh_cn: 要从 JBoss 应用服务器之外的客户端访问 JBoss Messaging，你需要确保下面的 jar 文件在客户端的 classpath 里：

source: JBoss Messaging 1.4.0 requires a patched version of jboss-remoting.jar. This version is not available in the JBoss AS 4.2.0 or JBoss AS 4.2.1 distributions. The patched jar can be found <ulink url="http://repository.jboss.com/jboss/remoting/2.2.2.SP1-brew/lib/">here</ulink> . Please download it and make sure this jar is on your classpath *before* jbossall-client.jar.
de_de: JBoss Messaging 1.4.0 benötigt eine gepatchte Version von jboss-remoting.jar. Diese Version ist nicht in den JBoss AS 4.2.0 oder JBoss AS 4.2.1 Distributionen verfügbar. Die gepatchte jar finden Sie <ulink url="http://repository.jboss.com/jboss/remoting/2.2.2.SP1-brew/lib/">hier</ulink> . Bitte laden Sie diese herunter und stellen Sie sicher, dass diese jar *vor* jbossall-client.jar in Ihrem Klassenpfad ist.
es_es: JBoss Messaging 1.4.0 requiere una versión modificada de jboss-remoting.jar. Esta versión no está disponible en las distribuciones JBoss AS 4.2.0 o JBoss AS 4.2.1. La jar modificada se puede encontrar en <ulink url="http://repository.jboss.com/jboss/remoting/2.2.2.SP1-brew/lib/">here</ulink> . Descárguela y asegúrese de que esta jar se encuentra en su ruta de clase *antes* de jbossall-client.jar.
fr_fr: JBoss Messaging 1.4.0 requiert une version modifiée de jboss-remoting.jar. Cette version n'est pas disponible dans les distributions JBoss AS 4.2.0 ou JBoss AS 4.2.0. Le jar modifié peut être trouvé dans <ulink url="http://repository.jboss.com/jboss/remoting/2.2.2.SP1-brew/lib/">here</ulink> . Veuillez le décharger et vous assurer que ce jar est sur votre chemin de classe *avant* jbossall-client.jar.
ja_jp: JBoss Messaging 1.4.0 は jboss-remoting.jar のパッチ済みバージョンを必要とします。 このバージョンは、JBoss AS 4.2.0 や JBoss AS 4.2.1 のディストリビューションでは 入手できません。このパッチ済み jar は <ulink url="http://repository.jboss.com/jboss/remoting/2.2.2.SP1-brew/lib/">ここ</ulink> で入手できます。 これをダウンロードして、この jar が jbossall-client.jar の前の classpath に 存在するようにして下さい。
pt_br: O JBoss Messaging 1.4.0 solicita uma versão patched do jboss-remoting.jar. Esta versão não está disponível nas distribuições do JBoss AS 4.2.0 ou JBoss AS 4.2.1. A jarra patched pode ser encontrada em <ulink url="http://repository.jboss.com/jboss/remoting/2.2.2.SP1-brew/lib/">here</ulink>. Por favor, realize o download nisto e certifique-se que esta jarra está em sua classpath *antes* do client.jar.
zh_cn: JBoss Messaging 1.4.0 要求 jboss-remoting.jar 的一个修订版本。这个版本不在 JBoss AS 4.2.0 或 JBoss AS 4.2.1 里。这个 jar 文件可以在<ulink url="http://repository.jboss.com/jboss/remoting/2.2.2.SP1-brew/lib/">这里</ulink>里找到。请下载这个文件并确保它在 classpath 里位于 jbossall-client.jar ＊前面＊。

source: jboss-messaging-client.jar - This is available in the messaging distribution
de_de: jboss-messaging-client.jar - Dies ist in der Messaging Distribution verfügbar
es_es: jboss-messaging-client.jar - Está disponible en la distribución messaging
fr_fr: jboss-messaging-client.jar - est disponible dans messaging distribution
ja_jp: jboss-messaging-client.jar - これは messaging ディストリビューションから入手できます。
pt_br: jboss-messaging-client.jar - Pode ser encontrado na distribuição do messaging.
zh_cn: jboss-messaging-client.jar - 位于 messaging 发行版本里

source: jbossall-client.jar - This is available in your $JBOSS_HOME/client directory
de_de: jbossall-client.jar - Dies ist in Ihrem $JBOSS_HOME/client-Verzeichnis verfügbar
es_es: jbossall-client.jar - Está disponible en su directorio $JBOSS_HOME/client
fr_fr: jbossall-client.jar - est disponible dans $JBOSS_HOME/client directory (répertoire clients)
ja_jp: jbossall-client.jar - これは、使用中の $JBOSS_HOME/client ディレクトリ内で利用できます。
pt_br: jbossall-client.jar - Pode ser encontrado em seu diretório $JBOSS_HOME/client.
zh_cn: jbossall-client.jar - 存在于 $JBOSS_HOME/client 目录里

source: (For AOP, sometimes you have to use a specific JAR according to your JVM of choice. Use the most convenient for you)
de_de: (Bei AOP müssen Sie manchmal eine bestimmte JAR benutzen, gemäß der JVM Ihrer Wahl. Verwenden Sie die für Sie passendste)
es_es: (Para AOP, algunas veces tiene que utilizar una JAR especifica de acuerdo con su MVJ preferida. Utilice la que más le convenga)
fr_fr: (Pour AOP, vous devez parfois utiliser un JAR spécifique suivant votre choix de JVM. Utiliser ce qui est plus pratique pour vous)
ja_jp: （AOP には、選択した JVM に応じて時には、特定の JAR を使用する必要があります。 最も便利なものを使用して下さい）
pt_br: (Às vezes você precisará usar uma JAR específica de acordo com o seu JVM de escolha, para o AOP. Use o que for mais conveniente para você)
zh_cn: （对于 AOP，你有时需要使用一个 JVM 专有的 JAR。请使用最方便的版本。）

source: $JBOSS_HOME/server/&lt;SERVER_NAME&gt;/deploy/jboss-aop.deployer/jboss-aop.jar
pt_br: OSS_HOME/server/&lt;SERVER_NAME&gt;/deploy/jboss-aop.deployer/jboss-aop.jar
