Repository: bobmcwhirter/jboss-messaging
Catalog: docs/EAP_4_3/JBoss_Messaging_User_Guide/*/Recovery_Config.po
Languages: de_de, es_es, fr_fr, ja_jp, pt_br, zh_cn

source: JBoss Messaging XA Recovery Configuration
de_de: JBoss Messaging XA Recovery-Konfiguration
es_es: Configuración de JBoss Messaging XA Recovery
fr_fr: Configuration de recouvrement JBoss Messaging XA
ja_jp: JBoss Messaging XA 復元の設定
pt_br: Configuração de Recuperação XA do JBoss Messaging
zh_cn: JBoss Messaging XA 恢复的配置

source: This section describes how to configure JBoss Transactions in JBoss AS 4.2.0 to handle XA recovery for JBoss Messaging resources.
de_de: Dieser Abschnitt beschreibt die Konfiguration von JBoss Transactions in JBoss AS 4.2.0 zur Handhabung von XA-Recovery für JBoss Messaging Ressourcen.
es_es: Esta sección describe la manera de configurar JBoss Transactions en JBoss AS 4.2.0 para manejar la recuperación XA para recursos de JBoss Messaging.
fr_fr: Cette section décrit comment configurer JBoss Transactions dans JBoss AS 4.2.0 pour gérer le recouvrement XA des ressources JBoss Messaging.
ja_jp: このセクションでは、JBoss Messaging リソース用に XA の復元を処理するための JBoss AS 4.2.0 の JBoss Transactions の設定の仕方を説明しています。
pt_br: Esta seção descreve como configurar as Transações do JBoss no JBoss AS 4.2.0, com o objetivo de manusear a recuperação XA para os recursos do JBoss Messaging.
zh_cn: 本节描述了如何在 JBoss AS 4.2.0 里配置 JBoss Transactions 来处理 JBoss Messaging 资源的 XA 恢复。

source: JBoss Transactions recovery manager can easily be configured to continually poll for and recover JBoss Messaging XA resources, this provides an extremely high level of durability of transactions.
de_de: Der JBoss Transactions Recovery Manager kann ganz einfach dahingehend konfiguriert werden, dass er kontinuierlich nach JBoss Messaging XA Ressourcen pollt und wieder herstellt, wodurch eine extrem hohe Ebene der Beständigkeit von Transaktionen gewährleistet wird.
es_es: El administrador de recuperación de transacciones de JBoss se puede configurar fácilmente para sondear continuamente y poder recuperar recusos de JBoss Messaging XA, esto proporciona un alto nivel de durabilidad de transacciones.
fr_fr: Le gestionnaire de recouvrement JBoss Transactions peut facilement être configuré pour émettre ou recouvrir les ressources JBoss Messaging XA, ce qui procure un très haut niveau de durabilité des transactions.
ja_jp: JBoss Transactions リカバリーマネージャは連続的にポーリングして JBoss Messaging XA リソースを 復元するように簡単に設定することができます。これにより、トランザクションで非常に高い耐久性が提供されます。
pt_br: O gerenciador de recuperação das Transações do JBoss podem facilmente ser configuradas para o poll continuamente e recursos XA do JBoss Messaging. Isto fornece um alto nível extremo de durabilidade de transações.
zh_cn: 你可以很容易地配置 JBoss Transactions Recovery Manager 来轮询和恢复 JBoss Messaging 的 XA 资源，这为事务提供了极高级别的持久性。

source: Enabling JBoss Transactions Recovery Manager to recover JBoss Messaging resources is a very simple matter and involves adding a line to the file ${JBOSS_CONFIG}/conf/jbossjta-properties.xml
de_de: Das Aktivieren des JBoss Transactions Recovery Manager zur Wiederherstellung von JBoss Messaging Ressourcen ist eine ganz einfache Sache und beinhaltet das Hinzufügen einer Zeile zur Datei ${JBOSS_CONFIG}/conf/jbossjta-properties.xml
es_es: El activar el JBoss Transactions Recovery Manager para recuperar recursos de JBoss Messaging resources es bastante simple y sólo implica añadir una línea al archivo ${JBOSS_CONFIG}/conf/jbossjta-properties.xml
fr_fr: Permettre au gestionnaire de recouvrement JBoss Transaction de recouvrir les ressources JBoss Messaging est une question simple qui implique d'ajouter une ligne dans le fichier ${JBOSS_CONFIG}/conf/jbossjta-properties.xml
ja_jp: JBoss Transactions リカバリーマネージャを有効にして、JBoss Messaging リソースを復元するのは、 １つの行をファイル ${JBOSS_CONFIG}/conf/jbossjta-properties.xml に追加するだけの 非常に単純な操作です。
pt_br: A ativação do Gerenciador de Recuperação de Transações JBoss para recuperação dos recursos do JBoss Messaging é um assunto muito simples e envolve a adição de uma linha ao arquivo ${JBOSS_CONFIG}/conf/jbossjta-properties.xml.
zh_cn: 启用 JBoss Transactions Recovery Manager 来恢复 JBoss Messaging 资源很简单，你只需在 ${JBOSS_CONFIG}/conf/jbossjta-properties.xml 里添加一行就可以了。

source: Here's an example section of a jbossjta-properties.xml file with the line added (note the whole file is not shown)
de_de: Hier ist ein Beispielabschnitt einer jbossjta-properties.xml-Datei mit der hinzugefügten Zeile (beachten Sie, dass nicht die ganze Datei dargestellt ist)
es_es: Esta es una sección de ejemplo de un archivo jbossjta-properties.xml con la línea añadida (observe que no se muestra todo el archivo)
fr_fr: Voici une exemple de section du fichier jbossjta-properties.xml avec la ligne incluse (noter que le fichier n'apparaît pas tout entier)
ja_jp: 以下にその１行を追加した jbossjta-properties.xml ファイルの サンプルセクションを示します（ファイルの一部のみ表示）。
pt_br: A seguir, uma seção de exemplo do arquivo jbossjta-properties.xml com a linha adicionada (perceba que o arquivo inteiro é agora apresentado).
zh_cn: 下面是一个已经添加了这一行的 jbossjta-properties.xml 文件的示例片段（注意这里并未显示整个文件）：

source: In the above example the recovery manager will attempt to recover JMS resources using the JMSProviderLoader "DefaultJMSProvider"
de_de: Im Beispiel oben wird der Recovery Manager versuchen, JMS Ressourcen mittels JMSProviderLoader "DefaultJMSProvider" wiederherzustellen
es_es: En el ejemplo anterior el administrador de recuperación tratará de recuperar recursos JMS utilizando el JMSProviderLoader "DefaultJMSProvider"
fr_fr: Dans l'exemple ci-dessus, le gestionnaire de recouvrement tentera de recouvrir les ressources JMS en utilisant JMSProviderLoader "DefaultJMSProvider"
ja_jp: 上記の例では、リカバリーマネージャが、JMSProviderLoader "DefaultJMSProvider" を 使用して JMS リソースの復元を試行しています。
pt_br: No exemplo anterior, o gerenciador de recuperação tentará recuperar os recursos JMS usando o JMSProviderLoader "DefaultJMSProvider".
zh_cn: 在上面的例子里，Recovery Manager 将试图用 JMSProviderLoader "DefaultJMSProvider" 恢复 JMS 资源。

source: DefaultJMSProvider is the default JMS provider loader that ships with JBoss AS and is defined in jms-ds.xml (or hajndi-jms-ds.xml in a clustered configuration). If you want to recovery using a different JMS provider loader - e.g. one corresponding to a remote JMS provider then just add another line and instead of DefaultJMSProvider specify the name of the remote JMS provider as specified in it's MBean configuration.
de_de: DefaultJMSProvider ist der standardmäßige JMS Provider Loader, der mit JBoss AS geliefert wird und in jms-ds.xml (oder hajndi-jms-ds.xml in einer geclusterten Konfiguration) definiert. Falls Sie Recovery unter Verwendung eines anderen JMS Provider Loaders wünschen - z.B. eines einem Remote JMS Provider entsprechenden wünschen, so fügen Sie einfach eine weitere Zeile hinzu und legen Sie statt DefaultJMSProvider den Namen des Remote JMS Providers wie in dessen MBean-Konfiguration spezifiziert fest.
es_es: DefaultJMSProvider es el cargador proveedor JMS predeterminado que se envía junto con JBoss AS y está definido en jms-ds.xml (o hajndi-jms-ds.xml en una configuración con clústers). Si quiere realizar recuperaciones con un cargador proveedor JMS diferente - por ejemplo, uno que corresponde a un proveedor JMS remoto entonces simplemente añada otra línea y en vez de DefaultJMSProvider especifique el nombre del proveedor JMS remoto como se especificó en la configuración del MBean.
fr_fr: DefaultJMSProvider est le chargeur du provider JMS par défaut proposé avec JBoss AS et qui est défini dans jms-ds.xml (ou hajndi-jms-ds.xml dans une configuration groupée). Si vous souhaiter procéder au recouvrement en utilisant un chargeur de provider JMS différent - par ex. un qui correspond à un provider JMS distant, alors ajouter simplement une ligne supplémentaire et à la place de DefaultJMSProvider, préciser le nom du provider distant JMS spécifié dans sa configuration MBean.
ja_jp: DefaultJMSProvider とは、デフォルトの JMS プロバイダーローダー であり、これは JBoss AS に同梱されていて jms-ds.xml （又はクラスター設定の hajndi-jms-ds.xml）内で定義されています。もし、異なるプロバイダー（例えば、 リモート JMS プロバイダーに相当するもの）を使用して復元したい場合は、 別の行を追加して、DefaultJMSProvider ではなくリモート JMS プロバイダーの 名前を MBean 設定内で指定されているのと同様に指定します。
pt_br: O DefaultJMSProvider é o carregador do provedor JMS padrão, do qual lança o JBoss AS e é definido em jms-ds.xml (ou hajndi-jms-ds.xml numa configuração com cluster). Caso você deseje realizar a recuperação usando um diferente carregador do provedor JMS, por exemplo: um correspondente a um provedor JMS remoto, apenas adicione uma outra linha e ao invés de especificar o nome de um provedor JMS remoto, conforme especificado na própria configuração MBean.
zh_cn: DefaultJMSProvider 是 JBoss AS 附带的缺省 JMS 提供者的加载器，它在 jms-ds.xml（群集环境里使用 hajndi-jms-ds.xml）里进行定义。如果你想用不同的 JMS 提供者加载器进行恢复 － 例如对应远程 JMS 提供者的加载器，你只需要再添加一行来指定远程 JSM 提供者（如其 MBean 配置里所指定的）的名字来代替 DefaultJMSProvider 就可以了。

source: For each line you add, the name must be unique, so you could specify "com.arjuna.ats.jta.recovery.XAResourceRecovery.JBMESSAGING1", "com.arjuna.ats.jta.recovery.XAResourceRecovery.JBMESSAGING2, ..." etc.
de_de: Der Name muss für jede hinzugefügte Zeile eindeutig sein, Sie könnten daher "com.arjuna.ats.jta.recovery.XAResourceRecovery.JBMESSAGING1", "com.arjuna.ats.jta.recovery.XAResourceRecovery.JBMESSAGING2, ..." usw. festlegen
es_es: Para cada línea que añada, el nombre debe ser único así que podría especificar "com.arjuna.ats.jta.recovery.XAResourceRecovery.JBMESSAGING1", "com.arjuna.ats.jta.recovery.XAResourceRecovery.JBMESSAGING2, ..." etc.
fr_fr: Pour chaque ligne que vous ajoutez, le nom doit être unique, donc vous pouvez spécifier "com.arjuna.ats.jta.recovery.XAResourceRecovery.JBMESSAGING1", "com.arjuna.ats.jta.recovery.XAResourceRecovery.JBMESSAGING2, ..." etc.
ja_jp: 追加する行のそれぞれでその名前は特有でなければなりません。そうすると "com.arjuna.ats.jta.recovery.XAResourceRecovery.JBMESSAGING1" や "com.arjuna.ats.jta.recovery.XAResourceRecovery.JBMESSAGING2, ..." などのように指定できます。
pt_br: Para cada linha em que você adicionar, o nome deve ser exclusivo, de forma que você possa especificar: "com.arjuna.ats.jta.recovery.XAResourceRecovery.JBMESSAGING1", "com.arjuna.ats.jta.recovery.XAResourceRecovery.JBMESSAGING2, ..." etc.
zh_cn: 对于你添加的每一行，名字必须是唯一的，所以你可以指定 "com.arjuna.ats.jta.recovery.XAResourceRecovery.JBMESSAGING1", "com.arjuna.ats.jta.recovery.XAResourceRecovery.JBMESSAGING2, ..." 等等。

source: In actual fact, the recovery also should work with any JMS provider that implements recoverable XAResources (i.e. it properly implements XAResource.recover()) , not just JBoss Messaging
de_de: Genau genommen sollte die Recovery auch mit einem beliebigen JMS-Provider funktionieren, der wiederherstellbare XAResources (d.h. ordnungsgemäß XAResourcerecover()) implementiert, nicht nur JBoss Messaging implementiert
es_es: De hecho, la recuperación también debe funcionar con cualquier proveedor JMS que implemente XAResources recuperables (por ejemplo, implementa apropiadamente XAResource.recover()) , no sólo JBoss Messaging
fr_fr: En fait, le recouvrement devrait également fonctionner avec n'importe quel provider JMS qui implémente les XAResources recouvrables (c'est à dire qui implémente XAResource.recover()) , et pas seulement JBoss Messaging
ja_jp: 実際には、この復元は JBoss Messaging だけでなく、復元可能な XAResources （これは XAResource.recover() を正しく実装します）を実装するいずれかの JMS プロバイダーでも動作するはずです。
pt_br: Na realidade, a recuperação também deve trabalhar com qualquer provedor JMS, do qual implementa os XAResources recuperáveis (por exemplo: isto implementa propriamente o XAResource.recover()), não apenas o JBoss Messaging.
zh_cn: 实际上，恢复也可以使用实现了可恢复 XAResources（也就是需要正确实现 XAResource.recover()）的任何 JMS 提供者来进行，而不仅仅是 JBoss Messaging。

source: Please note that to configure the recovery manager to recovery transactions from any node of the cluster it will be necessary to specify a line in the configuration for every node of the cluster
de_de: Bitte beachten Sie, dass es zur Konfiguration des Recovery Managers zur Wiederherstellung von Transaktionen von einem beliebigen Node des Clusters notwendig sein wird, eine Zeile in der Konfiguration für jeden Node des Clusters hinzuzufügen
es_es: Observe que para configurar el administrador de recuperación para que recupere transacciones desde cualquier nodo del clúster será necesario especificar una línea en la configuración para todos los nodos del clúster
fr_fr: Veillez noter que pour configurer le gestionnaire pour recouvrir les transactions de n'importe quel noeud du groupement, il vous faudra ajouter une ligne dans la configuration de chaque noeud du groupement
ja_jp: クラスターのノードからトランザクションを復元するようにリカバリーマネージャを設定するには、 クラスターの各ノード毎の設定内で１つの行を指定する必要があることに注意して下さい。
pt_br: Perceba que para configurar o gerenciador de recuperação as transações de recuperação de qualquer nó de um cluster, será necessário especificar uma linha na configuração para cada nó de cluster.
zh_cn: 请注意，要配置 Recovery Manager 来恢复群集里任何节点的事务，你有必要在配置文件里用一行为每个节点进行指定。
