Repository: bobmcwhirter/jboss-messaging
Catalog: docs/EAP_4_3/JBoss_Messaging_User_Guide/*/Running_Examples.po
Languages: de_de, es_es, fr_fr, ja_jp, pt_br, zh_cn

source: JBoss Messaging Examples
de_de: JBoss Messaging Beispiele
es_es: Ejemplos de JBoss Messaging
fr_fr: Exemples de JBoss Messaging
ja_jp: JBoss Messaging のサンプル
pt_br: Exemplos do JBoss Messaging
zh_cn: JBoss Messaging 示例

source: About the Examples
de_de: Zu den Beispielen
es_es: Con relación a los ejemplos
fr_fr: A propos des exemples
ja_jp: サンプルについて
pt_br: A Respeito dos Exemplos
zh_cn: 关于这些示例

source: In the installation directory of your JBoss Enterprise Application Platform you will find a set of JBoss Messaging examples located in <literal>JBOSS_DIST/doc/examples/jboss-messaging-examples</literal>. These examples demonstrate JBoss Messaging in action. Within the <literal>JBOSS_DIST/doc/examples/jboss-messaging-examples</literal> directory, you will find the following sub-directories:
de_de: Im Installationsverzeichnis Ihrer JBoss Enterprise Application Platform finden Sie einen Beispiel JBoss Messaging Beispiele in <literal>JBOSS_DIST/doc/examples/jboss-messaging-examples</literal>. Diese Beispiele zeigen JBoss Messaging in Aktion. Innerhalb des <literal>JBOSS_DIST/doc/examples/jboss-messaging-examples</literal>-Verzeichnisses, existieren folgende Unterverzeichnisse:
es_es: En el directorio de instalación de su JBoss Enterprise Application Platform encontrará un grupo de ejemplos de JBoss Messaging en <literal>JBOSS_DIST/doc/examples/jboss-messaging-examples</literal>. Estos ejemplos demuestran JBoss Messaging en acción. Dentro del directorio <literal>JBOSS_DIST/doc/examples/jboss-messaging-examples</literal> encontrará los siguientes sub-directorios:
fr_fr: Dans le répertoire d'installation de votre plate-forme JBoss Enterprise Application Platform, vous trouverez quelques exemples de JBoss Messaging situés dans <literal>JBOSS_DIST/doc/examples/jboss-messaging-examples</literal>. Ces exemples montrent JBoss Messaging en action. Dans le répertoire JBOSS_DIST/doc/examples/jboss-messaging-examples</literal>, vous trouverez les sous-répertoires suivants:
ja_jp: JBoss Enterprise Application Platform のインストールディレクトリで、 <literal>JBOSS_DIST/doc/examples/jboss-messaging-examples</literal> に配置 してある JBoss Messaging サンプルセットを見つけることができます。これらのサンプルは JBoss Messaging の実際の動作をデモンストレーションします。 <literal>JBOSS_DIST/doc/examples/jboss-messaging-examples</literal> ディレクトリ内には、 以下のようなサブディレクトリがあります:
pt_br: O diretório de instalação do sua Plataforma de Aplicativo JBoss Enterprise encontrará um conjunto de exemplos do JBoss Messaging em <literal>JBOSS_DIST/doc/examples/jboss-messaging-examples</literal>. Estes exemplos demonstram o JBoss Messaging em ação. Você poderá encontrar os seguintes sub-diretórios, com o <literal>JBOSS_DIST/doc/examples/jboss-messaging-examples</literal>:
zh_cn: 在 JBoss 企业级应用程序平台的安装目录里，你可以找到位于 <literal>JBOSS_DIST/doc/examples/jboss-messaging-examples</literal> 的一系列示例。这些例子演示了 JBoss Messaging 的运行。在 <literal>JBOSS_DIST/doc/examples/jboss-messaging-examples</literal> 里，你将看到下面的子目录：

source: This example demonstrates a simple 'send' and 'receive' to a remote queue using a JMS client.
de_de: Dieses Beispiel demonstriert ein einfaches 'send' (senden) und 'receive' (empfangen) an eine Remote-Warteschlange mittels eines JMS-Client.
es_es: Este ejemplo demuestra un simple 'enviar' y 'recibir' a una cola remota utilizando un cliente JMS.
fr_fr: Cet exemple montre un simple 'envoi' et 'réception' vers une file d'attente distante en utilisant un client JMS.
ja_jp: このサンプルは、JMS クライアントを使用したリモートキューへの簡単な送信と 受信のデモンストレーションです。
pt_br: Este exemplo demonstra um simples 'enviar' e 'receber' para uma fila remota usando um cliente JMS.
zh_cn: 这个例子演示了一个 JMS 客户端，它对远程队列进行简单的 '发送' 和 '接收'。

source: This example demonstrates a simple 'send' and 'receive' to a remote topic using a JMS client.
de_de: Dieses Beispiel demonstriert ein einfaches 'send' (senden) und 'receive' (empfangen) an ein Remote-Topic mittels eines JMS-Client.
es_es: Este ejemplo demuestra un simple 'enviar' y 'recibir' a un tema remoto utilizando un cliente JMS.
fr_fr: Cet exemple montre un simple 'envoi' et 'réception' vers un sujet distant en utilisant un client JMS.
ja_jp: このサンプルは JMS クライアントを使用したリモートトピック への 簡単な送信と受信のデモンストレーションです。
pt_br: Este exemplo demonstra um simples 'enviar' e 'receber' para um tópico remoto usando um cliente JMS.
zh_cn: 这个例子演示使用 JMS 客户端对远程主题（Topic）进行简单的 '发送' 和 '接收'。

source: This example demonstrates the usage of an EJB2.1 MDB with JBoss Messaging.
de_de: Dieses Beispiel demonstriert den Gebrauch eines EJB2.1 MDB mit JBoss Messaging.
es_es: Este ejemplo demuestra el uso de un EJB2.1 MDB con JBoss Messaging.
fr_fr: Cet exemple montre l'utilisation d'un EJB2.1 MDB avec JBoss Messaging.
ja_jp: これサンプルは、JBoss Messaging と共に EJB2.1 MDB を使用するデモンストレーションです。
pt_br: Este exemplo demonstra o uso de um EJB2.1 MDB com o JBoss Messaging.
zh_cn: 这个例子演示 JBoss Messaging 对 EJB2.1 MDB 的使用。

source: This example demonstrates the usage of an EJB3 MDB with JBoss Messaging.
de_de: Dieses Beispiel demonstriert den Gebrauch eines EJB3 MDB mit JBoss Messaging.
es_es: Este ejemplo demuestra el uso de un EJB3 MDB con JBoss Messaging.
fr_fr: Cet exemple montre l'utilisation d'un EJB3 MDB avec JBoss Messaging.
ja_jp: このサンプルは JBoss Messaging と共に EJB3 MDB を使用するデモンストレーションです。
pt_br: Este exemplo demonstra o uso de um EJB3 MDB com o JBoss Messaging.
zh_cn: 这个例子演示 JBoss Messaging 对 EJB3 MDB 的使用。

source: This example demonstrates an EJB2.1 stateless session bean interacting with JBoss Messaging.
de_de: Dieses Beispiel demonstriert ein EJB2.1 "Stateless Session Bean", das mit JBoss Messaging interagiert.
es_es: Este ejemplo demuestra el uso de un bean de sesión sin estado EJB2.1 interactuando con JBoss Messaging.
fr_fr: Cet exemple montre une session d'un Bean Java EJB2.1 sans état, en interaction avec JBoss Messaging.
ja_jp: このサンプルは JBoss Messaging と対話する EJB2.1 ステートレス セッション Bean のデモンストレーションです。
pt_br: Este exemplo demonstra um bean de sessão sem estado EJB2.1, interagindo com o JBoss Messaging.
zh_cn: 这个例子演示 EJB2.1 stateless session bean 和 JBoss Messaging 的交互。

source: This example demonstrates rollback and redelivery occuring with an EJB2.1 MDB.
de_de: Dieses Beispiel demonstriert Zurücksetzen und erneutes Ausliefern mit einem EJB2.1 MDB.
es_es: Este ejemplo demuestra la manera de deshacer y re-entregar con un EJB2.1 MDB.
fr_fr: Cet exemple montre un retour-arrière au point de contrôle et une rediffusion avec un EJB2.1 MDB.
ja_jp: このサンプルは EJB2.1 MDB で発生するロールバックと再配信のデモンストレーションです。
pt_br: Este exemplo demonstra uma reversão e re-entrega, ocorrendo com um EJB2.1 MDB.
zh_cn: 这个例子演示了 EJB2.1 MDB 里发生的回滚（rollback）和重递送（redelivery）。

source: This example demonstrates a JMS client interacting with a JBoss Messaging server using SSL encrypted transport.
de_de: Dieses Beispiel demonstriert die Interaktion eines JMS Client mit einem JBoss Messaging Server unter Verwendung von SSL verschlüsseltem Transport.
es_es: Este ejemplo demuestra un cliente JMS interactuando con un servidor JBoss Messaging utilizando transporte encriptado SSL.
fr_fr: Cet exemple montre un client JMS en contact avec un serveur JBoss Messaging, utilisant un mode de transport crypté SSL.
ja_jp: このサンプルは SSL 暗号化のトランスポートを使用した JBoss Messaging サーバーと通信する JMS クライアントのデモンストレーションです。
pt_br: Este exemplo demonstra um cliente JMS interagindo com um servidor do JBoss Messaging, usando o transporte criptografado SSL.
zh_cn: 这个例子演示了 JMS 客户端用 SSL 加密传输和 JBoss Messaging 服务器进行交互。

source: This example demonstrates a JMS client interacting with a JBoss Messaging server tunneling traffic over HTTP protocol.
de_de: Dieses Beispiel demonstriert die Interaktion eines JMS Client mit einem JBoss Messaging Server und Tunneling von Traffic über HTTP-Protokoll.
es_es: Este ejemplo demuestra un cliente JMS interactuando con un servidor JBoss Messaging construyendo un tunel para el tráfico sobre el protocolo HTTP.
fr_fr: Cet exemple montre une client JMS en contact avec un serveur JBoss Messaging, transmettant le trafic par tunnel à travers un protocole HTTP.
ja_jp: このサンプルは HTTP プロトコルでトラフィックをトンネリングしている JBoss Messaging サーバーと対話する JMS クライアントのデモンストレーションです。
pt_br: Este exemplo demonstra um cliente JMS interagindo com um servidor JBoss Messaging, encapsulando o tráfico sobre o protocolo HTTP.
zh_cn: 这个例子演示了 JMS 客户端通过 HTTP 协议和 JBoss Messaging 服务器进行交互。

source: This example demonstrates JBoss web-service interacting with JBoss Messaging.
de_de: Dieses Beispiel demonstriert die Interaktion des JBoss Web-Dienstes mit JBoss Messaging.
es_es: Este ejemplo demuestra JBoss web-service interactuando con JBoss Messaging.
fr_fr: Cet exemple montre un serveur-web JBoss en contact avec JBoss Messaging.
ja_jp: このサンプルは JBoss Messaging と対話する JBoss web サービスのデモンストレーションです。
pt_br: Este exemplo demonstra o serviço da web do JBoss, interagindo com o JBoss Messaging.
zh_cn: 这个例子演示了 JBoss web-service 和 JBoss Messaging 的交互。

source: This example demonstrates a JMS client interacting with a JBoss Messaging distributed queue - it requires two JBoss Application Server instances to be running.
de_de: Dieses Beispiel demonstriert die Interaktion eines JMS Clients mit einer JBoss Messaging distribuierten Warteschlange - zur Ausführung werden zwei JBoss Application Server Instanzen benötigt.
es_es: Este ejemplo demuestra el cliente JMS interactuando con una cola distribuida de JBoss Messaging - requiere que dos instancias del JBoss Application Server se encuentren ejecutando.
fr_fr: Cet exemple montre un client JMS en contact avec une file d'attente distribuée JBoss Messaging - qui exige deux instances de serveur JBoss Application pour être exécuté.
ja_jp: このサンプルは JBoss Messaging 分散型キュー と対話する JMS クライアントのデモンストレーションです。 これには、２つの JBoss Application Server インスタンスが稼働している必要があります。
pt_br: Este exemplo demonstra um cliente JMS interagindo com o JBoss Messaging distribuído em fila - isto requer que duas instâncias do Servidor de Aplicativo JBoss sejam rodadas.
zh_cn: 这个例子演示了 JMS 客户端和 JBoss Messaging 分布式队列的交互 － 它要求运行两个 JBoss 应用服务器实例。

source: This example demonstrates a JMS client interacting with a JBoss Messaging distributed topic - it requires two JBoss Application Server instances to be running.
de_de: Dieses Beispiel demonstriert die Interaktion eines JMS Clients mit einem JBoss Messaging distribuierten Topic - zur Ausführung werden zwei JBoss Application Server Instanzen benötigt.
es_es: Este ejemplo demuestra un cliente JMS interactuando con un tema distribuido de JBoss Messaging - requiere que dos instancias del JBoss Application Server se encuentren ejecutando.
fr_fr: Cet exemple montre un client JMS en contact avec un sujet distribué JBoss - ayant besoin que deux instances JBoss Application Server soient exécutées.
ja_jp: このサンプルは、JBoss Messaging 分散型 トピック と対話する JMS クライアントの デモンストレーションです。これには、２つの JBoss Application Server インスタンスが 稼働している必要があります。
pt_br: Este exemplo demonstra um cliente JMS interagindo com o tópico distribuído do JBoss Messaging - isto requer que duas instâncias do Servidor de Aplicativo JBoss sejam rodadas.
zh_cn: 这个例子演示了 JMS 客户端和 JBoss Messaging 分布式主题的交互 － 它要求运行两个 JBoss 应用服务器实例。

source: This example demonstrates a JMS client interacting with a clustered EJB2.1 stateless session bean, which in turn interacts with JBoss Messaging. The example uses HAJNDI to lookup the connection factory. It requires two JBoss Application Server instances to be running.
de_de: Dieses Beispiel demonstriert die Interaktion eines JMS Clients mit einem EJB2.1 Stateless Session Bean, das wiederum mit JBoss Messaging interagiert. Das Beispiel verwendet HAJNDI zur Suche nach der Connection Factory. Zur Ausführung werden zwei JBoss Application Server Instanzen benötigt.
es_es: Este ejemplo demuestra un cliente JMS interactuando con un bean de sesión sin estado EJB2.1 en clúster, el cual a su vez interactúa con JBoss Messaging. El ejemplo utiliza HAJNDI para buscar la fábrica de conexiones. Requiere que dos instancias del JBoss Application Server se encuentren ejecutando.
fr_fr: Cet exemple montre un client JMS en contact avec une sessionBean de type EJB2.1, sans état, et groupée, qui à son tour, interacte avec JBoss Messaging. L'exemple utilise HAJNDI pour chercher des informations dans l'usine de connexions. On a alors besoin de deux instances de JBoss Application Server pour l'exécuter.
ja_jp: このサンプルはクラスター化した EJB2.1 ステートレス セッション Bean と対話し、 その結果、 JBoss Messaging と対話する JMS クライアントのデモンストレーションです。 このサンプルでは、HAJNDI を使用して接続ファクトリをルックアップしています。これには、 ２つの JBoss Application Server インスタンスが稼働している必要があります。
pt_br: Este exemplo demonstra um cliente JMS interagindo com um bean de sessão sem estado EJB2.1 com cluster, que em retorno interage com o JBoss Messaging. O exemplo usa o HAJNDI para observar a criação de conexão. Isto requer que duas instâncias de Servidor de Aplicativo JBoss sejam rodadas.
zh_cn: 这个例子演示了 JMS 客户端和群集 EJB2.1 stateless session bean 的交互、以及它反过来和 JBoss Messaging 的交互。这个例子使用 HAJNDI 来查找连接工厂。它要求运行两个 JBoss 应用服务器实例。

source: This example demonstrates the usage of a message bridge. It deploys a message bridge in JBoss Application Server which then proceeds to move messages from a source to a target queue.
de_de: Dieses Beispiel demonstriert die Anwendung einer Nachrichtenbrücke (Message Bridge). Es deployt eine Nachrichtenbrücke im JBoss Application Server, die dann Nachrichten von einer Quelle zu einer Zielwarteschlange verschiebt.
es_es: Este ejemplo demuestra el uso de un puente de mensajes. Despliega un puente de mensajes en el JBoss Application Server, el cual procede a mover los mensajes desde una cola fuente a una destino.
fr_fr: Cet exemple montre comment utiliser le pont de messagerie. Il déploie un pont de messagerie dans JBoss Application Server, qui déplace ensuite des messages à partir d'une file d'attente source vers une file d'attente cible.
ja_jp: このサンプルはメッセージブリッジの使用法のデモンストレーションです。これは、 JBoss Application Server 内のメッセージブリッジをデプロイして、メッセージをソースから ターゲットキューまで移動するように進行します。
pt_br: Este exemplo demonstra o uso de uma interligação de mensagem. Ele implementa a interligação de mensagem no Servidor do Aplicativo JBoss, e então procede movendo mensagens a partir de uma fonte a uma fila de destinação.
zh_cn: 这个例子演示了消息桥（Message Bridge）的使用。它在 JBoss 应用服务器里部署消息桥，然后把消息从来源移至一个目标队列。

source: Running the Examples
de_de: Ausführen der Beispiele
es_es: Ejecución de los ejemplos
fr_fr: Exécuter les exemples
ja_jp: 判例の実行
pt_br: Rodando os Exemplos
zh_cn: 运行示例程序

source: Install Ant
de_de: Installation von Ant
es_es: Instale Ant
ja_jp: Ant のインストール
pt_br: Instalação do Ant
zh_cn: 安装 Ant

source: To compile the examples, you must have Apache Ant 1.6+ installed in your machine. You can download it from <ulink url="http://ant.apache.org"></ulink> and have it installed in few steps:
de_de: Um die Beispiele zu kompilieren muss Apache Ant 1.6+ auf Ihrer Maschine installiert sein. Sie können es unter <ulink url="http://ant.apache.org"></ulink> herunterladen und in wenigen Schritten installieren:
es_es: Para compilar los ejemplos debe tener Apache Ant 1.6+ instalado en su máquina. Puede descargarlo de <ulink url="http://ant.apache.org"></ulink> y puede instalarlo en pocos pasos:
fr_fr: Pour compiler les exemples, vous devrez installer Apache Ant 1.6+ sur votre machine. Vous pourrez le décharger à partir de <ulink url="http://ant.apache.org"></ulink> et l'installer en quelques étapes:
ja_jp: このサンプルをコンパイルするには、マシンに Apache Ant 1.6+ をインストールしている 必要があります。これは <ulink url="http://ant.apache.org"></ulink> からダウンロードが可能で、いくつかの手順でインストールできます。
pt_br: Para compilar os exemplos, você deverá possuir o Apache Ant 1.6+ instalado em sua máquina. Você poderá realizar o download disto a partir do <ulink url="http://ant.apache.org"></ulink> e instalá-lo, conforme abaixo:
zh_cn: 要编译这些例子，你必须安装 Apache Ant 1.6+。你可以从 <ulink url="http://ant.apache.org"></ulink> 上下载并按下列步骤安装：

source: Unzip the downloaded file to the directory of your choice.
de_de: Entzippen Sie die heruntergeladene Datei im Verzeichnis Ihrer Wahl.
es_es: Descomprima el archivo descargado en el directorio que escoja.
fr_fr: Décomprimer le fichier déchargé vers le répertoire de votre choix.
ja_jp: ダウンロードしたファイルを好みのディレクトリに展開します。
pt_br: Descomprima o arquivo que sofreu o download para o diretório de sua escolha.
zh_cn: 把下载的文件解压到你选定的目录。

source: Create an environment variable called <literal>ANT_HOME</literal> pointing to the Ant installation directory. You can do this by adding the following line to your <filename>.bashrc</filename> file (substituting with the actual location of the ant directory on your system):
de_de: Erstellen Sie eine Umgebungsvariable namens <literal>ANT_HOME</literal>, die auf das Ant Installationsverzeichnis weist. Sie können dies tun, indem Sie die folgende Zeile zur <filename>.bashrc</filename>-Datei hinzufügen (indem Sie sie mit dem tatsächlichen Speicherort des Ant-Verzeichnis auf Ihrem System ersetzen):
es_es: Cree una variable de entorno llamada <literal>ANT_HOME</literal> que apunte al directorio de instalación Ant. Puede hacer esto añadiendo la siguiente línea a su archivo <filename>.bashrc</filename> (substituyendo con la ubicación real del directorio ant en su sistema):
fr_fr: Créer un environnement variable nommé <literal>ANT_HOME</literal>. et pointant vers le répertoire d'installation Ant. Vous pouvez effectuer cela en ajoutant la ligne suivante dans votre fichier <filename>.bashrc</filename> (substituant ainsi la location de votre répertoire ant dans votre système):
ja_jp: Ant インストールのディレクトリにポイントした <literal>ANT_HOME</literal> と言う名の 環境変数を作成します。それは、<filename>.bashrc</filename> ファイルに 以下の行を追加して達成できます。（使用システムの Ant ディレクトリの実際の位置で 入れ替えること）:
pt_br: Crie uma variável do ambiente chamada <literal>ANT_HOME</literal>, indicando ao diretório de instalação Ant. Você pode realizar isto adicionando a seguinte linha a seu arquivo <filename>.bashrc</filename> (substituindo com a localização atual do diretório ant em seu sistema):
zh_cn: 创建名为 <literal>ANT_HOME</literal> 的环境变量，使其指向 Ant 的安装目录。你可以在 <filename>.bashrc</filename> 文件里添加如下一行来实现（你需要替换成实际的 Ant 目录）：

source: On Windows you do this by opening the Control Panel from the Start Menu, switching it to classic view if necessary, then opening System/Advanced/Environment Variables. Create a new variable, call it <literal>ANT_HOME</literal> and set it to be the ant directory.
de_de: Bei Windows erfolgt dies durch Öffnen eines Bedienfelds aus dem Start-Menü, dem Wechsel in die klassische Ansicht (Classic View), falls nötig, und des anschließenden Öffnens der System/Advanced/Umgebungsvariablen. Erstellen Sie eine neue Variable, nennen Sie diese <literal>ANT_HOME</literal> und stellen Sie diese als Ant-Verzeichnis ein.
es_es: Para hacer esto en Windows abra el panel de control desde el menú de inicio, cámbielo a la vista clásica si es necesario y luego abra Sistema/Avanzado/Variables de entorno. Cree una nueva variable, llámela <literal>ANT_HOME</literal> y configúrela para que sea el directorio ant.
fr_fr: Dans Windows, vous pouvez effectuer cela en ouvrant le panneau de configuration du menu de démarrage, en le faisant apparaître sur le format classique si besoin est, puis en ouvrant les variables d'environnement System/Advanced/Environment Variables. Créer une nouvelle variable, que vous appellerez <literal>ANT_HOME</literal> et configurez la comme répertoire 'ant'.
ja_jp: Windows では、スタートメニューからコントロールパネルを開き、必要であれば クラシックビューに変更し、システム/高度な設定/環境変数 へと移動します。新規の 変数を作成して <literal>ANT_HOME</literal> と命名し Ant ディレクトリを設定 します。
pt_br: No Windows você pode realizar isto abrindo o Painel de Controle a partir do Menu Inicial, modificando-o para a visualização clássica (se necessário), e então abrindo o Sistema/Avançado/Variáveis do Ambiente. Crie uma nova variável, chame isto de <literal>ANT_HOME</literal> e configure-a para estar no diretório ant.
zh_cn: 在 Windows 里，你可以从启动菜单里打开控制面板（如有需要则切换至经典视图），然后打开系统/高级/环境变量。创建一个新的变量，命名为 <literal>ANT_HOME</literal> 并设置为 Ant 的安装目录。

source: Add <literal>$ANT_HOME/bin</literal> to the system path to be able to run <literal>ant</literal> from the command line. You can do this by adding the following line to your <filename>.bashrc</filename> file:
de_de: Fügen Sie <literal>$ANT_HOME/bin</literal> dem Systempfad hinzu, damit Sie <literal>ant</literal> von der Befehlszeile aus ausführen können. Sie können dies tun, indem Sie Ihrer <filename>.bashrc</filename>-Datei folgende Zeile hinzufügen:
es_es: Añada <literal>$ANT_HOME/bin</literal> a la ruta del sistema para poder ejecutar <literal>ant</literal> desde la línea de comandos. Puede hacer esto añadiendo la siguiente línea a su archivo <filename>.bashrc</filename>:
fr_fr: Ajouter <literal>$ANT_HOME/bin</literal> au chemin d'accès du système pour pouvoir exécuter <literal>ant</literal> à partir de la ligne de commande. Vous pouver procéder en ajoutant la ligne suivante à votre fichier <filename>.bashrc</filename>:
ja_jp: コマンドラインから <literal>ant</literal> を実行できるようにシステムパスへ <literal>$ANT_HOME/bin</literal> を追加します。これは、<filename>.bashrc</filename> ファイルに以下の行を追加することで達成できます:
pt_br: Adicione o <literal>$ANT_HOME/bin</literal> ao caminho do sistema para estar apto a rodar o <literal>ant</literal>, a partir da linha de comando. Você pode fazer isto adicionando a linha seguinte a seu arquivo <filename>.bashrc</filename>:
zh_cn: 在系统路径里添加 <literal>$ANT_HOME/bin</literal>，这样就能够在命令行下运行 <literal>ant</literal> 了。你可以在 <filename>.bashrc</filename> 文件里添加如下一行来实现这一点：

source: On Windows you do this by opening the Control Panel from the Start Menu, switching it to classic view if necessary, then editing the <literal>PATH</literal> environment variable found in System/Advanced/Environment Variables/System Variables/Path. Add a semicolon and the path to the ant <filename class="directory">bin</filename> directory.
de_de: Bei Windows tun Sie dies, indem Sie das Bedienfeld vom Start-Menü aus öffnen, indem Sie falls nötig zum "Classic View" (klassische Ansicht) wechseln, dann die <literal>PATH</literal>-Umgebungsvariable bearbeiten, die sich in System/Advanced/Environment Variables/System Variables/Path befinden. Fügen Sie ein Semikolon und den Pfad zum Ant <filename class="directory">bin</filename>-Verzeichnis hinzu.
es_es: Para hacer esto en Windows abra el panel de control desde el menú de inicio, cámbielo a la vista clásica si es necesario y luego modifique la variable de entorno <literal>PATH</literal> que se encuentra en Sistem/Avanzado/Variables de entorno/Variables del sistema/Ruta. Añada un punto y coma y la ruta al directorio ant <filename class="directory">bin</filename>.
fr_fr: Dans Windows, vous pouvez effectuer cela en ouvrant le panneau de configuration à partir du menu de démarrage, en le faisant apparaître sous un format classique si besoin est, puis en modifiant la variable d'environnement <literal>PATH</literal> que l'on trouve dans System/Advanced/Environment Variables/System Variables/Path. Ajouter un point virgule et un chemin d'accès au répertoire 'ant' <filename class="directory">bin</filename>.
ja_jp: Windows では、スタートメニューからコントロールパネルを開いて、必要であればクラシックビューに 変更してから、システム/高度な設定/環境変数/システム変数/パス で見つけることができる <literal>PATH</literal> 環境変数を編集します。セミコロンと Ant の bin ディレクトリをパスに追加します
pt_br: No Windows você realiza isto abrindo o Painel de Controle a partir do Menu Inicial, modificando-o para uma visualização clássica (se necessário), e então editando a variável de ambiente <literal>PATH</literal> encontrada em System/Advanced/Environment Variables/System Variables/Path. Adicione um ponto e vírgula e o path ao ant de diretório <filename class="directory">bin</filename>.
zh_cn: 在 Windows 里，你可以从启动菜单里打开控制面板（如有需要则切换至经典视图），然后在系统/高级/环境变量/路径中找到并编辑环境变量 <literal>PATH</literal>。添加一个分号以及 Ant 的 <filename class="directory">bin</filename> 目录路径。
