Repository: bobmcwhirter/jboss-messaging
Catalog: docs/EAP_4_3/JBoss_Messaging_User_Guide/*/Running_Examples.po
Languages: de_de, es_es, fr_fr, ja_jp, pt_br, zh_cn

source: Verify your Ant installation. To do this type <literal> ant -version</literal> at the command prompt. Your output should look something like this:
de_de: Verifizieren Sie Ihre Ant Installation. Um dies zu tun, geben Sie <literal> ant -version</literal> im Befehls-Prompt ein. Ihre Ausgabe sollte wie folgt aussehen:
es_es: Verifique su instalación Ant. Para hacer esto escriba <literal> ant -version</literal> en el prompt de comandos. Su salida se debe ver similar a esta:
fr_fr: Vérifier votre installation Ant. Dans ce but, taper <literal> ant -version</literal> lorsque vous y serez invité. Votre sortie devra ressembler à ce qui suit:
ja_jp: Ant インストールを確認します。これを達成するには、コマンドプロンプトで <literal> ant -version</literal> を入力します。その出力は以下のようになるはずです:
pt_br: A verificação de sua instalação Ant. Para realizar isto, digite <literal> ant -version</literal> no comando de aviso. O seu emissor deverá parecer-se com o seguinte:
zh_cn: 你可以在命令行提示下输入 <literal> ant -version</literal> 来验证 Ant 安装。输出应该类似于：

source: Apache Ant version 1.7.0 compiled on December 13 2006
de_de: Apache Ant Version 1.7.0 kompiliert am 13. Dezember 2006

source: Set JBOSS_HOME Environment Variable
de_de: JBOSS_HOME Umgebungsvariable einstellen
es_es: Configure la variable de entorno JBOSS_HOME
fr_fr: Configure la variable d'environnement JBOSS_HOME
ja_jp: JBOSS_HOME 環境変数の設定
pt_br: Configuração da Variável de Ambiente JBOSS_HOME
zh_cn: 设置 JBOSS_HOME 环境变量

source: On a Linux Platform
de_de: Auf einer Linux-Plattform
es_es: En una plataforma Linux
fr_fr: Sur une plate-forme Linux
ja_jp: Linux プラットフォーム上では：
pt_br: Numa Plataforma Linux
zh_cn: 在 Linux 平台上

source: Create an environment variable that points to the installation directory (<filename>JBOSS_DIST/jboss-as</filename>) and call it <literal>JBOSS_HOME</literal>. Add <literal>$JBOSS_HOME/bin</literal> to the system path to be able to run the server from the command line. You can do this by adding the following lines to the <filename>.bashrc</filename> file in your home directory.
de_de: Erstellen Sie eine Umgebungsvariable, die auf das Installationsverzeichnis weist (<filename>JBOSS_DIST/jboss-as</filename>) und nennen Sie diese <literal>JBOSS_HOME</literal>. Fügen Sie dem Systempfad <literal>$JBOSS_HOME/bin</literal> hinzu, damit Sie den Server von der Befehlszeile aus ausführen können. Sie können dies tun, indem Sie folgende Zeilen der <filename>.bashrc</filename>-Datei in Ihrem Heimverzeichnis hinzufügen.
es_es: Cree una variable de entorno que apunte al directorio de instalación (<filename>JBOSS_DIST/jboss-as</filename>) y llámela <literal>JBOSS_HOME</literal>. Añada <literal>$JBOSS_HOME/bin</literal> a la ruta del sistema para poder ejecutar el servidor desde la línea de comandos. Puede hacer esto añadiendo las siguientes líneas al archivo <filename>.bashrc</filename> en su directorio de inicio.
fr_fr: Créez une variable d'environnement qui pointe vers le répertoire d'installation (<filename>JBOSS_DIST/jboss-as</filename>) et nommez le <literal>JBOSS_HOME</literal>. Ajouter <literal>$JBOSS_HOME/bin</literal> au chemin d'accès pour pouvoir exécuter le serveur grâce à une ligne de commande. Vous pouvez effectuer cela en ajoutant les lignes suivantes à votre fichier <filename>.bashrc</filename> dans votre répertoire personnel de base.
ja_jp: インストールディレクトリ（<filename>JBOSS_DIST/jboss-as</filename>）をポイントする環境変数、 <literal>JBOSS_HOME</literal> を作成します。 コマンドラインからサーバーを実行できるように システムパスに <literal>$JBOSS_HOME/bin</literal> を追加します。これを達成するには、ユーザーの ホームディレクトリ内の <filename>.bashrc</filename> ファイルに以下の行を追加します。
pt_br: Crie uma variável do ambiente que indica o diretório de instalação (<filename>JBOSS_DIST/jboss-as</filename>) e chama-o <literal>JBOSS_HOME</literal>. Adicione o <literal>$JBOSS_HOME/bin</literal> ao path do sistema, para que ele esteja apto a rodar o servidor a partir da linha de comando. Você pode realizar isto adicionando as linhas seguintes ao arquivo <filename>.bashrc</filename>, em seu diretório principal.
zh_cn: 创建一个指向安装目录（<filename>JBOSS_DIST/jboss-as</filename>）的环境变量并命名为 <literal>JBOSS_HOME</literal>。把 <literal>$JBOSS_HOME/bin</literal> 添加至系统路径以便从命令行下运行服务器。你可以在自己主目录里的 <filename>.bashrc</filename> 文件添加如下一样来实现：

source: #In this example /home/vrenish/EnterprisePlatform-4.3/jboss-as is the installation directory. export JBOSS_HOME=/home/vrenish/EnterprisePlatform-4.3/jboss-as export PATH=$PATH:$JBOSS_HOME/bin
de_de: #In diesem Beispiel ist /home/vrenish/EnterprisePlatform-4.3/jboss-as das Installationsverzeichnis. export JBOSS_HOME=/home/vrenish/EnterprisePlatform-4.3/jboss-as export PATH=$PATH:$JBOSS_HOME/bin
es_es: #En este ejemplo /home/vrenish/EnterprisePlatform-4.3/jboss-as es el directorio de instalación. export JBOSS_HOME=/home/vrenish/EnterprisePlatform-4.3/jboss-as export PATH=$PATH:$JBOSS_HOME/bin

source: On Microsoft Windows
de_de: Bei Microsoft Windows
es_es: En Microsoft Windows
fr_fr: Sur Microsoft Windows
ja_jp: Microsoft Windows 上では：
pt_br: No Microsoft Windows
zh_cn: 在 Microsoft Windows 平台上

source: Create an environment variable called <literal>JBOSS_HOME</literal> that points to the installation directory, for example: C:\Program Files\EnterprisePlatform-4.3\jboss-as\. In order to run the server from the command line add the <filename>bin</filename> directory to your path, for example: C:\Program Files\EnterprisePlatform-4.3\jboss-as\bin. To do this, open the Control Panel from the Start Menu, switch to Classic View if necessary, open the System Control Panel applet, select the Advanced Tab, and click on the Environment Variables button.
de_de: Erstellen Sie eine Umgebungsvariable namens <literal>JBOSS_HOME</literal>, die auf das Installationsverzeichnis weist, zum Beispiel: C:\Program Files\EnterprisePlatform-4.3\jboss-as\. Um den Server von der Befehlszeile aus auszuführen, fügen Sie Ihrem Pfad das <filename>bin</filename>-Verzeichnis hinzu, zum Beispiel: C:\Program Files\EnterprisePlatform-4.3\jboss-as\bin. Um dies zu tun, öffnen Sie das Bedienfeld vom Start-Menü, wechseln Sie falls nötig zum "Classic View" (klassische Ansicht), öffnen Sie das System Control Panel Applet, wählen Sie Advanced Tab (fortgeschrittener Tab), und klicken Sie auf die "Environment Variables"-Schaltfläche.
es_es: Cree una variable de entorno llamada <literal>JBOSS_HOME</literal> que apunte al directorio de instalación, por ejemplo: C:\Program Files\EnterprisePlatform-4.3\jboss-as\. Con el fin de ejecutar el servidor desde la línea de comandos añada el directorio <filename>bin</filename> a su ruta, por ejemplo: C:\Program Files\EnterprisePlatform-4.3\jboss-as\bin. Para hacer esto, abra el panel de control desde el menú de inicio, cambie a la vista clásica si es necesario, abra el applet del panel de control del sistema, seleccione la pestaña avanzada y haga click en el botón de las variables de entorno.
fr_fr: Créer une variable d'environnement nommée <literal>JBOSS_HOME</literal> qui pointe vers le répertoire d'installation, par exemple: C:\Program Files\EnterprisePlatform-4.3\jboss-as\. Afin d'exécuter le serveur à partir d'une ligne de commande, ajouter le répertoire <filename>bin</filename> à votre chemin d'accès, par exemple: C:\Program Files\EnterprisePlatform-4.3\jboss-as\bin. Pour cela, ouvrir le panneau de configuration du menu de démarrage, faites apparaître le format d'affichage classique si besoin est, ouvrez l'appliquette System Control Panel, sélectionnez Advanced Tab, et cliquez sur le bouton Environment Variables.
ja_jp: インストールディレクトリにポイントする <literal>JBOSS_HOME</literal> と言う名の 環境変数を作成します。例えば、 C:\Program Files\EnterprisePlatform-4.3\jboss-as\ コマンドラインからサーバーを実行出来るように パスに <filename>bin</filename> ディレクトリを追加します。例えば、C:\Program Files\EnterprisePlatform-4.3\jboss-as\bin これを達成するには、スタートメニューからコントロールパネルを開いて、必要であればクラシックビューに変更してから システムコントロールパネルアイコンを開きます。高度な設定のタブを選択して環境変数のボタンをクリックします。
pt_br: Crie uma variável de ambiente chamada <literal>JBOSS_HOME</literal>, da qual indica o diretório de instalação, por exemplo: C:\Program Files\EnterprisePlatform-4.3\jboss-as\. Com o objetivo de rodar o servidor a partir da linha de comando, adicione o diretório <filename>bin</filename> a seu path, por exemplo: C:\Program Files\EnterprisePlatform-4.3\jboss-as\bin. Para isto, abra o Painel de Controle a partir do Menu Inicial, modifique para Visualização Clássica (se necessário), abra o applet do Painel de Controle do Sistema, selecione a Tabulação Avançada e clique no botão das Variáveis do Ambiente.
zh_cn: 创建一个指向安装目录的环境变量（如 C:\Program Files\EnterprisePlatform-4.3\jboss-as\） ，命名为 <literal>JBOSS_HOME</literal>。为了从命令行下运行服务器，你需要把 <filename>bin</filename> 目录添加至系统路径，如 C:\Program Files\EnterprisePlatform-4.3\jboss-as\bin。你可以这样来完成：从启动菜单里打开控制面板（如有需要则切换至经典视图），打开“系统”，然后选择“高级”标签页并点击“环境变量”按钮。

source: Run the Example
de_de: Das Beispiel ausführen
es_es: Ejecute el ejemplo
fr_fr: Exécuter un exemple
ja_jp: サンプルの実行
pt_br: Excecução do Exemplo
zh_cn: 运行这个例子

source: Make sure you start the JBoss Application server before trying to run the examples. The non clustered examples expect a single JBoss Application Server instance to be running with all the default settings. The clustered examples expect two JBoss Application Server instances to be running with ports settings as per ports-01 and ports-02. For each example, you can always override the default ports it will try to connect to by editing <literal>jndi.properties</literal> in the particular example's directory.
de_de: Stellen Sie sicher, dass Sie den JBoss Application Server starten, ehe Sie versuchen, die Beispiele auszuführen. Die nicht-geclusterten Beispiele erwarten, dass eine einzelne JBoss Application Server Instanz mit allen Standardeinstellungen läuft. Die geclusterten Beispiele erwarten, dass zwei JBoss Application Server Instanzen mit den Port-Einstellungen ports-01 und ports-02 laufen. Für jedes Beispiel können Sie stets die Standard-Ports außer Kraft setzen, es wird versucht durch Bearbeitung von <literal>jndi.properties</literal> im Verzeichnis des jeweiligen Beispiels eine Verbindung herzustellen.
es_es: Asegúrese de iniciar el servidor de aplicaciones de JBoss antes de intentar ejecutar los ejemplos. Los ejemplos sin clústers esperan que una sola instancia del servidor de aplicaciones de JBoss esté ejecutando con todos los valores predeterminados. Los ejemplos con clústers esperan que dos de las instancias del servidor de aplicaciones de JBoss estén ejecutando con configuraciones de puerto como las de ports-01 y ports-02. Por cada ejemplo, siempre puede sobreescribir los puertos predeterminados a los que intentará conectarse modificando <literal>jndi.properties</literal> en el directorio del ejemplo en particular.
fr_fr: Veillez à bien démarrer le serveur d'applications JBoss avant d'essayer d'exécuter les exemples. Avec les exemples non groupés, on s'attendent à ce que l'instance unique de JBoss Application Server, soit exécutés avec tous les paramètres par défaut. Avec les exemples groupés, on s'attend à ce que les deux instances de JBoss Appication Server soient exécutées avec les configurations de ports, en tant que ports-01 et ports-02. Pour chaque exemple, vous pourrez toujours passer outre les ports par défaut. Le système tentera de se connecter en modifiant <literal>jndi.properties</literal> dans le répertoire de l'exemple lui-même.
ja_jp: サンプルの実行を試す前に JBoss Application server を確実に開始します。 クラスター化に対応していないサンプルは全てがデフォルト設定の単独の JBoss Application Server インスタンスが実行していることを想定します。クラスター化したサンプルでは、 ports-01 と ports-02 としてのポート設定を持つ２つの JBoss Application Server インスタンスが 実行していることを想定します。各サンプルには、特定のサンプルディレクトリ内にある <literal>jndi.properties</literal> を編集することにより、接続しようとするデフォルトの ポートを常に書き換えることができます。
pt_br: Certifique-se de iniciar o servidor do Aplicativo JBoss antes de tentar rodar os exemplos. Os exemplos sem cluster esperam que uma instância do Servidor do Aplicativo seja rodada com todas as configurações padrões. Os exemplos com cluster esperam que as instâncias do Servidor do Aplicativo JBoss sejam rodadas com configurações de portais, conforme os portais-01 e portais-02. Por exemplo: você pode sempre substituir os portais padrões que isto tentará conectar-se, apenas editando as <literal>jndi.properties</literal> no diretório do exemplo específico.
zh_cn: 请确保在运行这些例子之前启动了 JBoss 应用服务器。非群集的示例需要单个的 JBoss 应用服务器实例以缺省设置运行。群集示例则需要两个 JBoss 应用服务器实例并设置端口（如 ports-01 和 ports-02）。对于每个示例，你都可以通过编辑其相应目录下的 <literal>jndi.properties</literal> 来覆盖它试图连接的缺省端口。

source: To run any of the examples inside the <literal>JBOSS_DIST/doc/examples/jboss-messaging-examples</literal> directory, navigate to the example's folder in a command line prompt, and type <literal>ant</literal>.
de_de: Um die Beispiele innerhalb des <literal>JBOSS_DIST/doc/examples/jboss-messaging-examples</literal>-Verzeichnisses auszuführen, navigieren Sie in einem Befehlszeilenprompt zum Ordner des Beispiels und geben Sie <literal>ant</literal> ein.
es_es: Para ejecutar cualquiera de los ejemplos dentro del directorio <literal>JBOSS_DIST/doc/examples/jboss-messaging-examples</literal>, navegue hasta el folder de los ejemplos en una terminal y escriba <literal>ant</literal>.
fr_fr: Pour exécuter un des exemples situés à l'intérieur du répertoire <literal>JBOSS_DIST/doc/examples/jboss-messaging-examples</literal>, naviguer dans le dossier de l'exemple, dans une invite de ligne de commande, et taper <literal>ant</literal>.
ja_jp: <literal>JBOSS_DIST/doc/examples/jboss-messaging-examples</literal> ディレクトリ内で いずれかのサンプルを実行するには、コマンドラインプロンプトでサンプルのフォルダーへ移動して、 <literal>ant</literal> を実行します。
pt_br: Para rodar qualquer um dos exemplos dentro do diretório <literal>JBOSS_DIST/doc/examples/jboss-messaging-examples</literal>, navegue para a pasta de aviso da linha de comando e digite <literal>ant</literal>.
zh_cn: 要运行 <literal>JBOSS_DIST/doc/examples/jboss-messaging-examples</literal> 目录里的任何示例，你可以进入该示例的目录，并输入 <literal>ant</literal>。

source: export PATH=$PATH:$ANT_HOME/bin
pt_br: Exportação PATH=$PATH:$ANT_HOME/bin
